[{
	"title": "\"Victory is Sweet\" Potato Salad",
	"totalTime": "50 min",
	"prepTime": "35 min",
	"inactiveTime": -1,
	"cookTime": "15 min",
	"level": "easy",
	"directions": ["Preheat a grill to medium.", "Peel the sweet potatoes and cut them into 1-inch slices. Grill over medium coals until just tender, about 10 minutes. Cut into large julienne strips and set aside.", "In a large mixing bowl add the tarragon vinegar, mustard and sugar and whisk to blend. Slowly drizzle in the canola oil and whisk until emulsified. Add the chopped tarragon and the onion.", "Bring a large pot of water to a boil over medium heat. Add the green beans and blanch for 20 seconds. Transfer them to a bowl of ice water to stop the cooking, then drain. In large bowl add the sweet potatoes and the green beans. Pour in the vinaigrette and toss to coat. Season with salt and pepper, to taste, and transfer the salad to a serving platter. Top with blue cheese and almonds and serve."],
	"exactIngredients": ["3 large sweet potatoes", "3 tablespoons tarragon vinegar", "1/2 cup Dijon mustard (recommended: Bone Suckin')", "1 tablespoon sugar", "2 cups canola oil", "2 tablespoons chopped tarragon leaves", "1/2 small red onion, diced", "8 ounces fresh green beans", "Salt and freshly ground black pepper", "4 ounces blue cheese, crumbled", "4 tablespoons smoked jalapeno almonds", "A viewer, who may not be a professional cook, provided this recipe. The Food Network Kitchens chefs have not tested this recipe and therefore, we cannot make representation as to the results."],
	"baseIngredients": ["sweet potato", "tarragon", "beans", "cheese", "chef"]
}, {
	"title": "Tomato, Caper and Garlic Crostini",
	"totalTime": "25 min",
	"prepTime": "15 min",
	"inactiveTime": -1,
	"cookTime": "10 min",
	"level": "easy",
	"directions": ["Tear the 3 thick slices of Italian bread into small 1-inch chunks and place in a medium mixing bowl. Add the red wine vinegar and toss to coat the bread and allow to soak for 10 minutes.", "In a small bowl, add the tomato paste and mix in 2 tablespoons of warm water to dilute. Set aside.", "Into the bowl of a food processor, add the capers, garlic, parsley and olive oil until you get a coarse chop. Add the soaked bread and tomato paste and mix until all the garlic is finely chopped. Season with salt and pepper, to taste. ", "Spread the mixture onto the toasted crostini slices and serve."],
	"exactIngredients": ["3 thick slices Italian bread, crusts removed", "1/4 cup red wine vinegar", "6 tablespoons tomato paste", "2 tablespoons warm water", "2 tablespoons capers", "2 cloves garlic", "1 bunch Italian flat-leaf parsley", "1/2 cup extra-virgin olive oil", "Salt and fresh ground black pepper", "6 thinly sliced pieces Italian bread, brushed with extra-virgin olive oil and toasted"],
	"baseIngredients": ["bread", "tomato", "capers"]
}, {
	"title": "Dried Fruit Compote",
	"totalTime": "50 min",
	"prepTime": "10 min",
	"inactiveTime": "20 min",
	"cookTime": "20 min",
	"level": "easy",
	"directions": ["In a large bowl combine all of the dried fruit and add enough hot water to cover by an inch. Soak for 20 minutes. Drain the mixture. ", "In a saucepan combine the fruit with the sugar, the lemon and orange zests, the lemon juice, and the water and bring to a boil. Reduce heat and simmer the mixture for 10 to 20 minutes, or until the fruit is tender. Remove the pan from the heat and let the compote cool. The compote will keep for a week if covered and chilled. Serve the compote at room temperature with ice cream."],
	"exactIngredients": ["1/3 cup chopped dried apples", "1/3 cup chopped dried pears", "1/3 cup raisins", "1/3 cup dried cranberries or cherries", "2/3 cup dried apricots", "1/4 cup sugar", "1/2 tablespoon freshly grated lemon zest", "1/2 tablespoon freshly grated orange zest", "1/2 tablespoon fresh lemon juice, or to taste", "1 cup water", "Serving suggestion: ice cream"],
	"baseIngredients": ["apple", "pear", "raisin", "cherry", "apricot", "lemon", "orange", "ice cream"]
}, {
	"title": "L'Osso Buco a l'Orange",
	"totalTime": "4 hr",
	"prepTime": "1 hr",
	"inactiveTime": -1,
	"cookTime": "3 hr",
	"level": "easy",
	"directions": ["Put 2 tablespoons flour into a good plastic bag. Add a little salt and pepper and shake to combine. Wipe veal pieces with a damp cloth to remove any bone dust. Place pieces of veal knuckle into bag and shake to cover each piece with flour. Place clarified butter and oil into a large skillet (frying pan) and heat to 400 degrees F. Place floured veal pieces into the butter/oil. They should foam and fry until golden. Turn to color evenly. Add the onions, garlic, carrots and orange zest. Toss veal pieces and vegetables together and lower heat to 300 degrees F. and allow to \"sweat\" (the natural oils \"bead\" out of the vegetables like perspiration) for 3 minutes. Now add 2 cups dry white wine and scrape pan base with wooden \"spurtle\" or spoon to lift up any sediment into the sauce. Reduce heat to simmer, add the bouquet garni (tie up with string if fresh or in a muslin bag if dried herbs are used) and the tomato paste which you need to stir in well. Simmer with a tight cover for 2 hours - adding another 1 1/4 cups dry white wine. About 30 minutes before serving add the orange juice. When the meat is very tender remove the veal pieces, pass the sauce and vegetables through a strainer and reheat the veal knuckle pieces in the sauce. Correct the seasoning and thicken, if necessary, with a little arrowroot paste. Dish the rice with the orange pieces on a large serving plate. Pile the veal pieces on top and coat with the sauce."],
	"exactIngredients": ["2 tablespoons flour", "Freshly ground salt", "Freshly ground pepper", "4 pounds veal knuckles, sawn into 8 pieces, 1-inch rounds", "2 tablespoons clarified butter", "2 tablespoons olive oil", "2 medium onions, finely chopped", "1 clove garlic, peeled and crushed", "2 medium carrots, finely chopped", "2 large oranges, zest and juice from one and the other peeled and chopped fine", "3 1/4 cups dry white wine", "1 bouquet garni (1 bay leaf, 4 stalks parsley, 1 sprig thyme, 3-inch piece celery)", "1 teaspoon tomato paste", "Arrowroot (if necessary for thickening)", "8 ounces long grain rice, boiled"],
	"baseIngredients": ["veal", "carrot", "orange", "celery", "tomato", "grain"]
}, {
	"title": "Mahana Cocktail",
	"totalTime": "5 min",
	"prepTime": "5 min",
	"inactiveTime": -1,
	"cookTime": -1,
	"level": "easy",
	"directions": ["Blend the pineapple, triple sec, vodka and ice. Serve in burgundy glasses with pineapple as a garnish.", "This recipe was provided by a chef, restaurant or culinary professional and may have been scaled down from a bulk recipe. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],
	"exactIngredients": ["10 pieces fresh Moorea pineapple, plus more for garnish", "1/2 tablespoon triple sec, such as Cointreau", "3 tablespoons vodka, house-infused with Taha'a vanilla", "Ice"],
	"baseIngredients": ["pineapple", "vanilla"]
}, {
	"title": "Open Faced Smoked Chicken and Mustard Fruits Sandwich",
	"totalTime": "16 min",
	"prepTime": "10 min",
	"inactiveTime": -1,
	"cookTime": "6 min",
	"level": "easy",
	"directions": ["*Cook's Note: Mustard fruits are available at gourmet markets and Italian specialty stores.", "Preheat the oven to 400 degrees F. ", "Toast the pumpkin bread for about 6 minutes. Allow the bread to cool then spread each slice with a thin layer of apricot jam. In a small bowl, mix the remaining jam with the mustard fruits and smoked chicken. Spoon chicken mixture onto each slice of bread. Cut the sandwiches in half diagonally (corner to corner) and arrange on 4 plates. Garnish with the plums, if desired, and serve."],
	"exactIngredients": ["8 (3/8-inch) thick slices pumpkin bread", "2 ounces apricot jam", "2 ounces mustard fruits, cut in small dice*", "2 ounces smoked chicken, cut in small dice", "2 plums, halved, pitted and cut into fans, for garnish"],
	"baseIngredients": ["bread", "apricot", "fruit", "chicken"]
}, {
	"title": "Spiced Curly Tortilla Chips",
	"totalTime": "50 min",
	"prepTime": "20 min",
	"inactiveTime": -1,
	"cookTime": "30 min",
	"level": "easy",
	"directions": ["Preheat oven to 350 degrees F. ", "Brush both sides of tortillas with oil and with scissors cut each tortilla into about 5 randomly shaped wavy strips. In 2 large shallow baking pans arrange 1/2 of strips in 1 layer. (Strips should curl up on their own, but if necessary gently twist or fold them over.) ", "In a small bowl combine chili powder, salt, and sugar and through a small sieve sprinkle 1/2 of mixture over tortilla strips in pans. Bake tortilla strips in upper and lower thirds of oven until just crisp, 6 to 8 minutes, and transfer to paper towels to cool. Make more chips in same manner with remaining tortilla strips and chili mixture."],
	"exactIngredients": ["32 (6-inch) corn tortillas", "About 1/2 cup vegetable oil", "3 tablespoons chili powder", "1 1/2 teaspoons salt", "1 teaspoon sugar"],
	"baseIngredients": ["corn", "chili"]
}, {
	"title": "Freezy-Cool Banana Whoopie Pies",
	"totalTime": "1 hr 5 min",
	"prepTime": "5 min",
	"inactiveTime": "1 hr",
	"cookTime": -1,
	"level": "easy",
	"directions": ["Carefully slice one VitaTop in half lengthwise, so that you are left with 2 thin round \"slices.\"", "Evenly place 1/4th of the whipped topping on one slice. Top with 1/4th of the banana slices, followed by the other slice.", "Repeat with the remaining VitaTops, whipped topping, and banana slices. Freeze them until solid, about 1 hour. So good!", "PER SERVING (1 whoopie pie): 150 calories, 2g fat, 155mg sodium, 34g carbs, 9g fiber, 18.5g sugars, 4g protein"],
	"exactIngredients": ["4 Vitalicious VitaTops (any chocolate flavor), frozen", "3/4 cup fat-free whipped topping, thawed from frozen", "1 banana, very thinly sliced"],
	"baseIngredients": ["chocolate", "banana"]
}, {
	"title": "Lucia's Christmas Caponata",
	"totalTime": "1 hr 15 min",
	"prepTime": "20 min",
	"inactiveTime": "30 min",
	"cookTime": "25 min",
	"level": "easy",
	"directions": ["Heat the extra-virgin olive oil in a large frying pan. Gently saute the celery and garlic. Add the eggplant, salt, and black pepper. Cook until the eggplant is golden. Add the vinegar and allow to reduce. Mix in the chocolate and remove from the heat and allow to rest for 30 minutes before serving."],
	"exactIngredients": ["1 cup/250 ml extra-virgin olive oil", "2 celery stalks, chopped", "2 cloves garlic, crushed", "2 medium eggplants, diced", "Salt and freshly ground black pepper", "1/4 cup/50 ml red wine vinegar", "4 ounces/120 g grated bittersweet chocolate"],
	"baseIngredients": ["celery", "eggplant", "chocolate"]
}, {
	"title": "Castnet's Oyster Po'boy",
	"totalTime": "40 min",
	"prepTime": "30 min",
	"inactiveTime": -1,
	"cookTime": "10 min",
	"level": "easy",
	"directions": ["Preheat the oil to 350 degrees F in a deep-fryer or large pot.", "Make a large mound with the yellow corn flour. Using a sieve, drain the freshly shucked oysters of excess fluid and place on top of the flour mound. Coat the oysters completely with the yellow flour, making sure there are no wet spots on the oysters themselves.", "Sift any excess flour from the oysters and place into the fryer. Deep fry until golden brown, about 3 minutes. Remove and dust with the seasoning salt.", "Cut the baguette into 2 separate pieces. Spread mayo on half of the baguette (and ketchup and hot sauce, if using) and layer with some lettuce, tomatoes and then some pickles.", "Place the fried oysters on the other side of the baguette, before joining the 2 halves. Cut each baguette in half again and serve.", "This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],
	"exactIngredients": ["Vegetable oil", "5 cups yellow corn flour", "70 oysters, shucked", "Fresh seasoning salt or Louisiana Cajun seasoning", "1 (36-inch) Leidenheimer bread baguette or any baguette or hoagie loaf", "Mayonnaise", "Lettuce leaves", "Tomato slices", "Pickles", "Ketchup, optional", "Hot sauce, optional"],
	"baseIngredients": ["corn", "oyster", "bread", "lettuce", "tomato", "ketchup", "hot sauce"]
}, {
	"title": "Green Beans with Mustard",
	"totalTime": -1,
	"prepTime": -1,
	"inactiveTime": -1,
	"cookTime": -1,
	"level": "",
	"directions": [],
	"exactIngredients": [],
	"baseIngredients": []
}, {
	"title": "Southwestern Turkey Salsa Roll",
	"totalTime": "10 min",
	"prepTime": "5 min",
	"inactiveTime": -1,
	"cookTime": "5 min",
	"level": "easy",
	"directions": ["1/2 pound sliced, smoked turkey breast", "1/2 cup shredded reduced-fat Monterey jack cheese", "1 cup no-sugar added tomato salsa", "Place turkey slices on a counter or plate and sprinkle each slice with cheese. Roll up slices and divide between 2 plates. Microwave each plate on high for 1 minute or until the cheese melts. If not using a microwave oven, place turkey rolls in a toaster oven or on a foil-lined tray under a broiler for 1 minute. Remove plates from microwave and spoon salsa over the top. "],
	"exactIngredients": ["Sliced turkey roll stuffed with Monterey Jack cheese can be topped with salsa and is a breakfast that can be made ahead and warmed in 1 minute in a microwave oven before eating."],
	"baseIngredients": ["breakfast"]
}, {
	"title": "Iron Works BBQ's Boneless Beef Ribs",
	"totalTime": -1,
	"prepTime": -1,
	"inactiveTime": -1,
	"cookTime": -1,
	"level": "",
	"directions": [],
	"exactIngredients": [],
	"baseIngredients": []
}, {
	"title": "Bloody Marys",
	"totalTime": "10 min",
	"prepTime": "10 min",
	"inactiveTime": -1,
	"cookTime": -1,
	"level": "easy",
	"directions": ["Mix 6 ounces vodka, 1 cup pasta sauce, 1/2 cup water, 6 tablespoons lime juice and 1 tablespoon horseradish in a pitcher; season with celery salt, Worcestershire and hot sauce.", "See all 50 recipes using pasta sauce."],
	"exactIngredients": [],
	"baseIngredients": []
}, {
	"title": "Startini",
	"totalTime": "5 min",
	"prepTime": "5 min",
	"inactiveTime": -1,
	"cookTime": -1,
	"level": "easy",
	"directions": ["Gold leaf, for garnish", "Pour vodka and pomegranate juice into a cocktail shaker with ice. Strain into a martini glass rimmed with gold sugar and top with a splash of chilled Champagne. Float gold leaf and serve."],
	"exactIngredients": ["2 ounces vodka", "2 ounces pomegranate liqueur (recommended: PAMA)", "Champagne", "Gold sugar, for garnish"],
	"baseIngredients": ["pomegranate"]
}, {
	"title": "Cinnamon Grapefruitade",
	"totalTime": "15 min",
	"prepTime": "10 min",
	"inactiveTime": -1,
	"cookTime": "5 min",
	"level": "easy",
	"directions": ["Make 2 cups simple syrup (recipe below), adding 4 cinnamon sticks before heating. Let cool, then pour into an ice-filled pitcher. Stir in 2 cups each fresh grapefruit juice and water and some raspberries.", "Simple Syrup: To make 2 cups simple syrup, bring 1 1/2cups each sugar and water to a boil, stirring until dissolved. Let cool.", "Photograph by Jonathan Kantor"],
	"exactIngredients": [],
	"baseIngredients": []
}, {
	"title": "Caipirhinas",
	"totalTime": "5 min",
	"prepTime": "5 min",
	"inactiveTime": -1,
	"cookTime": -1,
	"level": "easy",
	"directions": ["In a sturdy rocks glass, place lime wedges to halfway mark of glass. Add sugar and muddle limes and sugar together. Top glass with ice and add Cachaca. Stir vigorously."],
	"exactIngredients": ["2 limes, cut into 1/8", "2 teaspoons sugar", "1 -ounce Cachaca", "Special equipment: muddler"],
	"baseIngredients": ["lime"]
}, {
	"title": "Frogmill Meringue Gateau",
	"totalTime": "2 hr",
	"prepTime": "1 hr",
	"inactiveTime": -1,
	"cookTime": "1 hr",
	"level": "easy",
	"directions": ["To make sponge cake: Place the eggs and sugar into a bowl standing over hot water and whisk until the mixture is pale and thickened (about 5 minutes). Remove from the heat and whisk for 2 minutes more. Fold in the sifted flour and add the salt. Pour into an 8-inch cake tin which has been greased, sugared and floured. Bake in a 375 degree oven for 25 minutes. Cool on a cake rack.", "To make pastry cream: Heat milk until boiling. Mix the egg yolks with the sugar and when well combined add the flour. Whisk until smooth and then gradually add the hot milk. Place the pastry cream back into the saucepan over a gentle heat and whisk until cream comes to a boil and thickens. Flavor with almond extract and then lower heat and allow to cook 10 minutes. Remove from heat and cool placing a piece of buttered waxed paper over the surface to prevent a skin from forming.", "To make meringue: Beat the egg whites until stiff peaks form. Flavor with almond extract and then fold in the sugar. This mixture should be very thick.", "To garnish: Preheat oven to 500 degrees. Cut cake into 3 layers. Soak bottom and middle layer with creme de cacao. Spread the bottom and middle layers of the cake with the cooled pastry cream and sprinkle with the almond slivers. Reform the cake and place onto a large round oven dish. Spread cake with a thin layer of meringue. Fill a large piping bag with a rose shaped tip and pipe meringue in vertical loops around the sides and on top of the cake. Dust cake with sifted confectioners' sugar and place into oven for 3 minutes to lightly brown."],
	"exactIngredients": ["Sponge cake:", "4 eggs", "1/2 cup superfine sugar", "1 cup flour, sifted", "Pinch salt", "Pastry cream:", "3 3/4 cups milk", "6 egg yolks", "3/4 cup superfine sugar", "3/4 cup flour", "1 teaspoon almond extract", "Meringue:", "6 egg whites", "1/4 teaspoon almond extract", "2 cups sugar", "Garnish:", "4 tablespoons Creme de Cacao", "4 tablespoons almond slivers", "Confectioners' sugar for dusting, sifted"],
	"baseIngredients": ["cake", "egg", "cream", "milk", "meringue"]
}, {
	"title": "Adam and Eve on a Raft (Poached Eggs with Roasted Tomatoes, Mushrooms and Ham)",
	"totalTime": "1 hr 30 min",
	"prepTime": "15 min",
	"inactiveTime": -1,
	"cookTime": "1 hr 15 min",
	"level": "easy",
	"directions": ["To roast tomatoes and mushrooms and make sauce: Preheat oven to 400 degrees F. Toss tomatoes and mushrooms with salt, pepper, and 2 tablespoons oil in a roasting pan. Arrange tomatoes cut sides up, then bake vegetables in lower third of oven until softened, about 20 minutes for mushrooms and 30 minutes for tomatoes. (Transfer mushrooms to a bowl while tomatoes finish roasting.) ", "Transfer 8 tomato halves to a blender and puree with 1 tablespoon oil until smooth. (Thin sauce with water, if desired.) Season with salt and pepper and transfer to a small ovenproof dish for reheating. ", "To toast bread while vegetables roast: Brush both sides of bread slices with remaining 2 tablespoons oil, then bake on a baking sheet in upper third of oven until crisp and golden on edges, about 10 minutes. Rub tops of toasts with cut sides of garlic. Leave toasts on baking sheet. (Leave oven on.)", "To poach eggs and finish dish: Fill a deep 12-inch skillet or small flameproof roasting pan with 8 cups cold water. Add vinegar and bring to a simmer to poach eggs. ", "Reheat tomato sauce and roasted tomatoes and mushrooms in lower third of oven 5 to 10 minutes. ", "Meanwhile, fold a slice of ham on top of each toast and heat in upper third of oven until warm, about 3 minutes. ", "While other ingredients are reheating, break 1 egg into a cup, then slide egg into simmering water. Repeat with remaining eggs, spacing them apart, and poach at a bare simmer until whites are firm but yolks are still runny, 2 to 3 minutes. ", "Transfer eggs with a slotted spoon to paper towels to drain and season with salt and pepper. Put 1 or 2 toasts on each plate and top each with a tomato half and a poached egg. Drizzle with tomato sauce and scatter mushrooms around eggs. ", "Cooks' notes: The eggs in this recipe will not be fully cooked, which may be of concern if salmonella is a problem in your area. You can substitute pasteurized eggs (in the shell) or cook eggs longer. ", "Vegetables can be prepared 1 day ahead. Chill tomatoes, mushrooms, and sauce separately, covered. ", "Toasts can be made 1 day ahead and cooled completely, then kept in a sealed plastic bag at room temperature."],
	"exactIngredients": ["8 large plum tomatoes (1 1/3 pounds), halved lengthwise", "3/4 pound mushrooms, trimmed and halved (quartered if large)", "1/2 teaspoon salt", "1/4 teaspoon black pepper", "5 tablespoons olive oil", "8 (1/2-inch thick) slices Italian bread (3 to 4 inches wide)", "1 garlic clove, halved crosswise", "8 cups cold water", "1 cup distilled white vinegar", "1/4 pound thinly sliced smoked ham (8 slices)", "8 large eggs"],
	"baseIngredients": ["tomato", "mushroom", "bread", "ham", "egg"]
}, {
	"title": "Point Reyes Bleu and Nectarine Bruschetta",
	"totalTime": "40 min",
	"prepTime": "30 min",
	"inactiveTime": -1,
	"cookTime": "10 min",
	"level": "easy",
	"directions": ["Preheat grill to medium heat.", "Slice the baguette on the bias to create long thin slices. Toss the baguette slices with the olive oil and salt and pepper, to taste.", "Cut the nectarines in half, remove the pit and cut each half into 4 wedges. Hold 2 skewers 1-inch apart in one hand and use the other to skewer each nectarine wedge on both. Skewer 4 wedges on each pair of skewers.", "Grill the bread until golden and toasted, about 1 minute per side. Meanwhile, grill the nectarines until they have grill marks and begin to soften, about 2 minutes per side.", "Spread some bleu cheese dip on each baguette slice and top with grilled nectarines."],
	"exactIngredients": ["1 baguette", "1/2 cup olive oil", "Kosher salt and freshly ground black pepper", "3 nectarines", "1 cup bleu cheese dip (recommended: Point Reyes Bleu Cheese Dip)", "12 (8-inch) bamboo skewers, soaked in water 30 minutes"],
	"baseIngredients": ["nectarine", "cheese"]
}]