[{"title":"Eggplant Salad","totalTime":"1 hr 25 min","prepTime":"35 min","inactiveTime":"40 min","cookTime":"10 min","level":"easy","directions":["In a large bowl add the eggplant and milk. Let soak about 30 minutes, then strain and set aside. Whisk the eggs together in a medium glass bowl and place cornmeal on a flat sheet tray. Toss the drained eggplant into the egg until evenly coated. Remove with a slotted spoon and allow any excess to drip back into the bowl. Drop the eggplant into the cornmeal and toss to coat well. Remove from the cornmeal, place in a shallow bowl and refrigerate until needed.","Mix the 1/3 cup olive oil, rice wine vinegar, and mustard in a small bowl and season with salt and pepper ","In a large bowl, toss all the salad ingredients together including the torn mint and drizzle with the dressing.","Heat the oil in a deep-fryer or a large saute pan, to 350 degrees F. In batches, if necessary, fry the eggplant until crispy and golden brown. Remove from fryer with a slotted spoon and drain on paper towels. Place salad in serving plates and top each serving with eggplant."],"exactIngredients":["2 large eggplants (peeled and sliced)","1 pint milk (for soaking eggplant in)","4 eggs","1 pound yellow cornmeal","1/3 cup olive oil","1/4 cup rice wine vinegar","2 teaspoons Dijon mustard","Salt and freshly ground black pepper","1 large head romaine lettuce, roughly torn","1 ripe avocado diced","1 ripe mango diced","4 tomatoes diced","1 English cucumber peeled and diced","2 red onions thinly sliced","1 red pepper cut into strips","2 tablespoons torn mint leaves","1 pint canola oil, for frying"],"baseIngredients":["eggplant","egg","cornmeal","rice","lettuce","avocado","mango","tomato","cucumber","red pepper"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Wheat Berries (Farro) and Greens: Farro e Verdure","totalTime":"1 hr 25 min","prepTime":"35 min","inactiveTime":-1,"cookTime":"50 min","level":"easy","directions":["In a stockpot large enough to hold all ingredients, heat oil over medium-high heat and add pancetta and onions. Cook until onion starts to brown, then add farro and stir to mix well. Bring 2 cups of water to a boil and stir into the farro mixture. Bring to a boil, then reduce the heat to medium-low; cover and cook very slowly, adding more boiling water from time to time as the grain begins to absorb the water.","When the kernels start to get tender, add the celery, escarole, zucchini, and chicory. Stir in the marjoram and tomato sauce, and adjust seasoning with salt and pepper. Continue cooking until farro is very tender and serve immediately with grated cheese.","","In a 3-quart saucepan, heat the olive oil over medium heat. Add the onion and garlic and cook until soft and light golden brown, about 8 to 10 minutes. Add the thyme and carrot and cook until the carrot is quite soft, about 5 minutes more. Add the tomatoes and their juice and bring to a boil, stirring often. Lower the heat and simmer until as thick as hot cereal, about 30 minutes. Season with salt, to taste.","This sauce holds 1 week in the refrigerator or up to 6 months in the freezer.","Yield: 4 cups"],"exactIngredients":["1 tablespoon extra-virgin olive oil","1 -ounce pancetta, cut into lardons","1 medium onion, finely chopped","2 cups water, plus more as needed","1 cup farro or whole wheat berries","1/2 cup diced celery","1/2 cup finely chopped escarole","1/2 cup finely chopped zucchini","1/2 cup finely chopped chicory","1 teaspoon fresh marjoram","1 tablespoon Basic Tomato Sauce, recipe follows","Salt and pepper","Freshly grated pecorino or Parmigiano-Reggiano, for garnish","Basic Tomato Sauce:","1/4 cup extra-virgin olive oil","1 Spanish onion, cut into 1/4-inch dice","4 garlic cloves, thinly sliced","3 tablespoons chopped fresh thyme leaves, or 1 tablespoon dried","1/2 medium carrot, finely shredded","2 (28-ounce) cans peeled whole tomatoes, crushed by hand and juices reserved","Kosher salt"],"baseIngredients":["berry","celery","zucchini","carrot","tomato"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Fried Softshell Crab, White Asparagus and Wild Sorrel with a Grilled Ramp Dressing","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Preheat the grill. Season the ramps with olive oil, salt and pepper. Place on the grill and cook for about 1 to 2 minutes on each side, or until wilted. Remove and cool completely. In a food processor, fitted with a metal blade, combine the egg, mustard, lemon juice, garlic, hot sauce and grilled ramps. Puree until smooth. Season with salt and pepper. With the machine running, add the oil very slowly in a steady stream. Process until the mixture is thick and creamy. Remove and chill completely. Preheat oil in the fryer to 360 degrees. Season the softshells and flour with Essence. Dredge the softshells in the flour, coating completely. Carefully holding the top of each crab, drag the legs through the oil for 5 seconds to allow the individual legs to fry separately. Then carefully flip the crabs top side down into the oil. Fry until golden brown, 2 to 3 minutes. Turn the crabs over with tongs and continue frying for another 2 to 3 minutes. Drain on paper towels. Season with Creole seasoning. In a mixing bowl, combine the sorrel and watercress. Season with salt and pepper. Season the asparagus with a drizzle of olive oil, salt and pepper. To serve, spoon some of the dressing in the center of each plate. Form 3 spears of the asparagus into a triangle over each pool of dressing. Mound the greens in the center of each triangle. Lay each softshell on top of the greens. Garnish with parsley. ","*RAW EGG WARNING ","Food Network Kitchens suggest caution in consuming raw and lightly-cooked eggs due to the slight risk of Salmonella or other food-borne illness. To reduce this risk, we recommend you use only fresh, properly-refrigerated, clean, grade A or AA eggs with intact shells, and avoid contact between the yolks or whites and the shell.","Combine all ingredients thoroughly and store in an airtight jar or container.","Yield: about 2/3 cup","Recipe from \"New New Orleans Cooking\", by Emeril Lagasse and Jessie Tirsch. Published by William and Morrow, 1993."],"exactIngredients":["1 bunch of wild ramps","Drizzle of olive oil","Salt and freshly ground black pepper","1 egg*","1 tablespoon Dijon mustard","1 lemon, juiced","1 teaspoon chopped garlic","Hot sauce, to taste","1 cup vegetable oil","4 large softshell crabs, cleaned","1 cup flour","Essence Creole seasoning, recipe follows","1/2 pound wild sorrel, cleaned","1/2 pound watercress, cleaned","12 spears of fresh white asparagus, cooked until tender and chilled","1 tablespoon finely chopped fresh parsley leaves","Essence (Emeril's Creole Seasoning):","2 1/2 tablespoons paprika","2 tablespoons salt","2 tablespoons garlic powder","1 tablespoon black pepper","1 tablespoon onion powder","1 tablespoon cayenne pepper","1 tablespoon dried leaf oregano","1 tablespoon dried thyme"],"baseIngredients":["egg","lemon","hot sauce","crab","sorrel","watercress","asparagus"]},{"title":"The Wave","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Fill a blender with 1/3 of the way full. Add the orange curacao, orange juice, and orgeat syrup. Blend until slushy and pour into a hurricane glass. Float with dark rum and garnish with the pineapple and orchid."],"exactIngredients":["Ice cubes","1 -ounce orange curacao","2 ounces orange juice","1 -ounce orgeat syrup","1 -ounce dark rum","For garnish:","1/4 slice pineapple","1 orchid"],"baseIngredients":["orange","syrup","pineapple"]},{"title":"Ringmaster Raspberries over Peaches Foster","totalTime":"15 min","prepTime":"15 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Arrange peach wedges in a radial pattern on each serving dish. Spoon caramel sauce over and sprinkle with granola. Top with a scoop of ice cream and fresh raspberries."],"exactIngredients":["3 large fresh ripe peaches, peeled and sliced into wedges","6 tablespoons caramel sauce slightly heated (by placing jar in a bowl of hot water)","6 tablespoons granola","1 pint vanilla ice cream","1 pint fresh raspberries, evenly divided into 6 portions"],"baseIngredients":["caramel","granola","ice cream","raspberry"]},{"title":"Carpaccio of Raw Zucchini","totalTime":"10 hr 15 min","prepTime":"15 min","inactiveTime":"10 hr","cookTime":-1,"level":"easy","directions":["Shingle the zucchini slices in a single overlapping layer on a platter. Dust with salt and pepper, then drizzle with a 3-count of olive oil and the lemon juice. Put that into the refrigerator for about 10 minutes to give the flavors a chance to get into the zucchini. Now scatter the leeks over. Sprinkle with the herbs. Then garnish with the ricotta cheese and mint leaves, if using."],"exactIngredients":["2 zucchini (about 1 1/2 pounds total), sliced into paper-thin rounds","Kosher salt and freshly ground black pepper","Extra-virgin olive oil","1/2 lemon, juiced","1 young leek, white and light green parts only, sliced paper-thin into rings and thoroughly cleaned","1/4 cup chopped fresh herbs, such as chervil, dill, chives, and chive blossoms","1 cup ricotta cheese","Fresh mint leaves, for garnish, optional"],"baseIngredients":["zucchini","lemon","chives","cheese"]},{"title":"Pistachio-Currant Couscous","totalTime":"15 min","prepTime":"5 min","inactiveTime":"5 min","cookTime":"5 min","level":"easy","directions":["In a small saucepan, bring broth and water to a boil over high heat. Place couscous and currants in a bowl, pour in boiling liquid and cover with plastic wrap for 5 minutes until water is absorbed. ","Stir in pistachios and oil and fluff with a fork. Taste and adjust seasoning, as desired."],"exactIngredients":["2 cups low-sodium chicken broth","1 cup water","2 cups dry couscous","1/2 cup currants","1/2 cup roughly chopped roasted, salted pistachios","2 tablespoons olive oil"],"baseIngredients":["chicken","currants"]},{"title":"Raspberry Trifle with Rum Sauce","totalTime":"56 min","prepTime":"10 min","inactiveTime":"45 min","cookTime":"1 min","level":"easy","directions":["Heat butter in a large glass bowl in microwave on high until melted, about 30 seconds. Whisk in confectioners' sugar, rum extract, and water, stirring to form a smooth sauce. Heat jam in a small glass bowl in microwave on high until just melted, about 30 seconds. In six small bowls or wineglasses, evenly distribute pound cake cubes. Pack cubes down slightly. Drizzle rum sauce and jam evenly over each. Spoon 3 tablespoons of pudding evenly over each. Refrigerate for 45 minutes. Garnish with raspberries and serve."],"exactIngredients":["3 tablespoons butter","3/4 cup confectioners' sugar","3/4 teaspoon imitation rum extract","3 tablespoons water","1/2 cup raspberry jam","1 frozen pound cake (12-ounce), thawed and cut into quarter-size cubes","3 containers (4 ounces each) refrigerated prepared vanilla pudding","Fresh raspberries, for garnish"],"baseIngredients":["jam","cake","pudding","raspberry"]},{"title":"Sunday Bread","totalTime":"1 hr 20 min","prepTime":"20 min","inactiveTime":"30 min","cookTime":"30 min","level":"easy","directions":["In a bowl, stir together the water and yeast. Let sit for 5 minutes.","In a stand mixer, with a paddle attachment, mix the flour and salt. Pour the yeast into the flour and add the honey. Mix slowly until the mixture is just incorporated and the dough is formed. ","Remove the dough from the mixer and knead by hand on a lightly-floured surface. Knead for 1 minute. ","Place the dough in a bowl and cover with plastic wrap. Let sit for 30 minutes.","Turn the dough out onto a lightly-floured surface and roll into a loaf shape. With kitchen scissors, or a sharp paring knife, cut 6 notches into the dough at a 45-degree angle. Take one piece of dough and pull it left, the next piece of dough, pull right. Repeat with all pieces until you have a shape that resembles leaves on a branch. Transfer to a baking sheet and let rest for 20 minutes. ","Preheat the oven to 350 degrees F. Using a fork, beat the egg with 1 teaspoon water and brush the egg wash onto the top of the bread. Bake the bread for 20 minutes, or until golden and baked through."],"exactIngredients":["3 cups warm water","1 (7-gram or .25-ounce) packet active dry yeast","5 cups all-purpose flour","1 1/2 tablespoons salt","2 tablespoons honey","All-purpose flour, for countertop","1 egg"],"baseIngredients":["yeast","honey","egg"]},{"title":"Pesto Caesar Salad","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":["Whisk 2 tablespoons pesto with 1/2 cup Caesar dressing. Toss with romaine and croutons; top with shaved parmesan.","Photograph by Con Poulos"],"exactIngredients":[],"baseIngredients":[]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Cheeseburgers Potato Skins","totalTime":"1 hr 35 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"1 hr 15 min","level":"","directions":["Toppings: Grilled mini burgers, lettuce, tomato, ketchup and pickles on cheesy skins","How to Make Classic Potato Skins:","Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)","See all 32 Team Potato Skins","Photograph by Karl Juengel/Studio D"],"exactIngredients":[],"baseIngredients":[]},{"title":"Capputini","totalTime":"1 min","prepTime":"1 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Fill a martini shaker with ice cubes. Add coffee drink and vodka. Shake vigorously.","Strain into a martini glass. Top glass with remaining foam from shaker."],"exactIngredients":["2 shots coffee drink (recommended: Starbucks Frappuccino)","1 shot vodka"],"baseIngredients":["coffee"]},{"title":"Juicy Lucy","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Lightly mix 6 ounces ground beef chuck with a big pinch of kosher salt. Form into two equal balls, and then shape into two flat patties. Lay two slices American cheese between them and form the meat around the cheese; make an indentation in the center of the patty. Heat a cast-iron skillet over medium-high heat; sprinkle the skillet with salt. Cook the burger 4 to 5 minutes per side. Serve on a soft bun."],"exactIngredients":[],"baseIngredients":[]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Caramel Ice Cream Oatmeal-Raisin Cookie Sandwich","totalTime":"15 min","prepTime":"15 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Place 1 scoop ice cream between the 2 cookies. Paint a serving plate with the melted white chocolate and drizzle with the raspberry sauce. Place the other scoop of ice cream on the painted plate. Place the ice cream sandwich on top of the ice cream and garnish with the raspberries."],"exactIngredients":["2 scoops caramel ice cream, divided","2 oatmeal-raisin cookies","Melted white chocolate, for garnish","Raspberry sauce, for garnish","Fresh raspberries, for garnish"],"baseIngredients":["ice cream","cookie","chocolate","raspberry"]},{"title":"Orange Creamezcal","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Drop the ice cream scoop into a chilled soda glass. Pour the mescal over the ice cream, and then the orange soda. Serve. ","Copyright (c) 2007 Television Food Network, G.P., All Rights Reserved."],"exactIngredients":["4 small scoops vanilla ice cream, about 2/3 cup","1 ounce mezcal","6 ounces orange soda, chilled"],"baseIngredients":["ice cream","orange"]},{"title":"Sugar Plum Cake Pops","imageSrc":"http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2011/11/22/0/SHSP06_sugar-plum-cake-pops_s4x3.jpg.rend.sni12col.landscape.jpeg","totalTime":"3 hr 55 min","prepTime":"45 min","inactiveTime":"3 hr","cookTime":"10 min","level":"easy","directions":["In a large pot over medium-low heat, melt the butter. Add the marshmallows, stirring to coat with the butter. Continue to stir and cook until the marshmallows have completely melted. Remove from the heat and stir in the rice cereal and lemon zest. Mix until the cereal is completely coated.","Using a scant 1/4 cup measure, roll the rice and marshmallow mixture into golf ball-size balls. Be sure to compress the cereal mixture tightly. Skewer a lollipop stick through the center of the ball. Repeat with remaining mixture and sticks.","Melt the chocolate over a double boiler. Dip each cake pop into the melted chocolate. Remove and allow any excess to drip off, spinning slightly, to coat completely. Stick the pops into a piece of floral foam or a bowl full of rice to stand upright so that the chocolate can set up slightly. Let sit 5 minutes. Dip the top half of each pop into the sprinkles. Place the sticks back in the foam or rice and place in the refrigerator to set up completely, or allow to set for several hours at room temperature."],"exactIngredients":["2 tablespoons butter","2 1/2 cups miniature marshmallows","3 cups puffed rice cereal","1 teaspoon lemon zest","8 ounces white chocolate pieces or white coating chocolate","1/4 cup colored decorating sugar or sprinkles","Special equipment: 1 dozen 5-inch lollipop sticks"],"baseIngredients":["marshmallow","cereal","lemon","chocolate","sprinkles","lollipop"]},{"title":"Siberian Huskies","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"","directions":["Tuck boiled hot dogs into potato buns; top with potato salad, beet horseradish and chopped hard-boiled eggs. Drizzle with Russian dressing.","See All 30 Hot Dog Toppings from Food Network Magazine"],"exactIngredients":[],"baseIngredients":[]},{"title":"Spanish Cheeses, Celery Sticks and Olives","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Arrange crackers, cheeses, celery sticks and a dish of olives on a cutting board or large serving platter and set out for snacking as dinner cooks."],"exactIngredients":["1 package crackers, your favorite variety","1/2 pound each: Manchego, Cabrales Blue and Mahon, or other assorted Spanish cheeses","4 ribs celery, halved lengthwise, then cut into 4-inch sticks","1 pound Spanish green olives from specialty olives cases near deli in large markets, or other mixed olives"],"baseIngredients":["cheese","celery","olive"]},{"title":"Cranberry-Ginger Popcorn Balls","totalTime":"20 min","prepTime":"20 min","inactiveTime":-1,"cookTime":-1,"level":"","directions":["Bring 1/4 cup light corn syrup, 2 tablespoons butter, 1 cup confectioners' sugar, 1/2 cup chopped crystallized ginger, 1 cup mini marshmallows and 1 tablespoon water to a boil in a large pot over medium heat, stirring. Stir in 3/4 cup each dried cranberries and white chocolate chips, and a pinch of salt. Remove from the heat; using a rubber spatula, stir in 12 cups popcorn until coated. Butter your hands, then shape into balls.","Photograph by Kang Kim"],"exactIngredients":[],"baseIngredients":[]},{"title":"Spiced Cocktail Nuts","totalTime":"6 min","prepTime":-1,"inactiveTime":-1,"cookTime":"6 min","level":"easy","directions":["Over medium heat in a medium nonstick skillet, toast seeds until they pop, 1 to 2 minutes. Add butter bits and melt them. Add pumpkin seeds and nuts to the pan and toast, tossing and turning the mixture to heat and toast. Remove to a serving dish."],"exactIngredients":["1 teaspoon caraway seed","1 teaspoon mustard seeds","1 teaspoon cumin seeds","2 tablespoons butter, cut into pieces","1/2 cup packaged, salted pumpkin seeds","1 cup walnut halves","1 cup whole almonds"],"baseIngredients":["pumpkin","walnut"]},{"title":"Clouds and Sunshine Squares","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Let ice cream and sherbet soften slightly. In a loaf pan lined with waxed paper, press a 1-inch layer of vanilla ice cream into bottom of the loaf pan. Next, press a 1-inch layer of orange sherbet on top of vanilla. Continue to layer in this fashion until the loaf pan is full, ending with vanilla ice cream. Cover with waxed paper and chill until solid. Invert pan and turn onto a plate. To serve, cut slices to desired thickness and garnish with an orange peel curl and fresh mint leaves, if desired. This will taste like a Dreamsicle."],"exactIngredients":["1 (1/2-gallon) vanilla ice cream","1 (1/2-gallon) orange sherbet","1 orange peel, cut into curls","Mint leaves, if desired"],"baseIngredients":["ice cream","orange"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Shrimp and Andouille Gratin","totalTime":"47 min","prepTime":"35 min","inactiveTime":-1,"cookTime":"12 min","level":"easy","directions":["Preheat oven to 375 degrees F. Coat inside of an oven-proof gratin dish with 1 tablespoon of oil. ","Place shrimp in gratin dish, side by side. In a bowl mix together andouille, bread crumbs, and parmesan cheese. Add remaining oil and season with Essence. Mix together until moist. Spread bread crumb mixture on top of shrimp. Place gratin in oven and bake for 12 minutes until shrimp are cooked. Transfer to a serving plate and serve with cumin sour cream.","Combine all ingredients thoroughly. ","Yield: 2/3 cup"],"exactIngredients":["12 large shrimp, peeled and deveined","1/2 cup andouille (cooked, rendered of all fat)","1 cup bread crumbs","2 tablespoons Parmesan cheese","2 tablespoons olive oil","Essence, recipe follows","Chopped parsley for garnish","Cumin sour cream: 1 cup sour cream mixed with 1 tablespoon ground cumin, for garnish","Emeril's ESSENCE Creole Seasoning (also referred to as Bayou Blast):","2 1/2 tablespoons paprika","2 tablespoons salt","2 tablespoons garlic powder","1 tablespoon black pepper","1 tablespoon onion powder","1 tablespoon cayenne pepper","1 tablespoon dried oregano","1 tablespoon dried thyme"],"baseIngredients":["shrimp","bread","cheese","sour cream"]},{"title":"Flowers for Mom Cocktail","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Add the elderflower liqueur to a champagne flute and top with rose. Stir to mix and add a raspberry for garnish."],"exactIngredients":["1 ounce elderflower liqueur (recommended: St Germaine)","Dry sparkling rose wine, well chilled","Raspberries, for garnish"],"baseIngredients":["raspberry"]},{"title":"The Diva","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["In a cocktail shaker filled with ice, combine the mango juice, vodka, fresh ginger, and fresh mint. Pour the drink and the ice into a tall glass and serve."],"exactIngredients":["Ice, as needed","1 cup mango juice","1 shot (1.5 ounces) vodka","1/8 teaspoon grated fresh ginger","1/8 teaspoon chopped fresh mint"],"baseIngredients":["mango"]},{"title":"Chocolate Dipped Hazelnut Shortbread","totalTime":"18 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"8 min","level":"easy","directions":["Preheat oven to 350 degrees F. ","Place hazelnuts on baking sheet. Bake until they're a shade darker and fragrant, about 10 to 15 minutes. Remove from oven and set aside to cool.","Lower oven to 325 degrees F. ","Place hazelnuts in blender or food processor and pulse to coarse bits; set aside. Whisk together flour, baking powder, and salt to blend; set aside. ","Beat butter and sugar together with a wooden spoon until smooth. Beat in egg. Gradually beat the flour mixture into the butter mixture. Add the chopped hazelnuts and mix until distributed evenly throughout.","Form into long cookies and place on greased cookie sheets. Bake until firm, about 15 minutes. Remove from oven and cool on racks.","In a saucepan over lowest heat or in a double boiler, melt chocolate. Dip 1 end of cooled cookies into melted chocolate. Place back on cookie sheet to harden."],"exactIngredients":["1 cup husked hazelnuts","1 cup all-purpose flour","1/2 teaspoon baking powder","1/2 teaspoon salt","8 tablespoons (1 stick) butter, room temperature","1/3 cup sugar","1 egg","1 teaspoon vanilla extract","4 ounces good-quality semisweet chocolate"],"baseIngredients":["hazelnut","egg","vanilla","chocolate"]},{"title":"Charlotte's Festive Party Punch","totalTime":"2 hr 20 min","prepTime":"15 min","inactiveTime":"2 hr","cookTime":"5 min","level":"easy","directions":["Place the sugar in a large bowl and add the hot tea. Stir until the sugar has dissolved. Add the lemon juice, peach brandy, rum, and whiskey and mix well. Refrigerate until thoroughly chilled.","Just before serving, place the mixture in a punch bowl and add the club soda to taste. Serve in punch cups."],"exactIngredients":["1 cup sugar","1/2 quart strong brewed green tea (hot)","6 lemons, juiced and strained","1 cup peach brandy","2 cups rum","1 quart bourbon or rye whiskey","1 quart chilled club soda","Orange slices, for garnish","Lime slices, for garnish"],"baseIngredients":["green tea","lemon","peach","rye","orange","lime"]},{"title":"Escarole and Bacon Salad","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"","directions":["Cook 4 chopped bacon slices in a skillet until crisp; remove with a slotted spoon and drain. Off the heat, whisk 3 tablespoons each currants and red wine vinegar, 2 tablespoons olive oil, and salt and pepper into the drippings. Toss with 1 head chopped escarole, chopped pistachios and the bacon.","Photograph by Antonis Achilleos"],"exactIngredients":[],"baseIngredients":[]},{"title":"Lemon Pepper Sorbet","totalTime":"3 hr 45 min","prepTime":"40 min","inactiveTime":"3 hr","cookTime":"5 min","level":"easy","directions":["Bring the water and sugar to a boil in a small saucepan, remove from the heat, and cool completely. Combine the syrup with the lemon juice, zest, pulp and pepper. Pour into the bowl of an ice cream machine. Freeze according to the manufacturer's instructions. After the sorbet is made, transfer to an airtight container. Cover tightly and freeze for at least 2 hours, or until ready to serve."],"exactIngredients":["1 cup water","2 tablespoons sugar","1 cup fresh lemon juice","1 tablespoon lemon zest","2 tablespoons lemon pulp","1 tablespoon cracked black pepper"],"baseIngredients":["lemon"]},{"title":"Cubana Rum","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Combine all ingredients in a cocktail shaker. Cover and shake for 15 seconds. Strain into a glass and serve immediately."],"exactIngredients":["1/3 cup apricot nectar","1/4 cup lime juice","1/4 cup apricot brandy","1/4 cup light rum","4 ice cubes"],"baseIngredients":["apricot","lime"]},{"title":"Smoked Salmon-Scrambled Egg Packages with Lemon Creme Fraiche","totalTime":"25 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"5 min","level":"easy","directions":["Lay 1 slice of salmon in the center of 4 plates. Lay a second slice of salmon across the first to form an \"x.\"","In a small bowl, whisk together the creme fraiche, lemon juice, and a pinch of salt. Set aside.","In a medium bowl, beat together the eggs. Add the cream, salt, and pepper, and whisk until very frothy. Add the 2 tablespoons of the chopped chives and the parsley, and whisk to blend.","In a large, heavy skillet, melt the butter over medium heat. Add the eggs, and cook, stirring constantly, until fluffy and barely set, removing the pan from the heat occasionally to prevent from overcooking. Remove the pan from the heat when almost completely set and stir gently.","Spoon the eggs into the center of the smoked salmon packages. Bring up the sides of the salmon to completely enclose the eggs. Drizzle each package with 2 tablespoons of the lemon creme fraiche and sprinkle with the remaining chopped chives. Top with caviar, garnish with dill sprigs and red onion, and arrange 3 toast triangles on each plate. Serve immediately."],"exactIngredients":["8 slices good quality smoked salmon (each slice about 3 1/2 by 7 inches)","1/2 cup creme fraiche or sour cream","2 teaspoons fresh lemon juice","9 large eggs","1/4 cup heavy cream","1/2 teaspoon salt","1/4 teaspoon ground white pepper","3 tablespoons chopped fresh chives","1 teaspoon minced fresh parsley leaves","4 tablespoons unsalted butter","2 ounces caviar","Dill sprigs, for garnish","1/4 red onion, chopped, for garnish","6 slices brioche or homemade-style white bread, lightly toasted, buttered, and cut into triangles with crusts removed"],"baseIngredients":["salmon","sour cream","lemon","egg","cream","chives","caviar","dill","bread"]},{"title":"Cranberry-Glazed Carrots","totalTime":"35 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"25 min","level":"easy","directions":["Cook 1 1/2 pounds thinly sliced carrots in a skillet with 2 tablespoons olive oil until beginning to soften, 5 to 7 minutes. Add 1 1/2 cups no-sugar-added cranberry juice, 3/4 teaspoon cumin and a pinch each of cinnamon and salt. Simmer, stirring, until tender and glazed, 25 minutes. Sprinkle with chopped parsley."],"exactIngredients":[],"baseIngredients":[]},{"title":"Smoked Salmon and Crisp Potato-Wich, American Caviar","totalTime":"30 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["Dry the potato slices a bit by pressing between a kitchen towel. ","Heat an 8-inch saute pan with 1/4 cup of the clarified butter until just before smoking. Start adding the potatoes in a circular, overlapping patter, making 2 layers. When the bottom layer has browned nicely, carefully flip and cook the topside, adding more clarified butter, as needed. Remove when lightly golden to a tray lined with a few layers of paper towel and season. Repeat.","Layer the salmon in-between the 2 potato crips with creme fraiche, caviar, red pearl onion shavings and dill sprigs."],"exactIngredients":["32 potato slices (about 1/8-inch thick), punched out 2 1/2-inch diameter","1 cup clarified butter, divided","4 ounces smoked salmon, sliced thin on a long bias","1 cup whipped creme fraiche","4 ounces American sturgeon caviar","1 red pearl onion, peeled and shaved thin","4 fresh dill sprigs"],"baseIngredients":["potato","salmon","caviar","dill"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Sauteed Black and Green Olives: Olive Neri e Verdi","totalTime":"1 hr","prepTime":"5 min","inactiveTime":-1,"cookTime":"55 min","level":"easy","directions":["In a 12 to 14-inch saute pan, heat the olive oil over medium-high heat and add the garlic. Cook over high heat until golden, about 2 minutes, then add the olives, and cook for 3 minutes, until softened. ","Add the tomato sauce, then lower the heat, and simmer for 15 to 20 minutes, occasionally basting with the tomato sauce.","In a 3-quart saucepan, heat the olive oil over medium heat. Add the onion and garlic, and cook until soft and light golden brown, about 8 to 10 minutes. Add the thyme and carrot, and cook 5 minutes more, until the carrot is quite soft. Add the tomatoes and juice and bring to a boil, stirring often. Lower the heat and simmer for 30 minutes until as thick as hot cereal. Season with salt and serve. This sauce holds 1 week in the refrigerator or up to 6 months in the freezer. ","Yield: 4 cups"],"exactIngredients":["1/4 cup extra-virgin olive oil","2 cloves garlic, chopped","1/2 pound small black brine-cured olives, like gaeta, drained and rinsed","1/2 pound small green brine-cured olives, like arbequina, drained and rinsed","1 cup Basic Tomato Sauce, recipe follows","Basic Tomato Sauce:","1/4 cup extra-virgin olive oil","1 Spanish onion, chopped in 1/4-inch dice","4 garlic cloves, peeled and thinly sliced","3 tablespoons chopped fresh thyme leaves, or 1 tablespoon dried","1/2 medium carrot, finely shredded","2 (28-ounce) cans peeled whole tomatoes, crushed by hand and juices reserved","Salt"],"baseIngredients":["olive","carrot","tomato"]},{"title":"Cafe Roma Martini","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Add all ingredients (except garnish) to a cocktail shaker filled with ice. Shake well and strain into martini glass. Garnish with 3 coffee beans. Enjoy!"],"exactIngredients":["1 shot anise-flavored liqueur (recommended: Sambuca)","1 shot coffee liqueur","1 shot half-and-half","Ice","Coffee beans, for garnish"],"baseIngredients":["coffee","beans"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Glazed Turnips and Edamame","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Simmer 1 bunch peeled and quartered baby turnips with 2 tablespoons butter, a pinch each of sugar and salt, and 1/3 cup water, covered, 5 minutes. Add 1 pound shelled edamame, 1 tablespoon butter and the white parts of 3 sliced scallions; cover and cook 2 minutes, then uncover and cook until the water evaporates. Add the scallion greens and let wilt. ","Photograph by Antonis Achilleos"],"exactIngredients":[],"baseIngredients":[]},{"title":"Mudslide Pie","totalTime":"35 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["Using a large mixing bowl, place cookie crumbs and melted butter. Mix until the ingredients are well blended and moist. Keep mixture at room temperature until needed for pie shells. ","Lightly spray 2 pie tins with vegetable oil. Place the prepared crust into the pie tins and press firmly on the bottom and sides of each tin, forming a smooth and even thickness approximately 1/8-inch thick. Use a ladle to even out the crusts. Place the pie crusts in freezer before ice cream can be placed into crusts.","Equally portion the ice cream into the pie shells. Mound the ice cream to create a 3-inch high dome. Use a glove and napkin to help with this process. Place pies on a sheet pan and place in the freezer for approximately 6 hours or more. ","To serve, drizzle with chocolate sauce and sprinkle with more cookie crumbs and chopped nuts, if desired."],"exactIngredients":["For the crust:","7 ounces chocolate cookie crumbs, plus more for garnish","2 tablespoons butter, melted","For the filling:","3 (1-quart) containers coffee ice cream","Chocolate sauce","Chopped nuts, optional","For the crust:"],"baseIngredients":["chocolate","ice cream"]},{"title":"Grilled Orange Slices with Frozen Yogurt and Raspberry-Fudge Sauce","totalTime":"10 min","prepTime":"5 min","inactiveTime":-1,"cookTime":"5 min","level":"easy","directions":["Coat an outdoor grill or stovetop grill pan with cooking spray and preheat to medium-high. ","Arrange orange slices on hot grill and grill 2 minutes per side, until golden brown. ","In a medium bowl, combine fudge sauce and raspberry preserves. Cover and microwave on HIGH for 30 seconds, until warm. ","Spoon frozen yogurt over orange slices and drizzle raspberry-fudge sauce over top."],"exactIngredients":["Cooking spray","2 oranges, sliced into rounds","2 cups vanilla frozen yogurt","1/2 cup fudge sauce","1/4 cup raspberry preserves"],"baseIngredients":["orange","vanilla","raspberry"]},{"title":"Champagne Artichoke Hearts","totalTime":"12 min","prepTime":"5 min","inactiveTime":-1,"cookTime":"7 min","level":"easy","directions":["In a large pot over medium heat combine butter, garlic and onions and sweat for 5 minutes until onions are soft and translucent. Stir in artichoke hearts, vegetable broth and Champagne. Season with salt and pepper. Bring to simmer over medium heat and let simmer for 6 to 7 minutes.","To serve, laddle the hearts into a bowl."],"exactIngredients":["2 tablespoons unsalted butter","1 tablespoon crushed garlic","1/4 cup frozen chopped onions, thawed","2 boxes (8-ounces) frozen artichoke hearts, thawed","1 cup vegetable broth","1 cup Champagne or sparkling wine","1 teaspoon salt","1/2 teaspoon ground black pepper"],"baseIngredients":["artichoke","vegetable"]},{"title":"Parmesan Popcorn Mix","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["In a large bowl, combine the popcorn, crackers, pretzels, butter and cheese, stirring until well coated."],"exactIngredients":["10 cups popped popcorn","2 cups baked cheese snack crackers","2 cups tiny twist pretzels","1/4 cup butter, melted","2 tablespoons grated Parmesan"],"baseIngredients":["popcorn","cheese","pretzel"]},{"title":"One Minute Mary","totalTime":"1 min","prepTime":"1 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Combine all ingredients in a pitcher and stir until thoroughly mixed. Reserve in refrigerator until ready to serve. To serve pour over ice and garnish with celery rib."],"exactIngredients":["1 quart tomato juice","1 heaping tablespoon prepared horseradish","8 dashes Worcestershire sauce","Hot sauce","1 lime, juiced","2 tablespoons chopped fresh dill","4 celery heart ribs"],"baseIngredients":["tomato","horseradish","hot sauce","lime","dill","celery"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"The Tortured Toddy","totalTime":"35 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"20 min","level":"easy","directions":["In a 2-quart saucepan, combine the water, orange zest, lemon zest, orange juice, lemon juice, cinnamon stick and cloves. Bring to a boil and reduce to a simmer. Simmer until the flavors are well combined, about 15 minutes. Strain the infusion and set aside. Discard solids. Place 2 tablespoons of honey in each of 4 (12-ounce) glass cups. Pour 2 ounces of the brandy over the honey and pour 3/4 cup of the infusion over honey and brandy. Stir to help dissolve the honey and serve garnished with a cinnamon stick."],"exactIngredients":["4 cups water","3 strips orange zest","3 strips lemon zest","1 orange, juiced","1 lemon, juiced","1 cinnamon stick","4 whole cloves","1/2 cup honey","1 cup brandy, rum or whiskey"],"baseIngredients":["orange","lemon","honey"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Butter Toffee Flower Sandwiches","totalTime":"1 hr 30 min","prepTime":"35 min","inactiveTime":"45 min","cookTime":"10 min","level":"easy","directions":["Spoon cookie mix into a wire-mesh strainer set over a large bowl. Sift the cookie mix through strainer, leaving the chocolate chips in strainer (reserve the chocolate chips for another use). Add flour, eggs, oil, and butter flavoring to cookie mix in bowl. Stir until dough comes together. Shape into a ball, then wrap in plastic wrap. Chill dough in refrigerator for at least 30 minutes.","Preheat the oven to 375 degrees F. Line cookie sheet(s) with parchment paper and set aside.","On a lightly floured surface, roll out chilled dough to 1/4-inch thickness. Using a 3-inch flower-shaped cookie cutter, cut 12 shapes from the dough. Using a 1-inch round cookie cutter, cut out each flower center. Re-roll the scrap dough and cut out another 12 flower shapes, but do not cut out centers. Transfer the flowers to the prepared cookie sheet(s), spacing cookies 2 inches apart.","Bake cookies 8 to 10 minutes or just until starting to brown. Cool on cookie sheet(s) for 5 minutes. Transfer cookies to a wire rack to cool completely.","For filling:","In a medium bowl, stir together frosting and powdered sugar until well mixed. Gently stir in 1/2 cup toffee bits.","Spoon a heaping tablespoon filling onto each of the whole flower cookies. Top each with a cut-out flower cookie. Sprinkle a scant teaspoon of the remaining toffee bits in the center of each cut-out cookie."],"exactIngredients":["Cookies:","1 (17.5-ounce) pouch chocolate chip cookie mix (recommended: Betty Crocker)","3/4 cup all-purpose flour","2 eggs","1/4 cup vegetable oil","1 teaspoon imitation butter flavoring","Filling:","1 cup whipped buttercream frosting","1/4 cup powdered sugar, sifted","3/4 cup toffee bits (recommended: Heath)"],"baseIngredients":["cookie","chocolate","egg","frosting","toffee"]},{"title":"Chocolate-Amaretti Parfaits","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":["Melt 1 1/2 ounces finely chopped bittersweet chocolate in the microwave; let cool. Mix with 1 1/2 cups mascarpone cheese and 1/3 cup sugar. Layer in glasses with raspberries and crumbled amaretti cookies.","Photograph by Antonis Achilleos"],"exactIngredients":[],"baseIngredients":[]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Margrini","totalTime":"3 min","prepTime":"3 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Combine all ingredients in a cocktail shaker. Shake for a few seconds and strain into a martini glass."],"exactIngredients":["1 shot Midori","Ice","2 to 3 shots vodka","Splash orange juice"],"baseIngredients":["orange"]},{"title":"Rum-Raisin Popcorn Balls","totalTime":"20 min","prepTime":"20 min","inactiveTime":-1,"cookTime":-1,"level":"","directions":["Bring 1/4 cup light corn syrup, 2 tablespoons butter, 1 cup confectioners' sugar, 1/2 cup spiced rum and 1 cup mini marshmallows to a boil in a large pot over medium heat, stirring. Cook until syrupy, 5 to 10 minutes. Add 1 cup golden raisins and a pinch of salt. Remove from the heat; using a rubber spatula, stir in 12 cups popcorn until coated. Butter your hands, then shape into balls and roll in confectioners' sugar.","Photograph by Kang Kim"],"exactIngredients":[],"baseIngredients":[]},{"title":"Huckleberry Trail Mix","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Combine the ingredients in a large bowl. Store in an airtight container.","Photograph by Levi Brown"],"exactIngredients":["1 pound (4 cups) dry-roasted almonds","1 pound (4 cups) cashews","2 cups dried huckleberries or cranberries","1 1/3 cups M&M's Minis or semisweet chocolate chips","1 1/3 cups shredded coconut"],"baseIngredients":["cranberry","chips","coconut"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Fried Chicken with Dipping Sauces: Cotolitta di Pollo con Salse","totalTime":"30 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"10 min","level":"easy","directions":["In a large, deep, heavy-bottomed saute pan, heat the canola oil to 350 degrees F.","In a bowl, toss the chicken with flour. In a separate shallow bowl, beat the eggs with the milk, Parmigiano cheese, Pecorino cheese, basil, mint, chives, tarragon, marjoram, salt, and pepper. Pour the bread crumbs onto a deep dish. Shake the excess flour from the chicken and dredge the chicken in the beaten eggs then in the bread crumbs. Dip the chicken in the eggs a second time and then again in the bread crumbs. ","Fry the chicken in the heated oil until golden brown, about 5 minutes on each side. Drain on paper towels and season lightly with salt. Serve with the dipping sauces and Simple Iceberg Salad.","Mix the cr�me fraiche, gorgonzola, cayenne pepper, paprika, and fresh chives in a bowl until they are smooth. There will still be some small chunks of gorgonzola.","In a mixing bowl, whisk the egg yolks with half of the oil and half of the lemon juice. Add the mustard and garlic. While whisking, add the remaining oil and lemon juice. When the texture is smooth and creamy, stir in the chives and sundried tomatoes. Season the aioli with salt, and pepper, to taste. Keep the aioli refrigerated until ready to serve.","In a small bowl, whisk together the oil, vinegar, salt, and pepper, to taste. Toss the shredded lettuce with the dressing just before serving."],"exactIngredients":["1 (16-ounce) bottle canola oil, for frying","4 boneless, skinless chicken breasts, cut into strips","1 cup all-purpose flour","4 eggs","1/2 cup milk","1/2 cup Parmigiano cheese, grated","1/2 cup pecorino cheese, grated","1 tablespoon chopped fresh basil","1 tablespoon chopped fresh mint","1 tablespoon chopped fresh chives","1 tablespoon chopped fresh tarragon","1 tablespoon chopped fresh marjoram","Kosher salt and freshly ground black pepper, to taste","2 cups bread crumbs with Italian seasoning","Dipping sauces, recipes follow","Simple Iceberg Salad, recipe follows","Spicy Gorgonzola Sauce:","8 ounces creme fraiche","1 small wedge gorgonzola cheese, crumbled","1/2 teaspoon ground cayenne pepper","1/2 teaspoon paprika","1/2 teaspoon chopped fresh chives","Sundried Tomato & Roasted Garlic Aioli:","2 egg yolks","1 1/2 cups extra virgin olive oil, divided","1 tablespoon fresh lemon juice, divided","1 tablespoon honey mustard","1 tablespoon jarred roasted garlic","1 tablespoon fresh chives, chopped","1/4 cup sundried tomatoes, thinly chopped","Kosher salt and freshly ground black pepper, to taste","Simple Iceberg Lettuce Salad:","2 tablespoons extra-virgin olive oil","1 tablespoon balsamic vinegar","Kosher salt and freshly ground black pepper, to taste","1 head iceberg lettuce, shredded and chilled"],"baseIngredients":["chicken","egg","milk","cheese","chives","tarragon","bread","salad","lemon","honey","tomato","iceberg lettuce"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Pisco Sweet","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Combine the sugar, strawberries, milk, and pisco in a blender and pulse until smooth. Add the ice and blend until liquefied. Serve in tall glasses and garnish each with a strawberry."],"exactIngredients":["6 tablespoons superfine sugar","4 cups fresh strawberries, hulled and quartered","1 cup evaporated milk","2 cups pisco","4 cups ice","6 strawberries, for garnish"],"baseIngredients":["strawberry","milk"]},{"title":"Championship Cup (of Fruit)","totalTime":"20 min","prepTime":"20 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Fold salad ingredients together in a mixing bowl. Spoon into serving dishes and garnish with mint."],"exactIngredients":["1/2 fresh pineapple, peeled, cored, and medium diced","1/2 pound white seedless grapes","1 pint strawberries, cleaned and halved","1 pint blueberries, washed","1/2 honeydew melon, seeds removed, peeled and medium diced","1/2 cantaloupe, seeds removed, peeled and medium diced","6 springs fresh mint, for garnish"],"baseIngredients":["pineapple","grape","strawberry","blueberry","honeydew","cantaloupe"]},{"title":"Broiled Fluke Fillets with Asian Vinaigrette and Sesame Asparagus","totalTime":"57 min","prepTime":"20 min","inactiveTime":"30 min","cookTime":"7 min","level":"easy","directions":["Preheat the broiler and cover the broiler pan with aluminum foil.","In a bowl, combine the vegetable oil, rice vinegar, mirin, 1 teaspoon of the sesame oil, the salt and red pepper flakes. Whisk to combine.","In a non-reactive shallow baking dish, arrange the fillets skin side down. Pour the vinaigrette over the fish, cover and refrigerate for 30 minutes.","Bring a large saucepan of salted water to a boil. Add the asparagus and cook until just tender, 1 1/2 to 3 minutes, depending upon their thickness. Drain and shock in an ice water bath. Drain and pat dry. In the saucepan, heat the remaining 1 1/2 teaspoons oil over medium-high heat. Add the asparagus and soy sauce and cook until warmed through, about 1 minute. Adjust the seasoning, to taste. Remove from the heat, toss with the sesame seeds, and keep warm. ","Remove the fish from the marinade and place on the prepared broiler pan. Broil 5 to 6 inches from the heat source until just cooked through, about 5 minutes. ","Serve with the asparagus, and garnish with cilantro."],"exactIngredients":["3/4 cup vegetable oil","1/4 cup rice wine vinegar","1 tablespoon plus 1 teaspoon mirin","2 1/2 teaspoons sesame oil","1/2 teaspoon salt","1/2 teaspoon red pepper flakes","4 (6-ounce) flounder fillets, with skin","1 pound asparagus, tough ends trimmed","1 teaspoon soy sauce","1 1/2 teaspoons sesame seeds, lightly toasted","Sprigs fresh cilantro, for garnish"],"baseIngredients":["rice","red pepper","fillet","asparagus","cilantro"]},{"title":"Just Peachy Floats","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["To a tall glass, add 1 scoop of vanilla ice cream. Pour the schnapps or syrup over the ice cream. Fill the glass the rest of the way with club soda. Serve with a straw and spoon."],"exactIngredients":["ADULT VERSION:","1 scoop vanilla ice cream","2 shots peach schnapps","Club soda or sparkling water","KID VERSION:","1 scoop vanilla ice cream","2 shots peach syrup (recommended: Torani)","Club soda or sparkling water"],"baseIngredients":["ice cream","peach"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Honey Peanuts","totalTime":"20 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"10 min","level":"","directions":["Heat 2 tablespoons peanut oil in a skillet over medium heat. Add 2 tablespoons honey, 3/4 cup peanuts, 4 sliced scallions and 1/2 teaspoon each red pepper flakes and five-spice powder. Cook, stirring, until glazed, about 10 minutes. Stir in 1 teaspoon balsamic vinegar and cook 1 minute. Transfer to a foil-lined baking sheet; season with salt and let cool.","Photographs by Con Poulos"],"exactIngredients":[],"baseIngredients":[]},{"title":"Crispy-Crunchy Bars","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"","directions":["Melt 3 tablespoons butter, 10 ounces marshmallows and 1/2 cup peanut butter (or other nut butter) in a large saucepan over low heat. Stir in 4 cups crisp brown cereal, 1 cup granola and 1 cup chopped almonds. Stir in 1/2 cup chocolate chips. Press into a buttered 9-inch square pan; let cool, then cut into bars.","Copyright (c)2011 Food Network Magazine, LLC. Published by Hyperion. Available wherever books are sold. All Rights Reserved. Photograph courtesy of Antonis Achilleos."],"exactIngredients":[],"baseIngredients":[]},{"title":"Garlic Yogurt","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":["Smash 1 garlic clove and sprinkle with kosher salt, then mash and smear into a paste with the flat side of a knife. Mix with 1 1/4 cups low-fat plain Greek yogurt and thin with water. Drizzle with olive oil and sprinkle with salt, pepper, smoked paprika and cumin. Serve with the couscous or add a dollop to the pot-au-feu.","Photograph by Marcus Nilsson"],"exactIngredients":[],"baseIngredients":[]},{"title":"Regal Rose","totalTime":"2 min","prepTime":"2 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Combined all ingredients in a pitcher full of ice. Stir and strain into martini glasses."],"exactIngredients":["2 parts gin","1 part apricot brandy","1/2 part sweet vermouth","1/2 part lemon juice","1 part cranberry juice"],"baseIngredients":["apricot","lemon","cranberry"]},{"title":"Terry's Bloody Marys","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Mix all ingredients (except crudites) in a large pitcher. Spear smaller crudites onto cocktail picks. Serve drinks over ice with crudites."],"exactIngredients":["1 (32-ounce) bottle clam-tomato cocktail (recommended: Clamato)","10 ounces vodka","1 tablespoon prepared horseradish","1 teaspoon Worcestershire sauce","1/4 teaspoon celery salt","1/4 teaspoon granulated garlic","8 dashes hot sauce (recommended: Tabasco)","Crudites for serving, like celery stalks, peeled whole carrots, pickled asparagus, pitted olives, pickled pearl onions, marinated mushrooms, cornichon pickles, pimentos, and large caperberries","Special equipment: Cocktail picks"],"baseIngredients":["horseradish","celery","hot sauce","asparagus"]},{"title":"Mini-Handle Sandwich","totalTime":"23 min","prepTime":"8 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["Prepare leeks by blanching in a pot of boiling water for 1 minute. Remove to an ice bath to chill. Set aside. When chilled, drain leeks. ","Place oil in a deep-fryer or fill a large, heavy-bottomed pan no more than halfway full with oil. Preheat the oil to 350 degrees F. ","In a shallow bowl, stir together hot sauce and egg. Season chicken with House Seasoning and then dredge in egg mixture. Coat chicken in self-rising flour.","When oil is at 350 degrees F, carefully place chicken into hot oil and deep-fry for 7 to 8 ","minutes. Remove chicken with tongs and drain on paper towels. Spread each slice of ","bread with mayonnaise and place chicken drumette in center. Fold bread around chicken ","and tie with a leek strip. Have extra hot sauce for dipping.","Combine all ingredients in a small bowl. Place in a shaker for future use"],"exactIngredients":["3 fresh leeks, sliced lengthwise, cleaned very well","Peanut oil, for frying","1 cup hot sauce plus more for dipping (recommended: Texas Pete)","1 egg, well beaten","6 chicken drumlettes","House Seasoning, recipe follows","Self-rising flour","6 slices white bread, crust trimmed","Mayonnaise","House Seasoning:","1 cup salt","1/4 cup garlic powder","1/4 cup black pepper"],"baseIngredients":["hot sauce","egg","chicken","bread"]},{"title":"Lobster-Pinto Bean Salad","totalTime":"1 hr 10 min","prepTime":"30 min","inactiveTime":"30 min","cookTime":"10 min","level":"easy","directions":["Combine the molasses, water, vinegar, mustard, honey, and salt and pepper, to taste, in a medium bowl. Slowly whisk in the oil until emulsified.","Salad:","Heat the oil in a large saute pan over medium-high heat until it begins to shimmer. Add the onion and carrot and cook until soft, about 4 minutes. Add the garlic and jalapeno and cook for 30 seconds.","Add the beans and lobster and cook until slightly heated through, about 2 minutes. Transfer to a serving bowl, add the dressing and parsley and toss to coat. Let sit at room temperature for 30 minutes before serving to allow flavors to meld."],"exactIngredients":["Molasses-Mustard Dressing:","1/4 cup molasses","3 tablespoons water","2 tablespoons red wine vinegar","2 tablespoons Dijon mustard","2 teaspoons clover honey","1 teaspoon kosher salt","1/2 teaspoon freshly ground black pepper","1/2 cup canola oil","Bean Salad:","2 tablespoons canola oil","1 small Spanish onion, finely diced","1 carrot, finely diced","2 cloves garlic, finely chopped","1 jalapeno, finely diced","3/4 pound pinto beans, soaked overnight, cooked until tender and drained well","1 1/2 cups grilled chopped lobster meat","Mustard-Molasses Dressing","1/4 cup chopped fresh flat-leaf parsley"],"baseIngredients":["molasses","honey","salad","carrot","jalapeno","beans","lobster"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"The Deen Brothers' Fig-and-Orange-Glazed Ham","totalTime":"1 hr 10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"1 hr","level":"easy","directions":["Preheat the oven as directed on the ham package and follow the instructions for baking the ham. Remove the ham from the oven about 30 minutes before the end of the warming time.","Meanwhile, combine the jam, mustard, and orange zest and juice in a small saucepan over low heat. Cook, stirring, just until the jam melts (do not boil). Spoon half of the glaze over the ham and bake for the remaining 30 minutes. ","Remove the ham from the oven and spoon the remaining glaze on top. Transfer to a cutting board and carve.","","Photograph by Yunhee Kim"],"exactIngredients":["1 spiral-sliced half ham","1 cup fig jam","2 tablespoons dijon mustard","Grated zest of 1 orange","1/3 cup fresh orange juice"],"baseIngredients":["ham","fig","orange"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Herb Coffee Verbena","totalTime":"35 min","prepTime":"5 min","inactiveTime":"30 min","cookTime":-1,"level":"easy","directions":["Pour coffee over verbena or thyme sprigs and steep for 5 minutes. Strain, discard the herbs and let coffee cool to room temperature. Pour over ice and serve."],"exactIngredients":["4 cups freshly brewed coffee, sweetened to taste","Fresh verbena or thyme sprigs"],"baseIngredients":["coffee"]},{"title":"Crawfish and Goat's Cheese Stuffed Leg of Lamb with Rosemary Jus","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Preheat the oven to 425 degrees F. In a saute pan, heat 1 tablespoon of the olive oil. When the pan is hot, add the leeks. Season with salt and pepper. Saute for 1 minute. Add the garlic and sorrel. Season with salt and pepper. Saute for 2 minutes or until the sorrel has wilted. Add the crawfish. Season with salt and pepper. Saute for 1 minute. Remove from the heat and turn into a mixing bowl, cool. Stir in the cheese. Season with salt and pepper. Lay the lamb on a work surface, butterflied side up. Rub the entire lamb with the remaining olive oil. Season with salt and pepper. Spread the crawfish filling evenly over the center of the meat. Roll the lamb lengthwise, tucking the ends in and tie with butchers twine. Crust the outside of the lamb with the cracked black pepper. Place the roast in a shallow roasting pan and roast for 30 minutes. Reduce the heat to 350 degrees F. and continue to cook for 50 minutes. Remove from oven and let rest for 10 minutes before carving. In a saucepan, combine the demi-glace and rosemary. Bring the liquid to a simmer and cook for 8 minutes. Serve with the lamb."],"exactIngredients":["4 tablespoons olive oil","1/2 cup chopped leeks, white part only","Salt","Freshly ground white pepper","1 tablespoon chopped garlic","4 cups fresh sorrel, cleaned, stemmed, and chopped","1 pound Louisiana crawfish tails","8 ounces Goat's cheese","1 (5 pound) leg of lamb, trimmed and butterflied","Butchers twine","1/2 cup cracked black pepper","4 cups beef or veal demi-glace","1/2 cup finely chopped fresh rosemary"],"baseIngredients":["sorrel","cheese","lamb","beef"]},{"title":"Chili-tini","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Brush 5 martini glasses with half lime juice and freeze.","Shake the gin and vermouth with ice in a shaker. Get glasses out of freezer or empty ice out of glasses. Pour a few drops of hot sauce into the bottom of each martini glass. Pour gin mixture into the glasses.","Stir very lightly and serve."],"exactIngredients":["1 lime, juiced","5 ounces gin","1 ounce dry vermouth","15 drops favorite chili or hot sauce"],"baseIngredients":["lime","hot sauce"]},{"title":"Chocolate-Nut Buttons","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"","directions":["Microwave 3 ounces chopped bittersweet chocolate on 75% power until melted, about 2 minutes. Beat 1/4 cup peanut butter, 2 tablespoons softened butter and 1/2 cup confectioners' sugar until smooth. Roll into balls. Dip in the melted chocolate, place on a parchment-lined baking sheet and freeze for 3 minutes.","Copyright (c)2011 Food Network Magazine, LLC. Published by Hyperion. Available wherever books are sold. All Rights Reserved. Photograph courtesy of Antonis Achilleos."],"exactIngredients":[],"baseIngredients":[]},{"title":"Peppermint Hot Chocolate","totalTime":"3 min","prepTime":"3 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Combine milk, cocoa mix, crushed peppermint stick and schnapps, if desired, in a large mug and stir well. Garnish with a peppermint stick."],"exactIngredients":["2 cups warmed milk","1 serving cocoa mix","1 tablespoon crushed peppermint stick","2 ounces peppermint schnapps, optional","1 peppermint stick"],"baseIngredients":["milk"]},{"title":"Green Beans With Shallots","totalTime":"20 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"10 min","level":"easy","directions":["Boil 1 1/2 pounds green beans, 6 to 8 minutes. Drain and cool in ice water, then drain and dry. Toast 1 teaspoon ground cinnamon in a skillet with 2 teaspoons olive oil, 1 minute. Mix with 1/2 cup Greek yogurt and 1 teaspoon salt, then toss with the beans. Toss 2 sliced shallots in flour and fry in the skillet with more oil, 3 minutes; sprinkle on top of the beans."],"exactIngredients":[],"baseIngredients":[]},{"title":"Wheat Germ and Ginger, Wasabi Cream, and Tuna Creme Fraiche Cupcakes","totalTime":"1 hr","prepTime":"25 min","inactiveTime":"5 min","cookTime":"30 min","level":"easy","directions":["For the cupcakes: Preheat the oven to 325 degrees F. Line a cupcake or muffin pan with 12 regular-size cupcake liners.","Sift the flour, baking powder, wheat germ, ground ginger, and salt into a medium-size bowl. Set the bowl aside. In the bowl of an electric stand mixer, with a paddle attachment, cream the butter and sugar together, about 6 minutes. Scrape down the sides of the bowl then add the vanilla and 1 egg yolk at a time, scraping down the sides of the bowl after each addition. Turn the mixer to low speed, and add the flour mixture in a steady stream. Turn the mixer to medium speed and beat for 2 minutes. Slowly add the cream. In a separate, grease-free bowl, whisk the egg whites with an electric hand beater and a pinch of salt until they form stiff but moist peaks. Gently stir into the batter by hand with a spatula until no whites are visible.","Fill the cupcake liners half full with batter and bake until they are golden and spring back when touched, about 30 minutes. Cool the cupcakes in their pan for 5 minutes before transferring to a cooling rack.","For the wasabi cream filling: Whip the cream cheese and wasabi paste by hand with a metal spoon in a small bowl. Cover until ready to use.","For the tuna creme fraiche topping: Combine the creme fraiche with 2 1/2 tablespoons of the sesame seeds and 3/4 teaspoon ginger, mixing by hand with a spoon in a medium-size bowl. Pass the tuna through a hand-held zester to form small ribbons. Add the tuna to the creme fraiche and continue mixing. Add the lemon juice and mix until an even consistency is reached.","To assemble: Remove and discard the center of each cooled cupcake using an apple corer. Pipe the wasabi filling into each cavity until level with the top of the cake. Generously dollop the tuna creme fraiche mixture on top and sprinkle with remaining sesame seed and ginger mixture. Decorate with 1 wasabi pea placed in the center of the cake.","This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],"exactIngredients":["Cupcakes:","3/4 cup all-purpose flour","1 teaspoon baking powder","1/4 cup wheat germ","1 1/2 tablespoons ground ginger","1/2 teaspoon salt","4 ounces unsalted butter","3/4 cup sugar","3 eggs, separated","1 teaspoon vanilla extract","4 tablespoons light cream","Pinch salt","Wasabi Cream Filling:","1/2 pound whipped cream cheese","1 tablespoon fresh wasabi paste","Tuna Creme Fraiche Topping:","1 pound creme fraiche","3 tablespoons black and white sesame seeds, mixed, divided","1 teaspoon ground ginger, divided","1 teaspoon fresh lemon juice","5 ounces sushi-grade tuna, chilled for 30 minutes","12 wasabi peas, for garnish"],"baseIngredients":["cupcake","wheat","egg","vanilla","cream","cream cheese","wasabi","tuna","lemon","pea"]},{"title":"Salad of Shaved Artichokes and Sunchokes with Grapefruit and Chicories","totalTime":"25 min","prepTime":"25 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Reduce the orange juice until thick and bubbly, to a syrup. Cool and reserve.","Section grapefruit by removing the peel and pith with a knife, and then cutting between the membranes. Squeeze the remaining grapefruit for its juice; reserve juice.","Whisk together 1 tablespoon of the lemon juice, 1 tablespoon grapefruit juice, and the reduced orange juice. Whisk in 3 ounces of the oil to make an emulsified vinaigrette. Adjust seasoning. Mix together the remaining lemon juice, 1 tablespoon grapefruit juice and the remaining oil to make a loose vinaigrette. Adjust seasoning.","Toss the chicories with the emulsified vinaigrette, season, and divide among 4 cold plates.","Toss the grapefruit sections, sunchokes, artichokes, and chives with the loose vinaigrette, season and place on top of the chicories.","Drizzle the plates with the remaining vinaigrette; and serve."],"exactIngredients":["4 ounces orange juice","1 grapefruit","2 tablespoons lemon juice","5 ounces extra-virgin olive oil","1 (6 to 7 ounce) sunchokes (Jerusalem artichokes), peeled and thinly sliced","4 large artichokes, cleaned with stems and chokes removed, hearts sliced very thin","1 ounce mixed chicories (frisee, radicchio, endive), cut into small pieces","1 teaspoon chopped chives"],"baseIngredients":["orange","grapefruit","lemon","artichoke","chives"]},{"title":"Raspberry Rhubarb Pie","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Tam Valley Bike Club Chain Gear Rub","totalTime":"1 hr 20 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"1 hr","level":"easy","directions":["Preheat grill to medium-high heat.","Place the chili powder, paprika, thyme, salt, garlic powder, pepper, cumin, and cayenne pepper in a large bowl and whisk to combine. Set aside.","Rinse chicken under cold running water and pat dry with paper towels. Rub the spice mixture all over the chicken legs or thighs. Place the chicken skin side down on the grill. Cook about 5 minutes, then turn at a 45 degree angle to establish nice grill marks. Cook another 3 to 5 minutes, until skin is crispy, then flip the chicken pieces over. Cook chicken until the internal temperature reaches 165 degrees F and until the juices run clear, about 8 to 10 minutes more.","Remove the chicken from the grill and serve immediately."],"exactIngredients":["1 cup chili powder","3 tablespoons paprika","3 tablespoons fresh thyme, finely chopped","2 tablespoons kosher or sea salt","2 tablespoons garlic powder","1 tablespoon freshly ground black pepper","2 tablespoons ground cumin","1 teaspoon cayenne pepper","12 chicken legs or thighs"],"baseIngredients":["chili","chicken"]},{"title":"Cherry-Peach Twin Pops","totalTime":"4 hr 15 min","prepTime":"4 hr 15 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Combine the cherry juice and sugar in a large bowl and stir vigorously to dissolve. Pour half of the cherry juice into 3 or 4 pop molds, filling them to varying heights. Pour half of the peach nectar into 3 or 4 more pop molds. Freeze 2 hours.","Fill the cherry pops with peach nectar, and fill the peach pops with cherry juice. Insert wooden sticks three-quarters of the way into the pops and freeze until solid, at least 2 hours or overnight. To release the pops, run the molds under warm water.","Photograph by Levi Brown"],"exactIngredients":["1 1/2 cups sour-cherry juice or nectar","3 tablespoons superfine sugar","1 1/2 cups peach nectar"],"baseIngredients":["nectar"]},{"title":"Salt-and-Pepper Edamame","totalTime":"25 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["Toast salt in a dry, small, heavy skillet over moderate heat, stirring, until the salt turns light tan, about 7 minutes. Transfer salt to a bowl. ","Toast Szechwan peppercorns in skillet over moderate heat, stirring, until fragrant, about 2 minutes. Transfer toasted peppercorns to a sheet of waxed paper to cool. Using paper as a funnel, pour toasted peppercorns into an electric coffee/spice grinder or a mortar. Add pink peppercorns and pulse or pound with a pestle until finely ground. Pour through a coarse sieve into bowl of salt and stir together. ","Cook edamame in salted boiling water until tender, about 4 minutes, and immediately transfer with a slotted spoon to a bowl of ice and cold water to stop cooking. Drain in a colander and pat dry. ","Toss edamame with some peppered salt, to taste, and serve with remainder on the side. ","Cooks' notes: Peppered salt may be made 1 week ahead and kept in an airtight container at cool room temperature. Edamame may be cooked 1 day ahead and chilled, covered. Bring to room temperature before tossing with peppered salt."],"exactIngredients":["1/4 cup coarse sea salt","1 tablespoon Szechwan peppercorns","1 tablespoon pink peppercorns","1 (1-pound) bag frozen edamame (soybeans in the pod)"],"baseIngredients":["soybeans"]},{"title":"Macaroons","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Rack of Lamb 101","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Snappy Gingers","totalTime":"1 hr 20 min","prepTime":"15 min","inactiveTime":"50 min","cookTime":"15 min","level":"easy","directions":["Special equipment: an electric mixer with paddle attachment","Preheat the oven to 350 degrees F. ","Use an electric mixer to cream together the butter, sugar, and brown sugar until light and fluffy. Add the egg yolk and molasses and mix well. ","In a separate bowl, combine the flour, espresso, ginger, cinnamon, cloves, allspice, baking soda, and salt. Mix the dry ingredients into the butter mixture. (The dough will be quite soft.)","Roll the dough into tight 1-inch round logs, wrap snugly in parchment paper or plastic wrap, and chill until firm (see Cook's Note*).","Unwrap the dough and slice into 1/4-inch rounds. Pour some sugar into a shallow dish. Press the top of each cookie into the sugar and then place cookies sugar side up on a parchment paper-lined sheet pan about 2 inches apart. Bake for 12 to 15 minutes. Do not over bake; the cookies will become \"snappy\" once they have cooled completely. Transfer them to a wire cooling rack to cool for 5 minutes.","*Cook's Note: At this point, the dough can be stored in the freezer. From the freezer, let the dough stand at room temperature for 10 minutes before slicing."],"exactIngredients":["2/3 cup unsalted butter, softened","1/2 cup sugar, plus sugar for dusting the cookies","1/4 cup packed brown sugar","1 egg yolk","2 tablespoons blackstrap molasses","1 cup all-purpose flour","1 tablespoon ground espresso","1 1/2 teaspoons ground ginger","1 teaspoon ground cinnamon","1/2 teaspoon ground cloves","1/2 teaspoon allspice","1/2 teaspoon baking soda","1/4 teaspoon salt"],"baseIngredients":["cookie","egg","molasses"]},{"title":"Lousagna","totalTime":"1 hr 55 min","prepTime":"25 min","inactiveTime":-1,"cookTime":"1 hr 30 min","level":"easy","directions":["Preheat the oven to 375 degrees F.","For the tomato sauce: Heat a large, deep skillet over medium-high heat and add the olive oil. Add the lamb, onions and peppers, and cook until the lamb is browned and the vegetables are softened, about 10 minutes. Stir in the tomato paste, and then add the tomato sauce, wine, chicken stock, rosemary, thyme, herbs de Provence and nutmeg. Season with salt and pepper. Simmer while you prepare the cheese filling.","For the cheese filling: In a large bowl, combine the ricotta with the mozzarella and pecorino. Add the egg and yolks and stir well to combine. Stir in the spinach and season with salt and pepper.","To assemble: Remove the sauce from the heat and spread some on the bottom of a 9-by-13-inch baking dish. Lay 2 pasta sheets over the sauce, top with some cheese filling and then some more sauce. Layer on 2 more pasta sheets and repeat until all of the cheese filling and sauce are used, finishing with the sauce. (You may or may not use all of the pasta sheets.) Sprinkle the top with some grated pecorino.","Cover the lasagna with foil and bake in the oven for about 1 hour. Then uncover and bake until the pasta is cooked and the cheese on top is golden and bubbly, about 20 minutes more. Let sit a few minutes before slicing and serving.","This recipe was created by a contestant during a cooking competition. The Food Network Kitchens have not tested it for home use, therefore, we cannot make any representation as to the results."],"exactIngredients":["Tomato Sauce:","2 tablespoons olive oil","1 pound ground lamb","1 onion, chopped","1 green bell pepper, chopped","1 red bell pepper, chopped","1 teaspoon tomato paste","One 28-ounce can tomato sauce","1 cup dry red wine","2 tablespoons chicken stock","1 teaspoon minced fresh rosemary","1 teaspoon minced fresh thyme","1/2 teaspoon herbs de Provence","Pinch ground nutmeg","Salt and freshly ground black pepper","Cheese Filling:","2 cups ricotta","1/2 cup grated mozzarella","1/2 cup grated pecorino cheese, plus more for topping lasagna","1 egg plus 2 egg yolks, beaten","2 cups baby spinach, chopped","Salt and freshly ground black pepper","1 1/2 pounds fresh lasagna pasta sheets"],"baseIngredients":["lamb","tomato","chicken","herbs","cheese","mozzarella","egg","spinach","lasagna"]},{"title":"Main Challenge: Red Chili Citrus Mushrooms with Grilled Zucchini","totalTime":"1 hr 45 min","prepTime":"45 min","inactiveTime":-1,"cookTime":"1 hr","level":"easy","directions":["Heat the oil in a large pot over medium-high heat. Add the onions and mushrooms and saute until golden brown. Season with salt, to taste.","Meanwhile, in a medium-sized bowl, combine the orange juice, lime juice and chili powder. Add juices to the mushroom mixture along with the chicken stock. Simmer until liquid is reduced by two-thirds. Stir in the honey and keep warm over low heat.","Heat a grill or grill pan to medium.","Rub the zucchini slices with the cumin and season with salt. Grill the zucchini, marking both sides, but keeping the slices still firm. Remove to a cutting board. Chop the zucchini into 1-inch pieces and arrange on a large platter. Top with the mushroom mixture and sprinkle with cilantro and goat cheese. ","A viewer, who may not be a professional cook, provided this recipe. The Food Network Kitchens chefs have not tested this recipe and therefore, we cannot make representation as to the results.","Copyright 2009 Television Food Network, G.P. All rights reserved"],"exactIngredients":["4 tablespoons olive oil","1 1/2 pounds yellow onions, sliced","5 pounds white button mushrooms, cut into quarters","Salt","2 cups orange juice","1 cup lime juice","1/3 cup red chili powder","3 cups chicken stock","1/2 cup honey","4 pounds green zucchini, sliced lengthwise into 3 pieces","4 pounds yellow zucchini, sliced lengthwise into 3 pieces","1 tablespoon ground cumin","1 cup chopped cilantro leaves","8 ounces fresh goat cheese"],"baseIngredients":["mushroom","orange","lime","chili","chicken","honey","zucchini","cilantro","cheese"]},{"title":"Shrunken Heads","totalTime":"2 hr 10 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"1 hr 50 min","level":"easy","directions":["Tip: Use Jack O'Lantern tools, melon baler, and bamboo skewers to create features of the face.","Preheat the oven to 350 degrees F.","Slice bacon into small cubes. Saute over medium heat until brown and crispy. Remove bacon to a paper towel lined plate and discard all but 1 tablespoon of the drippings. Saute onion in drippings about 3 minutes and add garlic. Cook until onion is translucent and beginning to brown. Do not allow garlic to brown, reduce heat if necessary. Add bread crumbs and cooked bacon and toss. Remove from heat and allow to cool in pan. ","With melon baler, remove core from apple starting at the top (stem end). Only dig about halfway down into the apple to remove the core, do not go all the way through the apple and out the opposite end. You should now have a well in the apple about 1-inch wide and 2 inches deep (depending on the size of your apple). With a paring knife carefully carve eyes, nose and mouth in side of the apple creating a face. ","To the cooled filling add Parmesan, butter, mustard, and 1 tablespoon of balsamic vinegar. Stuff apples with filling and place in a baking dish so that they do not touch. For best results have carved faces toward the outside of the dish. Brush and drizzle the remaining 2 tablespoons of balsamic vinegar on the outside of the apples, especially any cut features of the face.","Bake for 1 to 1 1/2 hours, until apple is soft.",""],"exactIngredients":["3 slices bacon","1/2 small onion, fine dice","1 clove garlic, minced","1 cup fresh bread crumbs","6 medium Granny Smith apples","2 tablespoons freshly grated Parmesan","2 tablespoons unsalted butter, at room temperature","2 teaspoons whole-grain mustard","3 tablespoons balsamic vinegar"],"baseIngredients":["bacon","bread","apple"]},{"title":"Tabbouleh","totalTime":"1 hr 20 min","prepTime":"50 min","inactiveTime":"30 min","cookTime":-1,"level":"easy","directions":["Mix the bulgur and boiling water in a large mixing bowl and allow to soak at room temperature for 30 minutes, stirring occasionally. Refrigerate until completely cool. Then, add mango, green onion, and almonds. Tabbouleh is ready to serve."],"exactIngredients":["4 cups bulgur","4 cups boiling water","1 cup diced mango","1 bunch green onion, finely diced","1/2 cup chopped almonds"],"baseIngredients":["mango"]},{"title":"Bonus Waffle Recipe: Waffle Crumbles","totalTime":"15 min","prepTime":"5 min","inactiveTime":-1,"cookTime":"10 min","level":"easy","directions":["Serving suggestion: light ice cream or yogurt","Preheat the oven to 350 degrees F. Spray a baking sheet with nonstick spray and set aside.","Lightly toast the waffle, and then tear it into pieces. Place the pieces in a blender or food processor, and pulse until they are reduced to crumbs.","Place the crumbs in an even layer on the baking sheet, and sprinkle with brown sugar and cinnamon. Bake in the oven until crispy, 5 to 7 minutes.","Serve over light ice cream or yogurt. Enjoy!","PER SERVING (entire recipe): 103 calories, 1.5g fat, 188mg sodium, 21.5g carbs, 2g fiber, 7.5g sugars, 2.5g protein"],"exactIngredients":["1 frozen low-fat waffle","2 teaspoons brown sugar (not packed)","1/8 teaspoon cinnamon"],"baseIngredients":["waffle"]},{"title":"Cherry Buster","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["To make mocha syrup, mix all ingredients except espresso. Add espresso to desired strength. For the cherry buster drink, pour the cherry and mocha syrups in the bottom of a mug. Add the hot shots of espresso and swirl the chocolate and syrup together. Pour in steamed milk. Add whipped cream if desired."],"exactIngredients":["Bongo Java mocha syrup:","3 tablespoons unsweetened cocoa powder","3 tablespoons sugar","1 tablespoons white corn syrup","1 tablespoon boiling hot water","1 shot espresso, to taste","Cherry Buster:","1 tablespoon cherry syrup","1 tablespoon Bongo Java mocha syrup","2 shots espresso, hot","12 ounces steamed milk","Whipped cream (optional)"],"baseIngredients":["syrup","corn","cherry","milk","whipped cream"]},{"title":"Passionate Dream","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["In a pitcher, combine pomegranate juice, cranberry juice, sugar substitute, lime juice, and vodka over ice. Top off with club soda."],"exactIngredients":["1 cup pomegranate juice","1 cup unsweetened cranberry juice","6 packets sugar substitute (recommended: Splenda)","6 tablespoons lime juice","2 cups vodka","Club soda"],"baseIngredients":["pomegranate","cranberry","lime"]},{"title":"Sausage, Wurst and Mustard","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Twisted Hot Sauce","totalTime":"35 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["Saute the red onion in the olive oil until lightly caramelized. Add the passion fruit puree, casacabel chile puree, and mango puree to the onions. Reduce the mixture for 2 minutes and add the sherry vinegar. Chill the sauce and set aside. Add the finely sliced scallions to the chilled mixture and mix well. Season and serve warm."],"exactIngredients":["1/2 red onion, julienned","4 tablespoons extra-virgin olive oil","2 teaspoons passion fruit puree","1 teaspoon rehydrated and pureed cascabel chile","2 tablespoons mango puree","2 tablespoons sherry vinegar","2 scallions, finely sliced","Salt and pepper"],"baseIngredients":["fruit","mango"]},{"title":"Barbecued Chicken","totalTime":"1 hr 30 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"1 hr 15 min","level":"easy","directions":["Arrange the grill grate approximately 25 to 27 inches from the charcoal. If it is too close, the chicken will cook too fast, burn and dry out.","Pile the charcoal in a pyramid. Ignite the charcoal with lighter fluid. Once the top portion of the charcoal has turned white, spread the charcoal out evenly using a fireproof tool such as a metal rake or shovel.","Place the chicken on the cooking surface. Approximately every 5 minutes, turn the chicken with tongs (being careful not to tear the skin) and baste with the sauce each time (for best results, used a clean shaker or squeeze bottle). ","Grill for approximately 1 hour to 1 hour and 15 minutes. Add charcoal, if necessary, to finish off (maybe 1/2 to 2/3 way through the cooking process) and be sure not to use lighter fluid, just sprinkle the new charcoal over the existing. The chicken is done when an instant-read thermometer inserted into the thickest part of the thigh reads 165 degrees F."],"exactIngredients":["6 (22-ounce) chicken halves (fryers are best)","2 (16-ounce) bottles barbecue sauce","5 to 7 pounds charcoal briquettes","Lighter fluid"],"baseIngredients":["chicken","barbecue"]},{"title":"HG Hot Couple: Sassy 'n Steamy Artichoke with Salsa","totalTime":"15 min","prepTime":"5 min","inactiveTime":-1,"cookTime":"10 min","level":"easy","directions":["Cut the stem off the artichoke and remove the small, tough leaves at the base. Slice an inch off the top of the artichoke and, if you like, trim the tips of the leaves with kitchen shears (if you've got 'em).","Place the artichoke in a large microwave-safe bowl, base down, and add about 1/2 inch of water to the bowl. Cover it and microwave for 6 to 8 minutes. Let it stand for 1 to 2 minutes before uncovering. The leaves should detach easily from the artichoke. Drain the water and allow it to cool slightly.","Serve your steamed 'choke with salsa. Here's the 1-2-3 on how to eat it:","1. Pull off a leaf and dip the base in salsa.","2. Place the base in your mouth, dip side up, and gently close your teeth around it.","3. Scrape it along your top teeth to consume the soft, delicious part (YUM!), and then discard the leaf.","Now repeat! And when all the leaves are gone, scoop out and discard the thistle-like choke, and enjoy the artichoke bottom (the BEST part)!","PER SERVING (entire recipe): 89 calories, 0g fat, 449mg sodium, 20g carbs, 9.5g fiber, 1.5g sugars, 6g protein"],"exactIngredients":["1 large artichoke","3 tablespoons salsa"],"baseIngredients":["artichoke"]},{"title":"Barmouche's Potato Salad","totalTime":"30 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["In a large bowl, thoroughly combine all ingredients. Season, to taste, with salt and pepper."],"exactIngredients":["2 pounds red bliss potatoes, quartered and boiled until tender","3 cups mayonnaise","1 white onion, minced","1/2 pound celery, minced","4 tablespoons Dijon mustard","4 tablespoons sweet pickle relish","2 tablespoons white wine vinegar","Salt and white pepper"],"baseIngredients":["potato","celery"]},{"title":"Poached Fruit","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Salad of Shaved Artichokes and Sunchokes with Grapefruit and Chicories","totalTime":"25 min","prepTime":"25 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Reduce the orange juice until thick and bubbly, to a syrup. Cool and reserve.","Section grapefruit by removing the peel and pith with a knife, and then cutting between the membranes. Squeeze the remaining grapefruit for its juice; reserve juice.","Whisk together 1 tablespoon of the lemon juice, 1 tablespoon grapefruit juice, and the reduced orange juice. Whisk in 3 ounces of the oil to make an emulsified vinaigrette. Adjust seasoning. Mix together the remaining lemon juice, 1 tablespoon grapefruit juice and the remaining oil to make a loose vinaigrette. Adjust seasoning.","Toss the chicories with the emulsified vinaigrette, season, and divide among 4 cold plates.","Toss the grapefruit sections, sunchokes, artichokes, and chives with the loose vinaigrette, season and place on top of the chicories.","Drizzle the plates with the remaining vinaigrette; and serve."],"exactIngredients":["4 ounces orange juice","1 grapefruit","2 tablespoons lemon juice","5 ounces extra-virgin olive oil","1 (6 to 7 ounce) sunchokes (Jerusalem artichokes), peeled and thinly sliced","4 large artichokes, cleaned with stems and chokes removed, hearts sliced very thin","1 ounce mixed chicories (frisee, radicchio, endive), cut into small pieces","1 teaspoon chopped chives"],"baseIngredients":["orange","grapefruit","lemon","artichoke","chives"]},{"title":"Grilled Pound Cake \"Brats\"","totalTime":"12 hr 30 min","prepTime":"25 min","inactiveTime":"12 hr","cookTime":"5 min","level":"easy","directions":["In a medium bowl, add 1 pint of blackberries, 2 tablespoons of baker's sugar, half of the lemon zest, half of the lemon juice and 1/8 teaspoon of cinnamon. Stir to combine. Cover the bowl and refrigerate overnight.","Preheat a grill to medium.","Cut the pound cake into 8 even rectangular slices. Cut a V-shape out of 1 side of each section and grill the slices over medium heat until grill marks appear.","For the blackberry sauce: Blitz together in a blender the remaining 1/2 cup of baker's sugar, 1 pint of blackberries, remaining lemon zest and lemon juice and a little water, if needed, to make a smooth sauce.","Whip the cream in a small bowl with a hand mixer, and add some sugar and cinnamon, to taste. Arrange the pound cake on a serving platter. Put some of the macerated berries inside the cut out V-shape of each pound cake section. Top with blackberry sauce and whipped cream. Garnish with sprig of mint and serve.","Green Bay Packers Team Tundra Menu/Recipes"],"exactIngredients":["2 pints fresh local blackberries","2 tablespoons baker's sugar, plus 1/2 cup, plus more for cream","1 lemon, zested and juiced","1/8 teaspoon ground cinnamon, plus more for cream","1 loaf pound cake","1 pint whipping cream","3 to 4 sprigs mint, leaves chiffonade","A viewer, who may not be a professional cook, provided this recipe. The Food Network Kitchens chefs have not tested this recipe and therefore, we cannot make representation as to the results."],"baseIngredients":["blackberry","cream","lemon","cake","chef"]},{"title":"Bufala Mozzerella with Alici di Menaica","totalTime":"37 min","prepTime":"30 min","inactiveTime":-1,"cookTime":"7 min","level":"easy","directions":["In a bowl, whisk together the parsley, olive oil, garlic, lemon zest, and lemon juice. Season to taste with salt, freshly ground black pepper, and more lemon juice.","To make the salad:","Put the eggs in a medium saucepan with enough water to cover. Bring to a boil over high heat and then turn down to a low simmer and cook for 7 minutes. Immediately plunge them into a large bowl of ice water to chill. Peel the eggs and cut them in half. ","Toss the mizuna or rucola in just enough of the parsley vinaigrette to moisten. ","To serve, arrange three lemon slices in a clover-shape on a plate. Top with 1 ounce of the mozzarella. Drape 1 or 2 anchovy halves, depending on their size, over the cheese. Place a small handful of mizuna over the cheese and anchovy. Grate a small amount of egg over the top of the greens. Finish with a drizzle of the vinaigrette. The remaining vinaigrette will keep in the refrigerator for 3 to 4 days.","This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],"exactIngredients":["Parsley vinaigrette:","1 cup Italian parsley leaves, chopped","2/3 cup extra-virgin olive oil","3 cloves garlic, grated","Grated zest of 1 lemon","1 tablespoon fresh lemon juice, more if needed","Salt and freshly ground black pepper","Salad:","2 eggs","3 cups mizuna or rucola","1 Meyer lemon, sliced paper thin","6 to 8 ounces bufala mozzarella, sliced","12 salt-packed anchovies, rinsed well and backbone removed"],"baseIngredients":["lemon","salad","egg","mozzarella","anchovy"]},{"title":"Snappy Gingers","totalTime":"1 hr 20 min","prepTime":"15 min","inactiveTime":"50 min","cookTime":"15 min","level":"easy","directions":["Special equipment: an electric mixer with paddle attachment","Preheat the oven to 350 degrees F. ","Use an electric mixer to cream together the butter, sugar, and brown sugar until light and fluffy. Add the egg yolk and molasses and mix well. ","In a separate bowl, combine the flour, espresso, ginger, cinnamon, cloves, allspice, baking soda, and salt. Mix the dry ingredients into the butter mixture. (The dough will be quite soft.)","Roll the dough into tight 1-inch round logs, wrap snugly in parchment paper or plastic wrap, and chill until firm (see Cook's Note*).","Unwrap the dough and slice into 1/4-inch rounds. Pour some sugar into a shallow dish. Press the top of each cookie into the sugar and then place cookies sugar side up on a parchment paper-lined sheet pan about 2 inches apart. Bake for 12 to 15 minutes. Do not over bake; the cookies will become \"snappy\" once they have cooled completely. Transfer them to a wire cooling rack to cool for 5 minutes.","*Cook's Note: At this point, the dough can be stored in the freezer. From the freezer, let the dough stand at room temperature for 10 minutes before slicing."],"exactIngredients":["2/3 cup unsalted butter, softened","1/2 cup sugar, plus sugar for dusting the cookies","1/4 cup packed brown sugar","1 egg yolk","2 tablespoons blackstrap molasses","1 cup all-purpose flour","1 tablespoon ground espresso","1 1/2 teaspoons ground ginger","1 teaspoon ground cinnamon","1/2 teaspoon ground cloves","1/2 teaspoon allspice","1/2 teaspoon baking soda","1/4 teaspoon salt"],"baseIngredients":["cookie","egg","molasses"]},{"title":"Star Tea","totalTime":"55 min","prepTime":"10 min","inactiveTime":"30 min","cookTime":"15 min","level":"easy","directions":["Bring 1 quart of water to a boil over medium heat. Put the tea bag in the water, then turn off the heat and let the tea steep until cooled. Mix 1/2 cup simple syrup with the tea and add it to a mason jar or other type of jar. Saute the carambola fruit in a pan with the sugar on a side burner of the grill. When the fruit has caramelized remove it and add it to the jar with the tea. Pour over ice and use 1 piece of fruit for each glass as a garnish."],"exactIngredients":["1 quart water","1 family-sized tea bag","1/2 cup simple syrup (equal amounts sugar and water heated until the sugar dissolves; cool)","6 slices carambola (also referred to as star fruit)","3 tablespoons sugar","Ice"],"baseIngredients":["tea","fruit"]},{"title":"Sole Meuniere with Balsamic Brown Butter Sauce","totalTime":"40 min","prepTime":"10 min","inactiveTime":"20 min","cookTime":"10 min","level":"easy","directions":["Soak fillets in milk for 20 minutes. Remove from milk and pat dry.","Season fillets with salt and pepper.","Heat 1 tablespoon oil over moderate heat in each of 2 large saute pans until hot.","Put flour into a shallow dish and season with salt and pepper. Dredge fillets in flour, shaking off any excess flour. Dip the fillets back into the milk and then again into the flour. Place fillets in saute pans and cook over medium heat for 2 to 3 minutes per side, until golden brown and crispy. Transfer fillets from pans to a platter, sprinkle with parsley.","Wipe the skillet clean and add the butter. Heat until the butter begins to brown. Remove from heat and stir in balsamic vinegar. Pour sauce over fish and serve. Garnish with lemon slices."],"exactIngredients":["4 (6-ounce) sole fillets, skin removed","2 cups milk","Salt and freshly ground black pepper","2 tablespoons olive oil","1 cup flour","Salt, pepper","4 tablespoons finely chopped parsley","6 tablespoons butter","1 to 2 tablespoons balsamic vinegar, or to taste","Lemon slices, for garnish"],"baseIngredients":["fillet","milk","lemon"]},{"title":"Lousagna","totalTime":"1 hr 55 min","prepTime":"25 min","inactiveTime":-1,"cookTime":"1 hr 30 min","level":"easy","directions":["Preheat the oven to 375 degrees F.","For the tomato sauce: Heat a large, deep skillet over medium-high heat and add the olive oil. Add the lamb, onions and peppers, and cook until the lamb is browned and the vegetables are softened, about 10 minutes. Stir in the tomato paste, and then add the tomato sauce, wine, chicken stock, rosemary, thyme, herbs de Provence and nutmeg. Season with salt and pepper. Simmer while you prepare the cheese filling.","For the cheese filling: In a large bowl, combine the ricotta with the mozzarella and pecorino. Add the egg and yolks and stir well to combine. Stir in the spinach and season with salt and pepper.","To assemble: Remove the sauce from the heat and spread some on the bottom of a 9-by-13-inch baking dish. Lay 2 pasta sheets over the sauce, top with some cheese filling and then some more sauce. Layer on 2 more pasta sheets and repeat until all of the cheese filling and sauce are used, finishing with the sauce. (You may or may not use all of the pasta sheets.) Sprinkle the top with some grated pecorino.","Cover the lasagna with foil and bake in the oven for about 1 hour. Then uncover and bake until the pasta is cooked and the cheese on top is golden and bubbly, about 20 minutes more. Let sit a few minutes before slicing and serving.","This recipe was created by a contestant during a cooking competition. The Food Network Kitchens have not tested it for home use, therefore, we cannot make any representation as to the results."],"exactIngredients":["Tomato Sauce:","2 tablespoons olive oil","1 pound ground lamb","1 onion, chopped","1 green bell pepper, chopped","1 red bell pepper, chopped","1 teaspoon tomato paste","One 28-ounce can tomato sauce","1 cup dry red wine","2 tablespoons chicken stock","1 teaspoon minced fresh rosemary","1 teaspoon minced fresh thyme","1/2 teaspoon herbs de Provence","Pinch ground nutmeg","Salt and freshly ground black pepper","Cheese Filling:","2 cups ricotta","1/2 cup grated mozzarella","1/2 cup grated pecorino cheese, plus more for topping lasagna","1 egg plus 2 egg yolks, beaten","2 cups baby spinach, chopped","Salt and freshly ground black pepper","1 1/2 pounds fresh lasagna pasta sheets"],"baseIngredients":["lamb","tomato","chicken","herbs","cheese","mozzarella","egg","spinach","lasagna"]},{"title":"Rack of Lamb 101","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Grilled Bacara Ranch Romaine Leaves with Prosciutto, Pine Nuts and Basil","totalTime":"26 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"6 min","level":"easy","directions":["In a large sauce pot with boiling salt water, blanch romaine leaves for 5 seconds and place in ice water bath. Remove and dry off surface. Layer 1 slice of mozzarella, 1 basil leaf, and toss in some pine nuts. Roll up and wrap in prosciutto. Repeat process with rest of leaves.","Marinate in olive oil and cracked black pepper. Reserve for grill. Grill lightly until cheese is soft and serve."],"exactIngredients":["8 large outside Romaine leaves","8 slices fresh mozzarella, cut 1/4-inch thick","8 large basil leaves","1/4 cup toasted pine nuts","8 thin slices prosciutto","Olive oil","Cracked black pepper"],"baseIngredients":["romaine","mozzarella"]},{"title":"Bonus Waffle Recipe: Waffle Crumbles","totalTime":"15 min","prepTime":"5 min","inactiveTime":-1,"cookTime":"10 min","level":"easy","directions":["Serving suggestion: light ice cream or yogurt","Preheat the oven to 350 degrees F. Spray a baking sheet with nonstick spray and set aside.","Lightly toast the waffle, and then tear it into pieces. Place the pieces in a blender or food processor, and pulse until they are reduced to crumbs.","Place the crumbs in an even layer on the baking sheet, and sprinkle with brown sugar and cinnamon. Bake in the oven until crispy, 5 to 7 minutes.","Serve over light ice cream or yogurt. Enjoy!","PER SERVING (entire recipe): 103 calories, 1.5g fat, 188mg sodium, 21.5g carbs, 2g fiber, 7.5g sugars, 2.5g protein"],"exactIngredients":["1 frozen low-fat waffle","2 teaspoons brown sugar (not packed)","1/8 teaspoon cinnamon"],"baseIngredients":["waffle"]},{"title":"Main Challenge: Red Chili Citrus Mushrooms with Grilled Zucchini","totalTime":"1 hr 45 min","prepTime":"45 min","inactiveTime":-1,"cookTime":"1 hr","level":"easy","directions":["Heat the oil in a large pot over medium-high heat. Add the onions and mushrooms and saute until golden brown. Season with salt, to taste.","Meanwhile, in a medium-sized bowl, combine the orange juice, lime juice and chili powder. Add juices to the mushroom mixture along with the chicken stock. Simmer until liquid is reduced by two-thirds. Stir in the honey and keep warm over low heat.","Heat a grill or grill pan to medium.","Rub the zucchini slices with the cumin and season with salt. Grill the zucchini, marking both sides, but keeping the slices still firm. Remove to a cutting board. Chop the zucchini into 1-inch pieces and arrange on a large platter. Top with the mushroom mixture and sprinkle with cilantro and goat cheese. ","A viewer, who may not be a professional cook, provided this recipe. The Food Network Kitchens chefs have not tested this recipe and therefore, we cannot make representation as to the results.","Copyright 2009 Television Food Network, G.P. All rights reserved"],"exactIngredients":["4 tablespoons olive oil","1 1/2 pounds yellow onions, sliced","5 pounds white button mushrooms, cut into quarters","Salt","2 cups orange juice","1 cup lime juice","1/3 cup red chili powder","3 cups chicken stock","1/2 cup honey","4 pounds green zucchini, sliced lengthwise into 3 pieces","4 pounds yellow zucchini, sliced lengthwise into 3 pieces","1 tablespoon ground cumin","1 cup chopped cilantro leaves","8 ounces fresh goat cheese"],"baseIngredients":["mushroom","orange","lime","chili","chicken","honey","zucchini","cilantro","cheese"]},{"title":"Wasabi Lobster Mash","totalTime":"55 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"40 min","level":"easy","directions":["Bring a large pot of salted water to a boil. Add the lobster tails and simmer until cooked through, about 8 minutes. Remove the tails from the water and let cool. Remove the meat from the shell, discard the shell and chop the meat into bite-size pieces.","Bring the water back up to a boil and add the potatoes. Boil the potatoes until very tender, about 30 minutes. Drain the potatoes and put them back into the pot.","Add the milk, butter, clam juice, soy sauce and wasabi paste. Mash the potatoes and blend in all the ingredients. Stir in more milk if the potatoes are too dry. Gently stir in the tarragon and lobster meat. Season with salt and pepper. Serve warm.","This recipe was created by a contestant during a cooking competition. The Food Network Kitchens have not tested it for home use, therefore, we cannot make any representation as to the results."],"exactIngredients":["Salt","3 lobster tails, fresh or frozen and thawed","4 pounds russet potatoes, peeled and cut into 2-inch pieces","1/2 cup whole milk, plus more if needed","4 tablespoons unsalted butter","1 tablespoon clam juice","1 tablespoon soy sauce","3 teaspoons wasabi paste","2 teaspoons chopped fresh tarragon","Freshly ground black pepper"],"baseIngredients":["lobster","potato","milk","clam","wasabi","tarragon"]},{"title":"Shrunken Heads","totalTime":"2 hr 10 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"1 hr 50 min","level":"easy","directions":["Tip: Use Jack O'Lantern tools, melon baler, and bamboo skewers to create features of the face.","Preheat the oven to 350 degrees F.","Slice bacon into small cubes. Saute over medium heat until brown and crispy. Remove bacon to a paper towel lined plate and discard all but 1 tablespoon of the drippings. Saute onion in drippings about 3 minutes and add garlic. Cook until onion is translucent and beginning to brown. Do not allow garlic to brown, reduce heat if necessary. Add bread crumbs and cooked bacon and toss. Remove from heat and allow to cool in pan. ","With melon baler, remove core from apple starting at the top (stem end). Only dig about halfway down into the apple to remove the core, do not go all the way through the apple and out the opposite end. You should now have a well in the apple about 1-inch wide and 2 inches deep (depending on the size of your apple). With a paring knife carefully carve eyes, nose and mouth in side of the apple creating a face. ","To the cooled filling add Parmesan, butter, mustard, and 1 tablespoon of balsamic vinegar. Stuff apples with filling and place in a baking dish so that they do not touch. For best results have carved faces toward the outside of the dish. Brush and drizzle the remaining 2 tablespoons of balsamic vinegar on the outside of the apples, especially any cut features of the face.","Bake for 1 to 1 1/2 hours, until apple is soft.",""],"exactIngredients":["3 slices bacon","1/2 small onion, fine dice","1 clove garlic, minced","1 cup fresh bread crumbs","6 medium Granny Smith apples","2 tablespoons freshly grated Parmesan","2 tablespoons unsalted butter, at room temperature","2 teaspoons whole-grain mustard","3 tablespoons balsamic vinegar"],"baseIngredients":["bacon","bread","apple"]},{"title":"Tabbouleh","totalTime":"1 hr 20 min","prepTime":"50 min","inactiveTime":"30 min","cookTime":-1,"level":"easy","directions":["Mix the bulgur and boiling water in a large mixing bowl and allow to soak at room temperature for 30 minutes, stirring occasionally. Refrigerate until completely cool. Then, add mango, green onion, and almonds. Tabbouleh is ready to serve."],"exactIngredients":["4 cups bulgur","4 cups boiling water","1 cup diced mango","1 bunch green onion, finely diced","1/2 cup chopped almonds"],"baseIngredients":["mango"]},{"title":"Brussels Tartine","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Mix the 2 cheeses in a bowl. Add the chopped shallots as well as the Gueze Lambi beer. Mix until you have a homogenous cream. Cover the entire slice of bread with a thick layer of the cream. Cut the tartine in 4 equal triangles. Repeat with the remaining bread slices. Place the pieces on a plate and garnish with the sliced cucumber, radishes, and parsley. Serve.","This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The FN chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],"exactIngredients":["1 cup Bruxelles cheese","1 cup fromage blanc","3 shallots, finely chopped","1 to 2 tablespoons of Belgian beer (Gueze Lambic)","4 slices wheat bread","Radishes, cucumber slices, parsley, for garnish"],"baseIngredients":["cheese","shallots","bread","cucumber"]},{"title":"Tam Valley Bike Club Chain Gear Rub","totalTime":"1 hr 20 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"1 hr","level":"easy","directions":["Preheat grill to medium-high heat.","Place the chili powder, paprika, thyme, salt, garlic powder, pepper, cumin, and cayenne pepper in a large bowl and whisk to combine. Set aside.","Rinse chicken under cold running water and pat dry with paper towels. Rub the spice mixture all over the chicken legs or thighs. Place the chicken skin side down on the grill. Cook about 5 minutes, then turn at a 45 degree angle to establish nice grill marks. Cook another 3 to 5 minutes, until skin is crispy, then flip the chicken pieces over. Cook chicken until the internal temperature reaches 165 degrees F and until the juices run clear, about 8 to 10 minutes more.","Remove the chicken from the grill and serve immediately."],"exactIngredients":["1 cup chili powder","3 tablespoons paprika","3 tablespoons fresh thyme, finely chopped","2 tablespoons kosher or sea salt","2 tablespoons garlic powder","1 tablespoon freshly ground black pepper","2 tablespoons ground cumin","1 teaspoon cayenne pepper","12 chicken legs or thighs"],"baseIngredients":["chili","chicken"]},{"title":"Cherry-Peach Twin Pops","totalTime":"4 hr 15 min","prepTime":"4 hr 15 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Combine the cherry juice and sugar in a large bowl and stir vigorously to dissolve. Pour half of the cherry juice into 3 or 4 pop molds, filling them to varying heights. Pour half of the peach nectar into 3 or 4 more pop molds. Freeze 2 hours.","Fill the cherry pops with peach nectar, and fill the peach pops with cherry juice. Insert wooden sticks three-quarters of the way into the pops and freeze until solid, at least 2 hours or overnight. To release the pops, run the molds under warm water.","Photograph by Levi Brown"],"exactIngredients":["1 1/2 cups sour-cherry juice or nectar","3 tablespoons superfine sugar","1 1/2 cups peach nectar"],"baseIngredients":["nectar"]},{"title":"Melon, Arugula, and Serrano Ham with Smoked Paprika Dressing","totalTime":"45 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"30 min","level":"easy","directions":["To make dressing: Whisk together lime juice, paprika, salt, and pepper in a small bowl and add oil in a slow stream, whisking until well blended.","To make salad: Toss cantaloupe and honeydew with half of dressing in a bowl. Decoratively arrange the arugula on a platter and then add the melon. Season with salt and pepper, to taste an drizzle with remaining dressing. Serve immediately.","Cook's note: It is important that the ham not be sliced as thinly as prosciutto usually is. Slightly thicker ham is easier to cut into strips and will stay separated in a salad instead of clumping together."],"exactIngredients":["For dressing:","1 1/2 tablespoons fresh lime juice","1/2 teaspoon smoked paprika (sweet or hot)","1/4 teaspoon salt","1/8 teaspoon black pepper","5 tablespoons mild extra-virgin olive oil","For salad:","2 cups 1-inch pieces cantaloupe flesh","2 cups 1-inch pieces honeydew flesh","2 large bunches arugula (3/4 pound), coarse stems discarded","4 ounces thinly sliced serrano ham, cut crosswise into 3/4-inch-wide strips"],"baseIngredients":["lime","salad","cantaloupe","honeydew","ham"]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Wood-Roasted Striped Bass with Meyer Lemon and Olive Relish","totalTime":"45 min","prepTime":"25 min","inactiveTime":-1,"cookTime":"20 min","level":"easy","directions":["For first step in this recipe is to set up your outdoor grill, a hibachi or kettle grill with do just fine. Use natural hardwood charcoal. Start the fire with kindling and paper; light it with only matches-not lighter fluid. Lighter fluid will give the food an unnatural chemical taste. Get the charcoal to a medium heat and set the grill rack about 4 inches above the coals.","Make a few slits into the sides of the fish and insert the garlic slices into the incisions. Rub the fish with salt and oil. Grill for about 8 minutes per side. After turning the fish, rub olive oil and salt onto the spring onions and grill with the fish for the remaining 8 minutes. Remove fish and onions from the grill and onto a warm plate.","For the relish simply mix all of the ingredients together and scoop onto the hot fish (can be made a day inn advance).","This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The FN chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],"exactIngredients":["For the Fish:","2 (1 1/2-pound) whole striped bass or snapper, scaled and gutted","1 large clove garlic, peeled and sliced","2 tablespoons olive oil","2 teaspoons kosher salt","For garnish:","12 spring onions or scallions","2 tablespoons olive oil","Salt","For the Relish:","1 Meyer lemon preserved in salt for 4 to 6 weeks (use only the skin of the leon diced into small pieces)","1 tablespoon minced shallots","1 tablespoon minced black olives, such as nicoise or kalamata","2 tablespoons lemon juice","4 tablespoons extra virgin olive oil","1 teaspoon chopped parsley"],"baseIngredients":["fish","relish","lemon","shallots","olive"]},{"title":"White Chocolate Valentines","totalTime":"2 hr 28 min","prepTime":"20 min","inactiveTime":"2 hr","cookTime":"8 min","level":"easy","directions":["Start with Alton's Sugar Cookie dough recipe.","Equipment: 2 1/2-by-3-inch heart-shaped cookie cutter","Sift together flour, baking powder, and salt. Place butter and sugar in the bowl of a standing mixer and beat until light in color. Add the red food coloring, egg and milk and beat to combine. Proceed with recipe and chill for 2 hours.","Preheat the oven to 375 degrees F.","Sprinkle a work surface and rolling pin with confectioner's sugar and roll out dough to 1/4-inch thick. Move dough frequently to prevent it from sticking and add more confectioner's sugar to the work surface and rolling pin as needed. With a 2 1/2-by-3-inch heart-shaped cookie cutter, cut 36 hearts, re-rolling dough as needed. Place at least 1 inch apart on parchment-lined baking sheets, and bake until cookies are set but not brown, about 7-8 minutes. Let cool on the pan slightly before transferring to a rack to cool completely.","To make striped Valentine hearts, transfer half of the melted chocolate to a disposable pastry bag, twist the end closed, and using scissors, snip a very small opening in the tip. Starting at the bottom of the cookie, apply gentle pressure to the pastry bag and drizzle lines of chocolate back and forth over the cookie, moving up as the chocolate flows. Allow chocolate to set before eating or packaging.","To make polka-dot Valentine hearts, color the remaining chocolate with pink food coloring to the desired shade of pink. Transfer to a disposable pastry bag, twist the end closed, and using scissors, snip a very small opening in the tip. Hold the pastry bag perpendicular to the cookie and apply gentle pressure to pipe a dot of chocolate. Release the pressure on the bag until the flow stops, and continue over the surface of the cookie, piping different sized dots, if desired. Gently tap the cookie to settle the chocolate and allow to set before eating or packaging.","Cook's Note: If gel paste food colorings are not available, add liquid food coloring until you achieve desired color. For pink, simply use a little red."],"exactIngredients":["Ingredients for 1 recipe Sugar Cookie Dough, at room temperature","1 teaspoon red gel paste food coloring","4 ounces white chocolate, melted","Pink gel paste food coloring"],"baseIngredients":["cookie","chocolate"]},{"title":"Blueberry Hill","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Mix all ingredients and pour over ice. Garnish with a cherry."],"exactIngredients":["3/4 -ounce rum (recommended: Bacardi)","3/4 -ounce raspberry liqueur","2 ounces sweet and sour mix","2 ounces lemon lime soda"],"baseIngredients":["raspberry","sour","lemon"]},{"title":"Spiced Pita Toasts","totalTime":"20 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"10 min","level":"easy","directions":["Preheat oven to 400 degrees F.","In a dry small heavy skillet toast seeds over moderate heat, shaking skillet, until fragrant, about 1 minute, and cool. In an electric coffee/spice grinder finely grind seeds and salt with paprika and in a bowl stir together with oil.","Split each pita into 2 rounds and brush rough sides with cumin oil. Cut each round into 8 wedges and arrange, rough sides up, on 2 large baking sheets. Bake wedges and arrange, rough sides up, on 2 large baking sheets. Bake wedges in upper and lower thirds of the oven, switching position of sheets halfway through baking, until golden brown and crisp, about 8 minutes total. Cool pita toasts on racks. Pita toasts keep 5 days in an airtight container at room temperature.","Wine Suggestions: A rose from the Languedoc Valley in Southern France, most recent vintage available or Boutari Red Noussa Reserve, Greece, most recent vintage available"],"exactIngredients":["4 teaspoons cumin seeds","1 teaspoon coarse salt","2 teaspoons paprika","1/2 cup olive oil","6 (6-inch) pitas with pockets"],"baseIngredients":[]},{"title":"Pacific Halibut with Caramelized Fennel, Black Olives, Orange Zest, and Dill","totalTime":"25 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["In a saute pan add the sliced fennel and the sambuca. Cook's Note: Pour the liqueur into the pan when the fire is off, as it is very flammable. Put the pan over low heat, and let the sambuca ignite. Allow the alcohol to evaporate and cook at medium heat until the liqueur begins to caramelize. At this point it will start to bubble. Add the lemon juice, red pepper flakes, salt, to taste, the orange zest, the olives, and dill. Cook for a couple of minutes, and then stir in a teaspoon of butter to give the sauce a little creaminess. Set aside.","Score the fish fillets, cut them in half and season with salt and pepper, to taste. Coat a saute pan, over medium heat, with extra-virgin olive oil and add the fillets, skin side down. Allow to cook for 3 to 5 minutes.","Remove from the heat.","To serve: Put some of the fennel sauce in the center of each serving dish and top with 2 pieces of the fish.","This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],"exactIngredients":["1 large fennel bulb, sliced","2 cups sambuca or anisette","1 lemon, juiced","Pinch red pepper flakes","Salt","1/8 teaspoon orange zest","1/2 cup chopped kalamata olives","1/2 tablespoon fresh chopped dill","1 teaspoon butter","4 (6-ounce) halibut fillets or any white fish","Freshly ground black pepper","Extra-virgin olive oil"],"baseIngredients":["fennel","lemon","red pepper","orange","olive","dill","fillet"]},{"title":"Herb Refresher","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Add the lime juice and 3 cups water to a large pitcher.","Place the parsley, peppermint, basil and mustard seeds in a blender with the remaining 1 cup water. Puree until smooth, about 1 minute.","Strain the pureed mixture through a fine-mesh sieve into the pitcher. Refrigerate for at least 1 hour before serving. Garnish with lime slices and more parsley and mint.","Photograph by Ngoc Minh Ngo"],"exactIngredients":["Juice of 1/2 lime, plus lime slices for garnish","4 cups water","1 tablespoon fresh parsley leaves, plus more for garnish","4 to 6 fresh peppermint leaves, plus more for garnish","2 fresh basil leaves","5 mustard seeds"],"baseIngredients":["lime"]},{"title":"\"What am I...?\" Chopped Liver with Schmaltz Fried Onions","totalTime":"40 min","prepTime":"5 min","inactiveTime":-1,"cookTime":"35 min","level":"easy","directions":["In a skillet over medium heat, saute the chicken skin until it releases its fat and the fat begins to turn golden brown, about 20 minutes. Remove the chicken skin and pour off half of the rendered fat, or schmaltz.","Add the onions to the pan with the remaining chicken fat and cook until the onions are translucent, tender, and caramelized, about 10 minutes. Season with salt, to taste. Remove half of the onions from the pan and set aside. Raise the heat to medium-high and add the reserved chicken fat and chicken livers to the remaining onions. Saute the livers, turning once, until cooked on the outside but still lightly pink inside, about 5 minutes. Roughly chop the chicken livers by hand and season with salt and cracked black pepper. Spoon the chopped liver onto matzo and top with minced egg and the reserved schmaltz fried onions."],"exactIngredients":["Reserved skin from 1 chicken, about 1 cup","1 onion, thinly sliced","1 pound chicken livers, trimmed and rinsed well","Kosher salt and freshly cracked black pepper","Matzo, broken into bite-sized shards","2 eggs, boiled and finely minced","This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],"baseIngredients":["chicken","egg","chef"]},{"title":"Raspberry Lime Terrine","totalTime":"29 min","prepTime":"15 min","inactiveTime":"4 min","cookTime":"10 min","level":"easy","directions":["In a saucepan, warm the water with the gelatin to dissolve it. Whisk in the lime juice and simple syrup. Taste for sweetness, and adjust if needed. Stir in the raspberries and pour into a loaf pan 8 1/2 by 4 1/2. Chill at least 4 hours. Dip in hot water for 10 seconds to loosen, then flip terrine out onto a serving platter. Keep chilled until ready to serve."],"exactIngredients":["1 cups water","4 1/2 teaspoons gelatin, sponged in cold water","1/2 cup lime juice","1/2 cup plus 2 tablespoons simple syrup (equal amounts of water and sugar, boiled and then cooled)","5 1/2 cups raspberries"],"baseIngredients":["gelatin","lime","raspberry"]},{"title":"Grilled Pain Perdu","totalTime":"30 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"10 min","level":"easy","directions":["In a medium bowl, whisk the eggs. Whisk in the sugar, salt, and vanilla. Gradually whisk in the half-and-half and the buttermilk. Pour the mixture into a shallow baking dish. Working in batches, if necessary, place the bread in the dish and let soak, then turn and soak on the other side.","Cook the soaked bread on a grill or buttered griddle until golden brown, then turn and repeat on the other side.","Meanwhile, prepare the grapefruit sections.","In a saute pan, add the maple syrup and bring to a boil. Place the grapefruit sections in the hot syrup and cook on 1 side for 30 seconds, then flip them over to cook and warm through on the other side. Pour the grapefruit and syrup over the French toast then top with dollops of mascarpone."],"exactIngredients":["3 eggs","1/2 cup granulated sugar","1 pinch salt","1/2 teaspoon pure vanilla extract","1 cup half-and-half","1 cup buttermilk","8 thick slices Brioche or bakery challah, or another soft yellow bread","1 pink grapefruit, sectioned","1/2 cup maple syrup","1/2 cup mascarpone"],"baseIngredients":["egg","vanilla","bread","grapefruit","maple syrup"]},{"title":"The Money Maker","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"","directions":["Combine 1/4 ounces pear-flavored vodka, 1/2 ounce green melon liqueur (preferably Midori) and the juice of 1/2 lemon in a cocktail shaker with ice. Shake, then strain into a chilled short glass. Garnish with a lime twist and a lemon wedge.","Photograph by Charles Masters"],"exactIngredients":[],"baseIngredients":[]},{"title":"Lavender Orangeade","totalTime":"15 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"5 min","level":"easy","directions":["Make 2 cups simple syrup, adding 1/4 cup dried lavender before heating. Let cool, then strain into an ice-filled pitcher. Stir in 2 cups each fresh orange juice and water, and strips of orange zest.","Simple Syrup: To make 2 cups simple syrup, bring 1 1/2cups each sugar and water to a boil, stirring until dissolved. Let cool.","Photograph by Jonathan Kantor"],"exactIngredients":[],"baseIngredients":[]},{"title":"Lemon Saffron Floats","totalTime":"1 hr 15 min","prepTime":"30 min","inactiveTime":-1,"cookTime":"45 min","level":"easy","directions":["Preheat the oven to 325 degrees F.","Bring the water, butter, lemon juice and saffron to a boil. Add all flour all at once and stir until the batter pulls away from the side of the saucepan. Transfer to a mixing bowl. Mix for 5 minutes, or until cool. Add the eggs, 1 at a time, making sure that each gets incorporated before you add the next. Add the lemon zest and adjust the seasoning with salt and pepper. Fill a piping bag fitted with a dime-size or large tip. Pipe on a baking sheet and place in oven. Cook until fully risen, about 10 to 12 minutes. Remove from the oven and serve alongside Chesapeake Bay Blue Crab Hot Pot."],"exactIngredients":["2 1/2 cups water","8 ounces butter","1 lemon, juiced","Pinch saffron threads","12 ounces all-purpose flour","10 whole eggs","1 lemon zest","Salt and pepper"],"baseIngredients":["lemon","saffron","egg"]},{"title":"Mai Kai Martini","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Combine the coconut water, pineapple juice, blue curacao, vodka, vermouth and lime wedge in a shaker. Shake for 1 minute. Serve cold. Repeat for additional servings.","This recipe was provided by a chef, restaurant or culinary professional and may have been scaled down from a bulk recipe. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],"exactIngredients":["2 ounces fresh coconut water or Malibu rum","2 ounces pineapple juice","1 ounce blue curacao","1 ounce vodka","A spritz dry vermouth","Lime wedge (shaken in the shaker, not squeezed)"],"baseIngredients":["coconut","pineapple","lime"]},{"title":"Pasta Tunisiano","totalTime":"30 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"20 min","level":"easy","directions":["Bring a large pot of heavily salted water to a boil. It should taste like sea water! Cook the pasta until al dente, 8 to 10 minutes.","Meanwhile, heat a large saute pan over medium heat. Add the olive oil and garlic. Sweat in the pan for 2 to 3 minutes. Add the harissa and cook for 2 more minutes. Add the tomato sauce and cook an 2 additional minutes. Remove the pasta from the pot and add to the saute pan. Add the mozzarella, Parmesan and basil and toss well. Taste for seasoning and serve.","This recipe was provided by a professional chef or restaurant and may have been scaled down from a bulk recipe. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],"exactIngredients":["Salt","1 pound rigatoni","1/4 cup extra-virgin olive oil","1 tablespoon chopped garlic","1/4 cup harissa","1/2 cup tomato sauce","1/4 pound fresh mozzarella, chopped","2 tablespoons grated Parmesan","6 fresh basil leaves, torn"],"baseIngredients":["mozzarella"]},{"title":"Fried Eggs over Warm Lentil Salad with Lardons","totalTime":"45 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"30 min","level":"easy","directions":["Cover lentils with cold water by 2 inches in a saucepan, then simmer, uncovered, until just tender, about 20 minutes. ","While lentils are simmering, cook bacon in a 12-inch nonstick skillet over moderate heat, stirring, until crisp, then transfer with a slotted spoon to paper towels to drain, leaving fat in skillet. Add leeks, celery, and carrot to skillet and cook, stirring, until just tender. Add vinegar and boil until most of liquid is evaporated. Remove skillet from heat and stir in tarragon, half of bacon, and salt and pepper, to taste. Transfer to a bowl and keep warm, covered, reserving skillet. ","Drain lentils well in a large sieve. Stir into vegetable mixture and season with salt and pepper. Keep warm, covered. ","Wipe skillet with paper towels, then add oil and heat over moderate heat until hot but not smoking. Fry eggs in batches until whites are just set but yolks are still runny and season with salt and pepper. ","Divide lentil salad among 4 plates. Top with spinach, eggs, and remaining bacon. ","Cook's Note: Serving eggs with runny, not fully-cooked, yolks may be of concern if salmonella is a problem in your area."],"exactIngredients":["3/4 cup lentils (preferably French green lentils)","6 ounces thick-cut bacon, cut crosswise into 1/4-inch-thick strips","2 leeks (white and pale green parts only), finely chopped","2 celery ribs, finely chopped","1 large carrot, finely chopped","2 tablespoons red wine vinegar, or to taste","1 tablespoon finely chopped fresh tarragon","Salt and freshly ground black pepper","1 tablespoon olive oil","8 large eggs","1 cup baby spinach leaves"],"baseIngredients":["lentils","bacon","celery","carrot","tarragon","egg","spinach"]},{"title":"Mesclun with Prosciutto Grissini","totalTime":"20 min","prepTime":"20 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Wrap each grissini in a piece of prosciutto, on a slight diagonal to cover as much of the breadstick as possible. Set aside.","In a medium bowl, mix the shallot, mustard, vinegar, salt, and pepper together. Gradually whisk in the oil in a slow stream. Place the mesclun greens and fennel in a large bowl and toss evenly with the dressing. Distribute among 4 serving plates and sprinkle with pine nuts.","Take 2 prepared grissini and place them on top of each salad forming an \"x\". Serve immediately.","Cook's Note: Grissini are pencil-thin breadsticks that can found at specialty and Italian food markets."],"exactIngredients":["8 grissini breadsticks","8 very thin slices prosciutto","2 teaspoons minced shallot","1 teaspoon Dijon mustard","1 tablespoon white balsamic vinegar","1/4 teaspoon salt","1/4 teaspoon freshly ground black pepper","1/3 cup canola oil or olive oil","5 ounces mesclun greens","1/2 cup thinly sliced fennel bulb","1/4 cup pine nuts, toasted"],"baseIngredients":["greens","fennel"]},{"title":"Pain Perdu","totalTime":"27 min","prepTime":"15 min","inactiveTime":"5 min","cookTime":"7 min","level":"easy","directions":["Beat the eggs, add the cream, salt, cinnamon and vanilla. Submerge the bread slices in the egg mixture for 5 minutes. Lay both sides of the bread in the almonds to coat. Heat the butter in a heavy pan until the foam subsides, then add the slices of bread. Cook over low flame until delicate brown. Sprinkle with powdered sugar, garnish with sliced fruit and serve hot."],"exactIngredients":["6 eggs","1 cup cream","1/4 teaspoon salt","1 tablespoon cinnamon","1 tablespoon vanilla extract","12 slices thick bread","2 cups coarsely ground almonds","2 tablespoons butter","Powdered sugar","Sliced seasonal fruit"],"baseIngredients":["egg","cream","vanilla","bread","fruit"]},{"title":"Tostados Toluquenas","totalTime":"2 hr 45 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"2 hr 30 min","level":"easy","directions":["Rinse the red beans and cover with the 8 cups of cold water and gently cook for 2 1/2 hours. Quarter the onions and place in mincer. Remove the sinew from the tenderloin and pass also through a mincer. Grate the cheese. Saute the tortillas in a little bit of oil until slightly crispy. Shred the lettuce, smash the clove of garlic. Finely slice the tomatoes. Saute and then simmer the tenderloin tips in the butter with the tomato paste, garlic, chili powder, red wine, and tomatoes. Add salt and pepper to taste. Simmer for about twenty minutes. Assemble the tortillas with the meat mixture, the beans, and top with the lettuce, onions, sour cream, pimentos, parsley, parmesan cheese and salt and pepper to taste."],"exactIngredients":["16 ounces red beans","8 cups cold water","Clarified butter","9 ounces onions","6 ounces tomato paste","1 garlic clove","10 ounces trimmed beef tenderloin tips","1 teaspoon chili powder","3 ounces red wine","6 ounce tomato","4 tablespoons parmesan cheese","4 tortillas","1 small lettuce","4 teaspoons sour cream","1 tin of pimento","vegetable oil","1 tablespoon fresh parsley","Salt","Black pepper","White pepper"],"baseIngredients":["beans","tomato","beef","chili","cheese","tortilla","lettuce","sour cream"]},{"title":"Cottelet di Pollo","totalTime":"1 hr 45 min","prepTime":"45 min","inactiveTime":-1,"cookTime":"1 hr","level":"","directions":["Make tomato sauce. Place clarified butter into a frypan and add the carrots, onion and garlic. Allow the vegetables to fry 2 minutes. Add the tomato paste and allow to cook until the tomato paste has deepened in color. Add the tomatoes, sugar and white wine. Season with salt, pepper and basil. Bring to a vigorous boil and allow to cook for 10 minutes. Strain through a fine sieve. Deglaze pan with a little white wine and add this to the strained sauce. Flatten chicken breasts and season with salt and pepper. Coat with Parmesan cheese and then paint with the egg and olive oil mixture. Place into the bread crumbs and coat both sides. Place enough olive oil into a large frypan to coat surface and add the chicken breasts. Cook 3 minutes on each side. Add the mushrooms, season with salt and pepper and add the lemon juice. Pour half the tomato sauce around the chicken and cover the breasts with the cheese slices. Cover the pan and allow the cheese to melt. When the cheese has melted scatter the finely chopped parsley over the chicken. Remove the chicken breasts to a serving dish. Add a little more tomato sauce to the pan, deglaze and then spoon the mushrooms and the sauce around the chicken."],"exactIngredients":["Clarified butter","2 medium carrots, roughly chopped","1 cup onion, finely sliced","1 clove garlic, crushed","2 tablespoons tomato paste","2 pounds ripe tomatoes, roughly chopped","1 tablespoon sugar","1/2 cup dry white wine, and a little extra for deglazing","Salt and pepper","1 teaspoon dried basil","2 large capon chicken breasts","2 tablespoons freshly grated Parmesan cheese","1 beaten egg mixed with 1 tablespoon olive oil","1/2 cup bread crumbs","Olive oil to coat surface of large frypan to cook chicken breasts","4 ounces mushrooms, stalks removed and halved","1/4 lemon, juiced","4 slices Munster cheese","2 tablespoons finely chopped parsley"],"baseIngredients":["carrot","tomato","chicken","cheese","egg","bread","mushroom","lemon"]},{"title":"Bonus Waffle Recipe: French-Toasted Waffles","totalTime":"15 min","prepTime":"5 min","inactiveTime":-1,"cookTime":"10 min","level":"easy","directions":["Lightly toast the waffles. Mix egg substitute, vanilla extract, and cinnamon in a bowl, and set aside.","Bring a large skillet sprayed with nonstick spray to medium-high heat on the stove. Add butter and allow it to coat the bottom of the skillet. Meanwhile, coat the waffles thoroughly in the egg mixture.","Cook the waffles in the skillet until golden brown, 4 to 5 minutes per side. Top them with syrup and powdered sugar. Serve with raspberries, if you like, and enjoy!","PER SERVING (entire recipe): 274 calories, 6g fat, 807mg sodium, 41.5g carbs, 3.25g fiber, 6.5g sugars, 16g protein"],"exactIngredients":["2 frozen low-fat waffles","1/2 cup fat-free liquid egg substitute","1/2 teaspoon vanilla extract","1/4 teaspoon cinnamon","2 teaspoons light whipped butter or light buttery spread","14 cup sugar-free pancake syrup","1 teaspoon powdered sugar","Serving suggestion: raspberries"],"baseIngredients":["waffle","egg","vanilla","pancake","raspberry"]},{"title":"Morwong Cru","totalTime":"12 hr","prepTime":"12 hr","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Place fish, onion and lemon juice in a bowl. Cover with a cloth and place in the refrigerator for 12 hours. When 'cooked' strain off lemon juice and stir in chopped vegetables. Serve this mixture chilled with coconut mayonnaise dressing in a separate bowl."],"exactIngredients":["1 1/2 pounds haddock or bream fillets, cut into 1/2-inch cubes.","2 small onions, finely sliced.","Juice of 6 lemons","4 ounces cucumber, finely diced","4 ounces carrot, finely diced","4 ounces celery, finely diced"],"baseIngredients":["fillet","lemon","cucumber","carrot","celery"]},{"title":"Squash Soup with Pumpernickel Witches and Spicy Blood Droplets (Spicy Roasted Squash Soup with Pumpernickel Toast)","totalTime":"1 hr 40 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"1 hr 25 min","level":"easy","directions":["Make the Witch Croutons: Preheat oven to 400 degrees F. ","Trim and discard crusts from bread. Spread 1 side of each slice evenly with butter and season with salt and pepper. Cut into witch shapes with cookie cutter and arrange, buttered side-up, on a baking sheet. Toast bread, turning once, in middle of oven until golden brown, about 4 minutes. Transfer the croutons to a rack to cool. ","Make the Soup: Put squash, cut side-down, in a greased shallow baking pan and roast in the oven until very tender, about 1 1/4 hours. Cool and scoop out flesh. ","Puree squash in batches in a blender with jalapeno, cumin, and broth until very smooth (add water, as needed, to facilitate pureeing). Transfer to a 6 to 8-quart heavy pot and stir in the 5 cups of water. Simmer, stirring, for 10 minutes, then stir in lemon juice, enough water to thin to desired consistency, and salt and pepper, to taste. ","Divide soup among bowls, top with a witch crouton, and drizzle drops of hot sauce around the sides. ","Cooks' notes: Toasts may be made 2 days ahead, cooled completely, and kept between layers of paper towels or waxed paper in an airtight container, at room temperature. The squash puree may be made 2 days ahead. Cool completely; then chill, covered. "],"exactIngredients":["Witch Croutons:","15 slices pumpernickel bread","1/2 stick unsalted butter (1/4 cup), softened","Soup:","1 (12-pound) butternut squash, halved lengthwise and seeded","1 1/2 tablespoons chopped fresh jalapeno chile, including seeds","1 teaspoon ground cumin","7 cups chicken broth or water","5 cups water, plus additional for thinning","1 tablespoon fresh lemon juice, or to taste","Hot Sauce, as needed","Special Equipment: Witch-shaped cookie cutter"],"baseIngredients":["bread","squash","jalapeno","chicken","lemon","hot sauce","cookie"]},{"title":"Vanilla Bean Ice Cream","totalTime":"25 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"10 min","level":"easy","directions":["With a knife halve vanilla beans lengthwise. Scrape seeds into a large heavy saucepan and stir in pods, cream, milk, and sugar. Bring mixture just to a boil, stirring occasionally, and remove pan from heat. ","In a large bowl lightly beat eggs. Add hot cream mixture to eggs in a slow stream, whisking, and pour into pan. Cook custard over moderately low heat, stirring constantly, until the custard thickly coats the back of a spoon, or until a thermometer registers 170 degrees F. (Do not let boil.) Pour custard through a sieve into a clean bowl. Place the bowl in a large bowl of ice water and let the custard chill, stirring occasionally. ","Freeze custard in an ice-cream maker, in 2 batches if necessary. Transfer ice cream to an airtight container and put in freezer to harden. Ice cream may be made 1 week ahead.","Variation 1: To make chocolate ice cream, put 1/2 pound of finely chopped bittersweet chocolate in a large bowl, and pour the hot thickened custard over the top. Let sit for 1 minute, and stir until smooth. Chill and freeze as above. ","Variation 2: To make strawberry ice cream, hull and slice 1 pound (1 1/4 pints) fresh strawberries, puree in a food processor. Transfer the puree to a bowl, stir in 1/2 cup sugar and 1 tablespoon lemon juice, and chill. Add the puree to the chilled custard and freeze as above. "],"exactIngredients":["2 vanilla beans","3 cups heavy cream","1 cup whole milk","1 1/2 cups sugar","3 large eggs"],"baseIngredients":["beans","cream","milk","egg"]},{"title":"Fennel and Leek Bruschetta with Cheese and Beer Fondue","totalTime":"45 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"30 min","level":"easy","directions":["Preheat the oven to 375 degrees F. ","Brush some oil on the bread slices and arrange them on a sheet pan. Bake until golden brown, about 8 minutes. Remove the bread from the oven and set aside.","Melt 1 1/2 tablespoons of butter in a medium saucepan over medium heat. Whisk in the flour and cook, whisking, for 1 minute. Pour in 3/4 cup of the beer and simmer, whisking constantly, for 1 minute. Remove the saucepan from heat and add the cheeses, whisking until smooth. ","In a large saute pan over medium heat, melt the remaining butter and add the fennel, leeks and chives. Saute until tender, and then stir in the remaining beer. Cook, stirring over medium heat, until all the onions are caramelized and the beer is mostly cooked off, about 15 to 20 minutes. ","Spread the cheese fondue on the toasted bread. Put some of the fennel and leek mixture on top and arrange them on a serving platter. Sprinkle with fresh chives and serve."],"exactIngredients":["Olive oil, for brushing bread","16 (1/2-inch thick) slices baguette, from 1 baguette","3 1/2 tablespoons salted butter, divided","1 1/2 tablespoons all-purpose flour","1 (12-ounce) bottle beer (recommended: Miller Genuine Draft 64)","6 ounces sharp English Cheddar, grated","3 ounces mild Brie cheese, rind discarded","1 fennel bulb, sliced","1 medium leek, sliced","1 tablespoon chopped chives, plus more for garnish"],"baseIngredients":["bread","cheddar","cheese","fennel","chives"]},{"title":"Long Stem Strawberry Stuffed with Purple Haze Goat Cheese","totalTime":"15 min","prepTime":"15 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Whip heavy cream into goat cheese until mixture is smooth and creamy. ","Prepare strawberries by picking leaves off of the stem and cutting them in half. Use a melon baller to scoop out a hole in the strawberry. ","Using a pastry bag and tip, pipe goat cheese filling into the strawberry. Garnish with mint leaves.","Preheat oven to 350 degrees F.","Cut brioche into cracker size pieces. Brush with olive oil and season with salt and pepper. Toast in oven until hard like a cracker. When cooled, pipe just a little goat cheese on the cracker and top with a filled strawberry."],"exactIngredients":["2 tablespoons heavy cream","1/2 pound goat cheese (recommended: Purple Haze)","5 long stem strawberries","10 fresh mint leaves","1/4 pound fresh brioche","Olive oil, for brushing","Salt","Freshly ground black pepper"],"baseIngredients":["cream","cheese","strawberry"]},{"title":"Fresh Cherries with Semolina Toast and Rhododendron Honey","totalTime":"20 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"5 min","level":"easy","directions":["In a medium bowl, gently toss the cherries with the honey, vinegar, and crushed lemon verbena. Season lightly with salt and pepper and set aside to macerate for 30 minutes.","Generously brush each slice of bread with the olive oil. Heat a large saute pan over medium heat. Add the bread slices and toast, turning once, until crisp. ","Divide the toast among 4 plates. Drain the cherries and reserve the juice. Top the toast with the cherries and drizzle with the reserved juice. Garnish each plate with lemon verbena."],"exactIngredients":["1 pint very ripe dark cherries, split in 1/2 and pitted","1 pint very ripe white cherries (Rainier), split in 1/2 and pitted","2 tablespoons rhododendron honey","1 tablespoon white balsamic vinegar","6 sprigs lemon verbena, 2 crushed and 4 for garnish","Salt and pepper, to taste","4 (1-inch thick) slices semolina bread (cut from a 2-pound loaf)","2 tablespoons extra-virgin olive oil"],"baseIngredients":["cherry","honey","lemon","bread"]},{"title":"Lamb Chops on Spiced Tomatoes and Onions","totalTime":"30 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["In a small bowl, combine the cumin, cardamom, salt, and pepper. ","In 1 large non-stick skillet, working in batches, heat 2 tablespoons of the oil in each pan over moderately high heat until it is hot but not smoking. Add half the onions and half the tomatoes in one layer to each pan, and cook for 3 minutes. ","Turn the vegetables over, sprinkle them with the spice mixture, and cook until they are just tender, about 3 minutes more. Divide the vegetables between 4 heated plates, placing 2 slices of each vegetable per plate.","To each skillet, add 1 tablespoon oil per pan. Pat the lamb chops dry, season with salt and pepper, and saute, 4 in each pan, over moderately high heat, for 5 minutes on each side, for medium-rare, and arrange them on top of the vegetables."],"exactIngredients":["1/2 teaspoon ground cumin","1/2 teaspoon ground cardamom","1 teaspoon salt","1 teaspoon freshly ground pepper","4 tablespoons olive oil, plus 2 tablespoons","2 large onions, cut into 8 (1/4-inch) slices","2 to 3 medium tomatoes, cut into 8 (1/2-inch) slices","8 (3/4-inch thick) rib lamb chops"],"baseIngredients":["tomato","lamb"]},{"title":"Zinfandel Mop","totalTime":"25 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["Combine all ingredients in a medium saucepan and simmer uncovered until slightly thickened, about 15 minutes. Use the mop to baste baby back ribs during grilling."],"exactIngredients":["1/2 bottle your favorite zinfandel wine (recommended: Ravenswood Zinfandel)","1 cup sparkling apple cider","1/8 cup olive oil","1/8 cup dark corn syrup (recommended: Karo Syrup)","1 1/2 tablespoons kosher salt","1 tablespoon molasses","1/2 tablespoon garlic powder","1/4 teaspoon ground nutmeg","1/4 teaspoon ground cloves","1/8 teaspoon ground cinnamon","1 bay leaf"],"baseIngredients":["apple","corn","molasses"]},{"title":"Deforest Gibbs Barbecue Sauce","totalTime":"35 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["Using a medium-size skillet, begin by heating the mustard. Add the brown sugar, sugar, hot sauce, vinegar, peppers, Worcestershire sauce, ketchup, and tequila. Mix all of the ingredients well and heat but do not bring to a boil. Once the sauce is well mixed, serve with you favorite meats or store, refrigerated, in an airtight container."],"exactIngredients":["4 ounces yellow mustard","1 ounce brown sugar","1 ounce sugar","1 ounce hot sauce","1 ounce balsamic vinegar","2 ounces seeded and diced hot peppers","1 tablespoon Worcestershire sauce","2 ounces ketchup","1 ounce tequila"],"baseIngredients":["hot sauce","ketchup"]},{"title":"Crispy Fried Kellogg's® Crispix® Ham with Black Bean Puree and Pickled Jalapenos","totalTime":"45 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"25 min","level":"easy","directions":["Combine the vinegars, coriander, bay leaf, salt and sugar in a saucepot and bring to a boil. Remove from the heat and add the jalapenos. Set aside and cool. (The jalapenos will hold in the refrigerator for up to 2 weeks.)","Combine the black beans, onions, garlic, chicken stock and cumin in a saucepot over medium-high heat and simmer, 10 to 15 minutes.","While the beans are cooking, move onto the Canadian bacon. First dip the Canadian bacon into the flour and shake off any excess. Dip into the egg and follow with the Crispix cereal. In a saute pan, heat the oil over medium-high heat. Working in batches, pan fry the Canadian bacon until golden brown and crispy. Drain on a paper towel and season with salt.","Once the beans are done cooking, puree until smooth in a blender.","To serve, put a spoonful of the bean puree on a plate, follow with fried Canadian bacon and top with the pickled jalapenos."],"exactIngredients":["1 cup white vinegar","1/2 cup red wine vinegar","1 tablespoon coriander seeds","1 bay leaf","2 tablespoons kosher salt","Pinch sugar","4 jalapenos, sliced","1 (15-ounce) can black beans, drained and rinsed","1/2 onion, minced","1 clove garlic, minced","1 cup chicken stock","1 tablespoon ground cumin","1/2 pound sliced Canadian bacon, cut into quarters","1/2 cup all-purpose flour","1 egg, beaten","1 cup Crispix, crushed","1/2 cup blended oil","Salt"],"baseIngredients":["black beans","chicken","bacon","egg"]},{"title":"Pucker Up, Yvonne!","totalTime":"40 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"20 min","level":"easy","directions":["For the lemon curd: Fill a saucepan just over one-quarter full with water and bring to a simmer over medium-low heat. In heatproof bowl that fits over the saucepan, combine the lemon juice and cornstarch and whisk well to combine. Place the bowl on top of the saucepan and add the butter and sugar. Whisk constantly until the sugar is dissolved, and then add the eggs slowly, a bit at a time, continuing to whisk until the mixture thickens. Remove from the heat and stir in the lemon zest. Let cool, and then place in the fridge to chill and firm up.","For the raspberry sauce: Combine the prosecco, sugar and raspberries in a large saucepan and bring to a simmer over medium heat. Stir to mash up the berries a bit. Simmer until the liquid is reduced and syrupy, 5 to 10 minutes. Set aside.","For the puff pastry: Preheat the oven according to package instructions. Unfold the puff pastry on a lightly floured surface. Cut the pastry into 16 squares or cut 16 rounds using a cookie cutter. Place the pastry on a baking sheet and brush each with the egg wash. Bake according to package instructions.","For the whipped cream: Whip the heavy cream with the limoncello, sugar and lemon zest.","To serve, place 2 pastry pieces on a plate and top with lemon curd, raspberry sauce and whipped cream. You will have some leftover lemon curd.","This recipe was created by a contestant during a cooking competition. The Food Network Kitchens have not tested it for home use, therefore, we cannot make any representation as to the results."],"exactIngredients":["Lemon Curd:","1 cup freshly squeezed lemon juice","2 tablespoons cornstarch","1/2 stick unsalted butter, melted","1/4 cup granulated sugar","4 egg yolks plus 2 whole eggs, beaten","1 tablespoon lemon zest","Raspberry Sauce:","1 cup prosecco","1/2 cup sugar","2 pints fresh raspberries","Puff Pastry:","1 sheet frozen puff pastry, thawed according to package instructions","All-purpose flour, for dusting","1 to 2 eggs, beaten with a little water","Whipped Cream:","1/2 pint heavy cream","1 teaspoon limoncello liqueur","1 teaspoon sugar","1/2 teaspoon lemon zest"],"baseIngredients":["lemon","egg","raspberry","whipped cream","cream"]},{"title":"Escaped Birds","totalTime":"40 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"20 min","level":"easy","directions":["Heat the milk in a small sauce pot over medium heat, then add salt and a little bit of nutmeg, to taste. In another pot melt the butter and add the flour. Stir it gently and as soon as you see some flour foaming pour the mixture into the hot milk. Lower the heat and keep stirring until it becomes creamy. Remove from the heat and set aside.","In a heavy-bottomed pan over medium heat, add the oil. When the oil is hot, add the onion and fry for 3 minutes, then add the pork and fry until it's partly cooked, approximately 5 to 6 minutes. Remove the onion and pork from the pan to a plate and set aside to cool. Set up 3 dredging bowls. Mix the bread crumbs and the Parmesan in 1 bowl, add the cold bechamel in another bowl, and the eggs beaten with salt and pepper, to taste, in the third bowl.","Using toothpicks spear a cube of pork, a cube of cheese and a piece of mortadella or ham onto each toothpick. Roll the skewers first in the bread crumb mixture, then in the cold bechamel (with the help of a spoon), then in the beaten egg and finally coat again in the bread crumb mixture. Gently press the breading by hand to adhere the mixture. Reheat the oil and add the skewers (avoid turning too often, or the breading will break off). Once they become golden, about 5 minutes, gently remove them from the oil to paper towels to drain. Transfer the \"birds\" to a serving platter and serve.","A viewer, who may not be a professional cook, provided this recipe. The Food Network Kitchens chefs cannot make representation as to the results."],"exactIngredients":["Bechamel:","2 cups milk","Salt","Freshly ground nutmeg","2 ounces butter","1/4 cup all-purpose flour","1/2 onion, chopped","2 cups corn oil","21 ounces pork tenderloin, diced into 1-inch pieces","2 cups bechamel","3 eggs","Salt and freshly ground black pepper","2 cups plain bread crumbs","1 cup grated Parmesan","7 ounces Swiss cheese, cut into 1/2-inch cubes","6 ounces mortadella or ham, diced into 1-inch pieces"],"baseIngredients":["milk","corn","pork","egg","bread","cheese","ham"]},{"title":"Sizzling Garlic Shrimp","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Poached Fillet of Trout","totalTime":"1 hr 10 min","prepTime":"45 min","inactiveTime":"5 min","cookTime":"20 min","level":"easy","directions":["Preheat the oven to 400 degrees F.","To make the couscous: Bring the stock to a boil in a saucepan over high heat. Add a pinch of salt and the couscous. Stir the couscous and return to boil for 1 minute. Remove the pot from the heat, cover let stand for 5 minutes, then fluff the couscous with a fork. Mix in the diced vegetables, egg and herbs. Season the couscous with salt and lemon and allow to cool.","To prepare the trout: Season the trout on both sides with salt and pepper. Lay fish skin side down. Spoon about 1/4 of the couscous onto the large end of each fillet. Fold the tails over (to make a tidy packet) and secure with toothpicks. ","Melt the butter in a large ovenproof skillet over medium heat. Add the shallots and cook until they are soft, about 7 minutes. Add the trout, wine, lemon juice, and saffron. Season the shrimp with salt and pepper and lay them on the trout bundles. Add the herb sprigs, cover the pan and put it in the oven. Cook until the trout is flaky and the shrimp are opaque, about 5 minutes. Transfer the trout and shrimp to serving plates.","To make the sauce: return the poaching liquid to a burner and simmer over high heat. Remove the herb sprigs and add the cream. Reduce the sauce until it coats the back of a spoon, about 3 minutes. ","Spoon sauce onto each of the plates. Garnish with dill, lemon, and chopped parsley and serve."],"exactIngredients":["Couscous:","1 1/4 cups fish or chicken stock","Kosher salt","1 cup couscous","1 cup diced, blanched mixed vegetables such as carrots, celery, zucchini, scallions, yellows squash, and red pepper","1 egg","1/4 cup mixed chopped tarragon, dill and parsley leaves","Lemon juice, to taste","Stuffed trout:","4 trout fillets","Kosher salt and freshly ground black pepper","3 tablespoons butter","1/4 cup diced shallots","1 cup dry white wine","1 tablespoon lemon juice","Pinch saffron, crumbled","8 shrimp, peeled and deveined","1 sprig tarragon","1 sprig dill","2 sprigs parsley","Cream Sauce:","1/2 cup heavy cream","Kosher salt and freshly ground black pepper","4 fresh dill sprigs","4 lemon twists","Chopped parsley, for garnish"],"baseIngredients":["chicken","red pepper","egg","dill","lemon","fillet","shallots","saffron","shrimp","tarragon","cream"]},{"title":"Idaho Rainbow Trout and Prawn Napoleon With Lemon-Shallot Beurre Blanc Sauce","totalTime":"1 hr 30 min","prepTime":"45 min","inactiveTime":-1,"cookTime":"45 min","level":"easy","directions":["Preheat oven to 250 degrees F.","Season trout fillets and prawns with salt, garlic, and lemon pepper. Heat 2 tablespoons olive oil in a large saute pan over medium-high heat and then place trout fillets, skin-side down. Saute fish for 1 minute, turn, and cook for 1 more minute, or until fish is just cooked through. Add 1/2 cup chardonnay to the pan and hold in a warm oven until ready to serve. In another saute pan, heat remaining 2 tablespoons olive oil, add shrimp, and cook for 1 to 2 minutes on each side. Add the remaining 1/2 cup chardonnay to the pan and hold in warm oven. ","In the middle of each entree plate, place 1/3 cup hot mashed potatoes. Place 2 spears of asparagus on top of the potatoes. Place 1 portion of cooked trout on top of the asparagus, and then place 1/3 cup additional mashed potatoes on trout. Place 1 tablespoon of cooked spinach on the potatoes and top with 2 prawns. Drizzle each plate with a little Lemon-Shallot Beurre Blanc Sauce, and garnish each plate with 3 gaufrette chips.","8 large Idaho potatoes, peeled and cut into 1-inch pieces","2 teaspoons salt","6 tablespoons unsalted butter, melted","1 cup heavy cream","1/4 teaspoon freshly ground white pepper","Place potatoes in a medium saucepan and cover the potatoes with water by 1-inch. Add 1 teaspoon salt and bring to a boil. Reduce the heat, and simmer until the potatoes are ","fork tender, about 12 to 15 minutes. Drain into a colander. In a mixing bowl, mash potatoes until no lumps remain, and then add butter. Next add cream, remaining 1 teaspoon salt, and pepper. Cover and keep warm until ready to serve.","Yield: about 6 cups","Lemon-Shallot Beurre Blanc Sauce: ","1/4 cup Champagne vinegar","1 cup chardonnay wine","2 tablespoons minced shallots","3 tablespoons heavy cream","1/2 pound unsalted butter","1 tablespoon lemon juice","1/2 teaspoon kosher salt","1/4 teaspoon white pepper","In a small heavy saucepan, boil the Champagne vinegar and chardonnay with the shallots over high heat until only 1 tablespoon of liquid remains. Add heavy cream and cook for 1 minute. Remove from heat and add butter, 1 tablespoon at a time, whisking after each addition until melted before adding more. When all the butter has been incorporated, whisk in the lemon juice, kosher salt, and white pepper. Hold the sauce in a warm spot but not over direct heat.","Vegetable oil, for deep frying","1 medium Idaho potato, peeled ","Salt","Heat oil in a deep fryer to 350 degrees F. Alternatively, fill a large, deep, heavy pot halfway with oil and heat to 350 degrees F. Using a mandoline, make very thin, cross-cut potato slices. Fry until golden brown. Remove to a paper towel-lined plate to drain and salt lightly.","Yield: about 24 chips"],"exactIngredients":["8 (4-ounce) rainbow trout fillets","16 (size U-15) prawns, peeled and de-veined","1 tablespoon kosher salt","1 tablespoon granulated garlic","1 tablespoon lemon pepper","4 tablespoons olive oil","1 cup chardonnay wine","6 cups Idaho Mashed Potatoes, recipe follows","16 asparagus spears, cooked and kept warm","1/2 cup cooked spinach, kept warm","Lemon-Shallot Beurre Blanc Sauce, recipe follows","24 Idaho Potato Gaufrette Chips, recipe follows"],"baseIngredients":["fillet","lemon","mashed potatoes","asparagus","spinach","chips"]},{"title":"Mincemeat Stuffed Chiles: Otros Chiles en Frio","totalTime":"1 hr 50 min","prepTime":"50 min","inactiveTime":"30 min","cookTime":"30 min","level":"easy","directions":["Simmer the almonds in 2 cups water for 2 minutes in a 1-quart saucepan. Drain and cool. Remove the peels by gently rubbing the almonds between your fingers. Alternatively, you can substitute 1/4 cup already blanched and peeled whole almonds.","Coarsely chop almonds and raisins in a food processor and set aside. Heat the oil in a 12-inch skillet over a medium flame. Saute the garlic and onions until the onions become translucent. Add the ground pork and beef and continue sauteing until the meat mixture is browned. Add the pureed tomato and cloves and saute about 1 minute. Add the remaining ingredients, including the ground almonds and raisins. Continue cooking until all the moisture has been reduced. Set the mincemeat aside to cool. Fill each chile with 2 tablespoons of mincemeat stuffing. Arrange the chiles on a bed of lettuce either on individual plates or a large platter. Spoon dressing over the chiles, making sure that each one is thoroughly covered. Serve immediately.","1 cup whole almonds","3 cups water","2 tablespoons nonpareil capers","3/4 cup virgin olive oil","1/3 cup white wine or pineapple vinegar","1 teaspoon salt","Simmer the almonds in 3 cups water for 2 minutes in a 2-quart saucepan. Drain and cool. Remove the peels by gently rubbing the almonds between your fingers. Alternatively, you can substitute 1/4 cup already blanched and peeled whole almonds.","Place almonds and capers in a food processor and grind to a fine paste. Slowly add oil and process until mixture attains a pesto-like consistency. Pour into a mixing bowl and briskly stir in the wine or vinegar and salt. Spoon dressing over the chiles, making sure that each one is thoroughly covered."],"exactIngredients":["1/4 cup whole almonds","1/4 cup raisins","2 tablespoons olive oil","2 garlic cloves, finely minced","1 tablespoon minced white onion","1/2 pound ground lean pork tenderloin","1/2 pound ground sirloin","1 cup roasted, peeled, and pureed tomatoes","1/4 teaspoon ground cloves","1 teaspoon salt","1 candied citrus peel, chopped","1/2 teaspoon brown sugar","1/4 teaspoon ground white pepper","12 large poblano chiles, roasted, sweated, and peeled","Almond-Caper Dressing, recipe follows"],"baseIngredients":["raisin","pork","tomato","citrus"]},{"title":"Spicy Cherry Token Cookies","totalTime":"4 hr 12 min","prepTime":"30 min","inactiveTime":"3 hr 30 min","cookTime":"12 min","level":"easy","directions":["For the cookies: Cream the butter, lemon zest, and sugars until light and fluffy. Slowly add the egg and lemon juice. Add the cherries. In another bowl, mix together the flours, baking soda, chile powder, and salt. Add to the butter mixture. Roll in parchment paper to a diameter of 3/4-inch. Chill well (or freeze).","Preheat the oven to 350 degrees F. Line a baking sheet with parchment paper.","When the batter is chilled, slice into 1/4-inch coins. Bake on prepared baking sheet until light golden brown, 12 minutes. Cool slightly.","For the glaze: Mix the powdered sugar and lemon juice thoroughly.","Drizzle the lemon glaze over the cookies while still warm.","This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],"exactIngredients":["Cookies:","4 ounces butter","1 lemon, zested","1/2 cup granulated sugar","1/2 cup brown sugar","1 egg","1 teaspoon lemon juice","1/4 cup dried tart cherries, finely chopped","1 3/4 cup flour","1/2 cup almond flour","1/2 teaspoon baking soda","1 1/2 teaspoons chile powder","1/2 teaspoon salt","Lemon Glaze:","2 cups powdered sugar","1 tablespoon lemon juice"],"baseIngredients":["cookie","lemon","egg","cherry"]},{"title":"Spicy Cherry Token Cookies","totalTime":"4 hr 12 min","prepTime":"30 min","inactiveTime":"3 hr 30 min","cookTime":"12 min","level":"easy","directions":["For the cookies: Cream the butter, lemon zest, and sugars until light and fluffy. Slowly add the egg and lemon juice. Add the cherries. In another bowl, mix together the flours, baking soda, chile powder, and salt. Add to the butter mixture. Roll in parchment paper to a diameter of 3/4-inch. Chill well (or freeze).","Preheat the oven to 350 degrees F. Line a baking sheet with parchment paper.","When the batter is chilled, slice into 1/4-inch coins. Bake on prepared baking sheet until light golden brown, 12 minutes. Cool slightly.","For the glaze: Mix the powdered sugar and lemon juice thoroughly.","Drizzle the lemon glaze over the cookies while still warm.","This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],"exactIngredients":["Cookies:","4 ounces butter","1 lemon, zested","1/2 cup granulated sugar","1/2 cup brown sugar","1 egg","1 teaspoon lemon juice","1/4 cup dried tart cherries, finely chopped","1 3/4 cup flour","1/2 cup almond flour","1/2 teaspoon baking soda","1 1/2 teaspoons chile powder","1/2 teaspoon salt","Lemon Glaze:","2 cups powdered sugar","1 tablespoon lemon juice"],"baseIngredients":["cookie","lemon","egg","cherry"]},{"title":"Green Tea Rocket","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Combine the orange liqueur, vodka, green tea bag, bitters and orange zest in a large mug. Add the hot water and steep for 3 minutes. Heat a cocktail glass by placing under hot running water. Stir the cocktail and strain into the glass; serve hot.","Photograph by Yunhee Kim"],"exactIngredients":["1 1/2 ounces orange liqueur","1/2 ounce vanilla vodka","1 bag green tea","2 dashes orange bitters","1/2 teaspoon grated orange zest","6 ounces hot water"],"baseIngredients":["orange","vanilla","green tea"]},{"title":"Clarissa's Clam Chowder","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Watercress, Chayote, Papaya, and Avocado Salad","totalTime":"15 min","prepTime":"15 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Place some the dressing in a large bowl and gently toss the watercress with the dressing, lightly shaking off excess. Remove to a serving disshToss the chayote with some dressing and add on top of the watercress. Repeat this process with the papaya, and then the avocado, tossing them in the remaining dressing. Season with salt and pepper and top with fried plaintain slivers.","2 tablespoons finely chopped shallots","3 tablespoons lime juice","2 tablespoons orange juice","4 tablespoons sherry vinegar","1 teaspoon honey","1/4 cup olive oil","1 teaspoon freshly grated nutmeg ","Salt and pepper","In a glass jar with a tight-fitting lid, add all the ingredients and shake vigorously to blend. Refrigerate until ready to use."],"exactIngredients":["Tropical Dressing, recipe follows","1 bunch watercress, cleaned","2 chayotes, cooked and diced into 1-inch cubes","1 cup ripe papaya, diced into 1/2-inch cubes","1 cup ripe avocado into 1/2-inch cubes","Salt and pepper","1/2 cup deep-fried green plantain slivers, for garnish"],"baseIngredients":["watercress","papaya","avocado"]},{"title":"Open Faced Raspberry Cream Sandwich","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Spread cream cheese on each of 4 pound cake slices. Spread raspberry jam over cream cheese. Serve immediately."],"exactIngredients":["2 ounces cream cheese","4 (3/4-inch thick) slices pound cake","2 ounces seedless raspberry jam"],"baseIngredients":["cream cheese","cake","jam"]},{"title":"Kellogg's® Cocoa Krispies® Cheese Cookies and Tomato Soup","totalTime":"45 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"25 min","level":"easy","directions":["Preheat the oven to 375 degrees F.","In a food processor, pulse the cheeses and butter into small pieces. Pulse in the flour until it resembles coarse sand, then turn into a large bowl. Add cream, if necessary, until the dough forms a solid ball when pressed together.","In a food processor, pulse the hazelnuts and 1 cup Cocoa Krispies until fine. Roll the dough out on a floured surface to 1/2-inch thick and evenly press the Cocoa Krispies-hazelnut mixture onto the dough. Cut the dough into 24 pieces and bake on a buttered baking pan until golden brown, about 15 minutes.","While the cookies are baking, start the tomato soup. Heat the olive oil in a large saucepan and cook the shallot and garlic until soft but not brown. Add the tomatoes and cook over medium heat for about 10 minutes. Add the wine and stock and simmer 7 minutes more. Add the remaining 1 cup Cocoa Krispies and cook for another 3 minutes. Puree the soup in a blender until smooth and season with salt and pepper.","Serve the tomato soup with the cookies on the side for dipping."],"exactIngredients":["1/4 pound Parmigiano-Reggiano, cubed","1/4 pound Asiago, cubed","1/4 pound Cheddar, cubed","1 stick butter, cut into pieces","1 1/2 cups flour","1 to 2 tablespoons heavy cream","1/2 cup hazelnuts","2 cups Cocoa Krispies","2 tablespoons olive oil","1 shallot, minced","2 cloves garlic, minced","1 (24-ounce) can diced tomatoes","3/4 cup white wine","1 cup chicken stock","Salt and freshly ground black pepper"],"baseIngredients":["cheddar","cream","hazelnut","tomato","chicken"]},{"title":"Thermos Spicy Baked Beans","totalTime":"4 hr 25 min","prepTime":"15 min","inactiveTime":-1,"cookTime":"4 hr 10 min","level":"easy","directions":["Add the oil to the Cook and Carry system inner cooking pot over medium-high heat and fry the onion for 3 minutes.","Add the garlic, ginger and cayenne, and cook for just 30 seconds, stirring, to release the volatile oils.","Stir in the carrots and apples until they are well coated with spices. Add the rest of the ingredients, stir thoroughly and bring to a full boil. Place the inner cooking pot into the insulated transport container and allow to cook for 4 hours."],"exactIngredients":["1 teaspoon olive oil","2 1/2 cups chopped onions","2 garlic cloves, peeled and finely chopped","2 tablespoons freshly grated ginger","1 teaspoon cayenne pepper","2 cups carrots, peeled and finely sliced","2 cups apples, peeled, cored and sliced","1/2 cup tomato paste","1/2 cup Dijon mustard","2 tablespoons Worcestershire sauce","1/2 cup molasses","2 tablespoons balsamic vinegar","1 (15-ounce) can tomato sauce plus 1 can water","1/2 cup raisins","1 whole dried chile pepper","1 bay leaf","2 pounds dried pinto beans, cooked according to package directions"],"baseIngredients":["carrot","apple","tomato","molasses","raisin","beans"]},{"title":"Ghostly Panna Cottas with Ghastly Sauce (Panna Cotta with Cranberry-Orange Sauce)","totalTime":"4 hr 35 min","prepTime":"15 min","inactiveTime":"4 hr","cookTime":"20 min","level":"easy","directions":["Make the Panna Cotta: In a very small saucepan sprinkle gelatin over water and let stand about 1 minute to soften. Heat gelatin mixture over low heat until gelatin is dissolved and remove pan from heat. ","In a large saucepan bring cream, half-and-half, and sugar just to a boil over moderately high heat, stirring. Remove pan from heat and stir in gelatin mixture and vanilla. Divide cream mixture among the ghost molds and cool to room temperature. Chill molds, covered, at least 4 hours or overnight. ","Make the Sauce: In a small saucepan simmer juice, fresh or frozen cranberries, and sugar, stirring occasionally, until cranberries are softened, about 7 minutes. In a blender, puree mixture until smooth (use caution when blending hot liquids). Pour sauce through a sieve into a small bowl, pressing hard on solids, and discard solids. Cool sauce. Sauce may be made 2 days ahead and chilled, covered. ","Run a thin knife around edge of each mold. Dip molds, 1 at a time, into a bowl of hot water 2 seconds and invert each panna cotta onto a plate. Serve panna cottas with the sauce spooned around the sides."],"exactIngredients":["For Panna Cotta:","1 envelope unflavored gelatin (about 1 tablespoon)","2 tablespoons cold water","2 cups heavy cream","1 cup half-and-half","1/3 cup sugar","1 1/2 teaspoons vanilla extract","For Sauce:","3/4 cup fresh orange juice","1/4 cup fresh or unthawed frozen cranberries","1 1/2 tablespoons sugar","Special Equipment: Several ceramic or silicone ghost-shaped molds"],"baseIngredients":["gelatin","cream","vanilla","orange","cranberry"]},{"title":"Sizzling Garlic Shrimp","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Peter Rodenburg Omelet","totalTime":"55 min","prepTime":"30 min","inactiveTime":-1,"cookTime":"25 min","level":"easy","directions":["Place cabbage stalks, parsley stalks, chilli and soya sauce and allow to stand at least 1 hour. Place clarified butter into frypan and add the onions, toss lightly and add the cabbage, stir and cook 1 minute, add soya sauce mixture. Stir until soya sauce is well distributed. Add the shrimps. Stir lightly with a fork, cover saucepan tightly, remove from heat. Mix eggs with cream, season with garlic, salt and pepper. Heat an omelet pan and add the butter and sufficient eggs and cream to make one omelet. Stir well and when evenly cooked but still moist and runny on top, add one portion of the prepared filling. Turn omelet onto dish, place a small piece of butter on top and garnish with parsley. Continue until 4 omelets are made."],"exactIngredients":["1 -ounce cabbage stalk, cut into matchstick slivers","1 teaspoon parsley stalks, finely chopped","1 tablespoon green chilli, finely chopped","3 tablespoons soya sauce","1/4 cup clarified butter","1 1/2 ounces onion, finely sliced","6 ounces white cabbage, finely sliced","6 ounces shrimp, cooked and peeled","8 eggs","1/4 cup cream","Garlic, salt, white peppercorns","2 tablespoons butter"],"baseIngredients":["shrimp","egg","cream"]},{"title":"\"Smiling\" Grilled Cheese","totalTime":"15 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"5 min","level":"easy","directions":["Heat a skillet over medium heat. Spread the butter on both sides of the bread.","Build the sandwich with the ham and cheeses and place in the hot skillet. Cook until the bread is golden and toasty, a few minutes on each side.","Arrange the tomato halves for the eyes, 1/4 cheese slice for a nose and pickle spear for a smile.","This recipe was created by a contestant during a cooking competition. The Food Network Kitchens have not tested it for home use, therefore, we cannot make any representation as to the results."],"exactIngredients":["2 tablespoons butter, softened","2 slices rustic white bread","2 slices ham","2 slices American cheese, plus 1/4 slice for serving","2 slices mozzarella cheese","1 grape tomato, halved","1 small pickle spear"],"baseIngredients":["bread","ham","cheese","grape"]},{"title":"The Union Stimulus Package","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"","directions":["Muddle 4 strawberries (hulled and halved) and 1/4 ounce agave nectar in a cocktail shaker. Add 2 ounces vodka (preferably Kanon Organic) and 4 ounces seltzer. Shake, then pour into a tall ice-filled glass. Garnish with a strawberry.","Photograph by Charles Masters"],"exactIngredients":[],"baseIngredients":[]},{"title":"Lava Flow","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Blend all ingredients except strawberry puree. Pour into a cocktail glass and garnish with strawberry puree."],"exactIngredients":["1 ounce coconut syrup","2 ounces pineapple juice","1 1/2 ounces rum","Splash vanilla ice milk (or ice cream)","1/2 cup ice","1 1/2 ounces strawberry puree"],"baseIngredients":["coconut","pineapple","cream","strawberry"]},{"title":"Detoxifying Paradise Juice","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Mix all ingredients together and serve cold."],"exactIngredients":["8 ounces grapefruit juice","1/2 cup papaya chunks","3/4 cup pineapple chunks","Pinch chopped parsley leaves"],"baseIngredients":["grapefruit","papaya","pineapple"]},{"title":"Eggs Stuffed with Anchovies and Tuna","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"White Hot Chocolate","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Red Wine Glogg","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Roasted Apricot Sorbet","totalTime":"1 hr 22 min","prepTime":"20 min","inactiveTime":"2 min","cookTime":"1 hr","level":"easy","directions":["Preheat oven to 350 degrees F.","Bring sugar, water, and dried apricots to a boil in a 3-quart heavy saucepan over moderate heat, stirring, until sugar is dissolved. Remove from heat and let stand until apricots are softened, about 1 hour.","While dried apricots are standing, roast whole fresh apricots in a small roasting pan in middle of oven until soft, about 1 hour. Cool in pan, and pit when cool enough to handle.","Puree dried apricot mixture, roasted apricots, lemon juice, and almond extract in a blender until very smooth, 1 1/2 to 2 minutes. Force puree through a fine sieve into a bowl, pressing hard on solids and then discarding them. Chill puree, covered, until cold, at least 2 hours.","Freeze in ice cream maker, then transfer to an airtight container, and put in freezer to harden.","Cook's note: Puree can be chilled up to 8 hours. Sorbet keeps 1 week."],"exactIngredients":["3/4 cup sugar","1/2 cup water","1/3 cup dried apricots, chopped","1 3/4 pounds firm-ripe apricots (about 7 large)","2 tablespoons fresh lemon juice","1/8 teaspoon almond extract","Garnish: toasted sliced almonds","Special equipment: an ice cream maker"],"baseIngredients":["apricot","lemon","ice cream"]},{"title":"The Man Handler","totalTime":"1 hr 30 min","prepTime":"15 min","inactiveTime":"1 hr","cookTime":"15 min","level":"easy","directions":["Preheat the oven to 450 degrees F.","Combine the olive oil, balsamic vinegar, rosemary, garlic, and pepper. Marinate the striploin in the mixture for 60 minutes.","Heat a cast iron pan over high heat. Season the marinated striploin with salt. Place the steak in the hot pan, the marinade has enough oil in it so that it is not necessary to add extra. Sear for 2 minutes, flip over, sear for 1 minute and place on a baking sheet.","Continue searing the remainder of the steaks. Place baking sheet into the oven and cook to desired color and doneness. For medium, cook for 9 minutes. Serve with fried eggs."],"exactIngredients":["3/4 cup olive oil","1/2 cup balsamic vinegar","1/4 cup chopped rosemary leaves","1 tablespoon minced garlic","1 tablespoon freshly ground black pepper","6 (10 ounce) striploin steaks","Kosher salt","Serving suggestion: fried eggs"],"baseIngredients":["steak","egg"]},{"title":"Spicy Cherry Token Cookies","totalTime":"4 hr 12 min","prepTime":"30 min","inactiveTime":"3 hr 30 min","cookTime":"12 min","level":"easy","directions":["For the cookies: Cream the butter, lemon zest, and sugars until light and fluffy. Slowly add the egg and lemon juice. Add the cherries. In another bowl, mix together the flours, baking soda, chile powder, and salt. Add to the butter mixture. Roll in parchment paper to a diameter of 3/4-inch. Chill well (or freeze).","Preheat the oven to 350 degrees F. Line a baking sheet with parchment paper.","When the batter is chilled, slice into 1/4-inch coins. Bake on prepared baking sheet until light golden brown, 12 minutes. Cool slightly.","For the glaze: Mix the powdered sugar and lemon juice thoroughly.","Drizzle the lemon glaze over the cookies while still warm.","This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."],"exactIngredients":["Cookies:","4 ounces butter","1 lemon, zested","1/2 cup granulated sugar","1/2 cup brown sugar","1 egg","1 teaspoon lemon juice","1/4 cup dried tart cherries, finely chopped","1 3/4 cup flour","1/2 cup almond flour","1/2 teaspoon baking soda","1 1/2 teaspoons chile powder","1/2 teaspoon salt","Lemon Glaze:","2 cups powdered sugar","1 tablespoon lemon juice"],"baseIngredients":["cookie","lemon","egg","cherry"]},{"title":"Escarole-Bacon Salad","totalTime":"15 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"5 min","level":"easy","directions":["Cook 6 diced strips bacon in a skillet; drain on paper towels. Whisk 2 teaspoons dijon mustard, 3 tablespoons red wine vinegar, 1 teaspoon honey, and salt and pepper into the drippings. Whisk in 2 tablespoons olive oil. Toss the dressing with 1 head torn escarole, some sliced radishes, shaved gouda and the bacon.","Photograph by Antonis Achilleos"],"exactIngredients":[],"baseIngredients":[]},{"title":"Mostly Roasted Veggie Explosion","totalTime":"40 min","prepTime":"25 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["Preheat oven to 425 degrees F.","Spray 2 baking sheets with nonstick spray. Set aside.","Cut off and discard the tough ends of the asparagus stalks. Lay asparagus on the sheets. Lay carrots and pepper strips on the sheets as well.","Cut eggplant lengthwise into six to eight 1/4-inch slices. Blot excess moisture from the slices with paper towels. Arrange the eggplant slices flat on the sheets. Sprinkle veggies with the salt and black pepper.","Roast the veggies until tender, about 15 minutes.","Once the veggies are cool enough to handle, place one basil leaf lengthwise on an eggplant slice. Add a cherry tomato at the short base of the slice. Roll up the eggplant around the tomato and secure with a toothpick. Repeat with all of the other eggplant slices.","If you like, refrigerate the eggplant rolls and roasted veggies until completely chilled, at least 1 hour.","When it's time to serve, arrange the roasted veggies on a platter with the jicama and sugar snap peas.","PER SERVING (1/8th of platter): 70 calories, "],"exactIngredients":["1 pound asparagus","2 cups baby carrots","1 red bell pepper, stem removed, seeded, and cut into 1/2-inch-thick slices","1 yellow bell pepper, stem removed, seeded, and cut into 1/2-inch-thick slices","1 eggplant, ends removed","1/4 teaspoon salt","1/4 teaspoon black pepper","6 to 8 fresh basil leaves","6 to 8 cherry tomatoes","1 small jicama, peeled and cut into 1/2-inch-wide sticks","2 cups sugar snap peas, stems removed"],"baseIngredients":["asparagus","carrot","eggplant","cherry tomato","jicama","pea"]},{"title":"Linzer Cookies","totalTime":"35 min","prepTime":"20 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["Position racks in the lower and upper third of the oven and preheat to 350. Place the almonds and pecans on a baking sheet; toast on the upper oven rack until lightly browned and fragrant, about 8 minutes. Let cool, then pulse in a food processor with 1/4 cup granulated sugar until finely ground. (Don't overprocess or the mixture will turn into a paste.) Turn off the oven.","Whisk the flour, cinnamon, cardamom and salt in a medium bowl. Set aside.","Using a mixer, beat the butter and the remaining 11/4 cups granulated sugar in a large bowl until light and fluffy. Beat in the vanilla extract, egg yolks, and the lemon and orange zest; add the ground nuts. Add the flour mixture, mixing just until incorporated (do not overmix). Divide the dough into 2 pieces; place 1 piece between 2 lightly floured sheets of parchment paper and roll into a 14-inch square, about 1/4-inch thick. Repeat with the other piece of dough. Refrigerate both rectangles, covered with the parchment sheets, until firm, at least 1 hour.","Preheat the oven to 350. Cut the dough into hearts with a 21/4- to 21/2-inch heart-shaped cookie cutter. Using a smaller heart-shaped cutter (about 11/2 inches), cut out the centers from half of the cookies (you can reroll the centers and scraps). Place the cookies, about 1 inch apart, on baking sheets and bake 2 sheets at a time until the edges are golden, 12 to 15 minutes, rotating the sheets halfway through. Cool on wire racks. ","Sift confectioners' sugar over the cookies. Spread 1 teaspoon raspberry preserves evenly over each whole heart cookie, leaving a slight border around the edge; top with the cut-out heart cookies.","Photograph by Allan Penn"],"exactIngredients":["1 1/2 cups whole almonds","1 cup pecans","11/2 cups granulated sugar","5 cups all-purpose flour, plus more for dusting","2 teaspoons ground cinnamon","1/2 teaspoon ground cardamom","1 teaspoon salt","5 sticks unsalted butter, at room temperature","1 tablespoon vanilla extract","6 large egg yolks","Grated zest of 1 lemon","Grated zest of 1 orange","1/4 cup confectioners' sugar","1 cup seedless raspberry preserves"],"baseIngredients":["pecan","vanilla","egg","lemon","orange","raspberry"]},{"title":"Green Tea Rocket","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Combine the orange liqueur, vodka, green tea bag, bitters and orange zest in a large mug. Add the hot water and steep for 3 minutes. Heat a cocktail glass by placing under hot running water. Stir the cocktail and strain into the glass; serve hot.","Photograph by Yunhee Kim"],"exactIngredients":["1 1/2 ounces orange liqueur","1/2 ounce vanilla vodka","1 bag green tea","2 dashes orange bitters","1/2 teaspoon grated orange zest","6 ounces hot water"],"baseIngredients":["orange","vanilla","green tea"]},{"title":"Pacific Cider","totalTime":"5 min","prepTime":"5 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["In a large glass filled with ice, pour in equal parts ginger ale, hard apple cider and green apple Schnapps."],"exactIngredients":["Ice cubes","1 part ginger ale","1 part hard apple cider","1 part green apple Schnapps"],"baseIngredients":["apple"]},{"title":"Serrano Ham Crostini","totalTime":-1,"prepTime":-1,"inactiveTime":-1,"cookTime":-1,"level":"","directions":[],"exactIngredients":[],"baseIngredients":[]},{"title":"Cornmeal Molasses Muffins","totalTime":"1 hr 20 min","prepTime":"20 min","inactiveTime":"35 min","cookTime":"25 min","level":"easy","directions":["1. Preheat the oven to 350 degrees F. Cut parchment paper into twelve 5-by-5-inch squares. Lightly grease the inside of a 12-cup muffin tin. Center a square of parchment paper over 1 of the cups and use your fingers to press the parchment into the cup, so that it sticks to the sides and bottom. Crease the paper as needed to fit and repeat with the remaining parchment (regular muffin liners work just as well but the parchment looks pretty).","2. Combine the cornmeal, flour, sugar, baking powder, cinnamon, salt and baking soda in a large bowl.","3. Whisk together the yogurt, applesauce, molasses, orange zest, eggs and butter in a separate small bowl.","4. Fold the wet ingredients into the dry until just combined (don't fret if the batter is lumpy, this means your batter isn't over-mixed).","5. Fill each liner almost to the top of the tin (an ice-cream scoop lightly greased with nonstick spray will help). Sprinkle each muffin with the toasted oats.","6. Bake, rotating about halfway through, until a toothpick inserted in the muffins comes out clean and the tops are just slightly puffed and spring back when touched, 20 to 24 minutes. Let rest in the hot muffin pan 3 minutes, then transfer to a cooling rack and let cool 30 minutes. Store the cooled muffins in an airtight container for up to 3 days."],"exactIngredients":["Vegetable oil or pan spray, for greasing","1 cup stone-ground cornmeal","1 cup all-purpose flour","1/2 cup sugar","1 teaspoon baking powder","1 teaspoon ground cinnamon","3/4 teaspoon fine salt","1/2 teaspoon baking soda","2/3 cup plain yogurt or sour cream1/2 cup smooth applesauce","1/2 cup molasses","1/2 teaspoon finely grated orange zest","2 large eggs","1 stick unsalted butter, melted (8 tablespoons)1/4 to 1/3 cup toasted oats for sprinkling, optional"],"baseIngredients":["cornmeal","sour","molasses","orange","egg"]},{"title":"Poached Fillet of Trout","totalTime":"1 hr 10 min","prepTime":"45 min","inactiveTime":"5 min","cookTime":"20 min","level":"easy","directions":["Preheat the oven to 400 degrees F.","To make the couscous: Bring the stock to a boil in a saucepan over high heat. Add a pinch of salt and the couscous. Stir the couscous and return to boil for 1 minute. Remove the pot from the heat, cover let stand for 5 minutes, then fluff the couscous with a fork. Mix in the diced vegetables, egg and herbs. Season the couscous with salt and lemon and allow to cool.","To prepare the trout: Season the trout on both sides with salt and pepper. Lay fish skin side down. Spoon about 1/4 of the couscous onto the large end of each fillet. Fold the tails over (to make a tidy packet) and secure with toothpicks. ","Melt the butter in a large ovenproof skillet over medium heat. Add the shallots and cook until they are soft, about 7 minutes. Add the trout, wine, lemon juice, and saffron. Season the shrimp with salt and pepper and lay them on the trout bundles. Add the herb sprigs, cover the pan and put it in the oven. Cook until the trout is flaky and the shrimp are opaque, about 5 minutes. Transfer the trout and shrimp to serving plates.","To make the sauce: return the poaching liquid to a burner and simmer over high heat. Remove the herb sprigs and add the cream. Reduce the sauce until it coats the back of a spoon, about 3 minutes. ","Spoon sauce onto each of the plates. Garnish with dill, lemon, and chopped parsley and serve."],"exactIngredients":["Couscous:","1 1/4 cups fish or chicken stock","Kosher salt","1 cup couscous","1 cup diced, blanched mixed vegetables such as carrots, celery, zucchini, scallions, yellows squash, and red pepper","1 egg","1/4 cup mixed chopped tarragon, dill and parsley leaves","Lemon juice, to taste","Stuffed trout:","4 trout fillets","Kosher salt and freshly ground black pepper","3 tablespoons butter","1/4 cup diced shallots","1 cup dry white wine","1 tablespoon lemon juice","Pinch saffron, crumbled","8 shrimp, peeled and deveined","1 sprig tarragon","1 sprig dill","2 sprigs parsley","Cream Sauce:","1/2 cup heavy cream","Kosher salt and freshly ground black pepper","4 fresh dill sprigs","4 lemon twists","Chopped parsley, for garnish"],"baseIngredients":["chicken","red pepper","egg","dill","lemon","fillet","shallots","saffron","shrimp","tarragon","cream"]},{"title":"Idaho Rainbow Trout and Prawn Napoleon With Lemon-Shallot Beurre Blanc Sauce","totalTime":"1 hr 30 min","prepTime":"45 min","inactiveTime":-1,"cookTime":"45 min","level":"easy","directions":["Preheat oven to 250 degrees F.","Season trout fillets and prawns with salt, garlic, and lemon pepper. Heat 2 tablespoons olive oil in a large saute pan over medium-high heat and then place trout fillets, skin-side down. Saute fish for 1 minute, turn, and cook for 1 more minute, or until fish is just cooked through. Add 1/2 cup chardonnay to the pan and hold in a warm oven until ready to serve. In another saute pan, heat remaining 2 tablespoons olive oil, add shrimp, and cook for 1 to 2 minutes on each side. Add the remaining 1/2 cup chardonnay to the pan and hold in warm oven. ","In the middle of each entree plate, place 1/3 cup hot mashed potatoes. Place 2 spears of asparagus on top of the potatoes. Place 1 portion of cooked trout on top of the asparagus, and then place 1/3 cup additional mashed potatoes on trout. Place 1 tablespoon of cooked spinach on the potatoes and top with 2 prawns. Drizzle each plate with a little Lemon-Shallot Beurre Blanc Sauce, and garnish each plate with 3 gaufrette chips.","8 large Idaho potatoes, peeled and cut into 1-inch pieces","2 teaspoons salt","6 tablespoons unsalted butter, melted","1 cup heavy cream","1/4 teaspoon freshly ground white pepper","Place potatoes in a medium saucepan and cover the potatoes with water by 1-inch. Add 1 teaspoon salt and bring to a boil. Reduce the heat, and simmer until the potatoes are ","fork tender, about 12 to 15 minutes. Drain into a colander. In a mixing bowl, mash potatoes until no lumps remain, and then add butter. Next add cream, remaining 1 teaspoon salt, and pepper. Cover and keep warm until ready to serve.","Yield: about 6 cups","Lemon-Shallot Beurre Blanc Sauce: ","1/4 cup Champagne vinegar","1 cup chardonnay wine","2 tablespoons minced shallots","3 tablespoons heavy cream","1/2 pound unsalted butter","1 tablespoon lemon juice","1/2 teaspoon kosher salt","1/4 teaspoon white pepper","In a small heavy saucepan, boil the Champagne vinegar and chardonnay with the shallots over high heat until only 1 tablespoon of liquid remains. Add heavy cream and cook for 1 minute. Remove from heat and add butter, 1 tablespoon at a time, whisking after each addition until melted before adding more. When all the butter has been incorporated, whisk in the lemon juice, kosher salt, and white pepper. Hold the sauce in a warm spot but not over direct heat.","Vegetable oil, for deep frying","1 medium Idaho potato, peeled ","Salt","Heat oil in a deep fryer to 350 degrees F. Alternatively, fill a large, deep, heavy pot halfway with oil and heat to 350 degrees F. Using a mandoline, make very thin, cross-cut potato slices. Fry until golden brown. Remove to a paper towel-lined plate to drain and salt lightly.","Yield: about 24 chips"],"exactIngredients":["8 (4-ounce) rainbow trout fillets","16 (size U-15) prawns, peeled and de-veined","1 tablespoon kosher salt","1 tablespoon granulated garlic","1 tablespoon lemon pepper","4 tablespoons olive oil","1 cup chardonnay wine","6 cups Idaho Mashed Potatoes, recipe follows","16 asparagus spears, cooked and kept warm","1/2 cup cooked spinach, kept warm","Lemon-Shallot Beurre Blanc Sauce, recipe follows","24 Idaho Potato Gaufrette Chips, recipe follows"],"baseIngredients":["fillet","lemon","mashed potatoes","asparagus","spinach","chips"]},{"title":"Poached Fillet of Trout","totalTime":"1 hr 10 min","prepTime":"45 min","inactiveTime":"5 min","cookTime":"20 min","level":"easy","directions":["Preheat the oven to 400 degrees F.","To make the couscous: Bring the stock to a boil in a saucepan over high heat. Add a pinch of salt and the couscous. Stir the couscous and return to boil for 1 minute. Remove the pot from the heat, cover let stand for 5 minutes, then fluff the couscous with a fork. Mix in the diced vegetables, egg and herbs. Season the couscous with salt and lemon and allow to cool.","To prepare the trout: Season the trout on both sides with salt and pepper. Lay fish skin side down. Spoon about 1/4 of the couscous onto the large end of each fillet. Fold the tails over (to make a tidy packet) and secure with toothpicks. ","Melt the butter in a large ovenproof skillet over medium heat. Add the shallots and cook until they are soft, about 7 minutes. Add the trout, wine, lemon juice, and saffron. Season the shrimp with salt and pepper and lay them on the trout bundles. Add the herb sprigs, cover the pan and put it in the oven. Cook until the trout is flaky and the shrimp are opaque, about 5 minutes. Transfer the trout and shrimp to serving plates.","To make the sauce: return the poaching liquid to a burner and simmer over high heat. Remove the herb sprigs and add the cream. Reduce the sauce until it coats the back of a spoon, about 3 minutes. ","Spoon sauce onto each of the plates. Garnish with dill, lemon, and chopped parsley and serve."],"exactIngredients":["Couscous:","1 1/4 cups fish or chicken stock","Kosher salt","1 cup couscous","1 cup diced, blanched mixed vegetables such as carrots, celery, zucchini, scallions, yellows squash, and red pepper","1 egg","1/4 cup mixed chopped tarragon, dill and parsley leaves","Lemon juice, to taste","Stuffed trout:","4 trout fillets","Kosher salt and freshly ground black pepper","3 tablespoons butter","1/4 cup diced shallots","1 cup dry white wine","1 tablespoon lemon juice","Pinch saffron, crumbled","8 shrimp, peeled and deveined","1 sprig tarragon","1 sprig dill","2 sprigs parsley","Cream Sauce:","1/2 cup heavy cream","Kosher salt and freshly ground black pepper","4 fresh dill sprigs","4 lemon twists","Chopped parsley, for garnish"],"baseIngredients":["chicken","red pepper","egg","dill","lemon","fillet","shallots","saffron","shrimp","tarragon","cream"]},{"title":"Idaho Rainbow Trout and Prawn Napoleon With Lemon-Shallot Beurre Blanc Sauce","totalTime":"1 hr 30 min","prepTime":"45 min","inactiveTime":-1,"cookTime":"45 min","level":"easy","directions":["Preheat oven to 250 degrees F.","Season trout fillets and prawns with salt, garlic, and lemon pepper. Heat 2 tablespoons olive oil in a large saute pan over medium-high heat and then place trout fillets, skin-side down. Saute fish for 1 minute, turn, and cook for 1 more minute, or until fish is just cooked through. Add 1/2 cup chardonnay to the pan and hold in a warm oven until ready to serve. In another saute pan, heat remaining 2 tablespoons olive oil, add shrimp, and cook for 1 to 2 minutes on each side. Add the remaining 1/2 cup chardonnay to the pan and hold in warm oven. ","In the middle of each entree plate, place 1/3 cup hot mashed potatoes. Place 2 spears of asparagus on top of the potatoes. Place 1 portion of cooked trout on top of the asparagus, and then place 1/3 cup additional mashed potatoes on trout. Place 1 tablespoon of cooked spinach on the potatoes and top with 2 prawns. Drizzle each plate with a little Lemon-Shallot Beurre Blanc Sauce, and garnish each plate with 3 gaufrette chips.","8 large Idaho potatoes, peeled and cut into 1-inch pieces","2 teaspoons salt","6 tablespoons unsalted butter, melted","1 cup heavy cream","1/4 teaspoon freshly ground white pepper","Place potatoes in a medium saucepan and cover the potatoes with water by 1-inch. Add 1 teaspoon salt and bring to a boil. Reduce the heat, and simmer until the potatoes are ","fork tender, about 12 to 15 minutes. Drain into a colander. In a mixing bowl, mash potatoes until no lumps remain, and then add butter. Next add cream, remaining 1 teaspoon salt, and pepper. Cover and keep warm until ready to serve.","Yield: about 6 cups","Lemon-Shallot Beurre Blanc Sauce: ","1/4 cup Champagne vinegar","1 cup chardonnay wine","2 tablespoons minced shallots","3 tablespoons heavy cream","1/2 pound unsalted butter","1 tablespoon lemon juice","1/2 teaspoon kosher salt","1/4 teaspoon white pepper","In a small heavy saucepan, boil the Champagne vinegar and chardonnay with the shallots over high heat until only 1 tablespoon of liquid remains. Add heavy cream and cook for 1 minute. Remove from heat and add butter, 1 tablespoon at a time, whisking after each addition until melted before adding more. When all the butter has been incorporated, whisk in the lemon juice, kosher salt, and white pepper. Hold the sauce in a warm spot but not over direct heat.","Vegetable oil, for deep frying","1 medium Idaho potato, peeled ","Salt","Heat oil in a deep fryer to 350 degrees F. Alternatively, fill a large, deep, heavy pot halfway with oil and heat to 350 degrees F. Using a mandoline, make very thin, cross-cut potato slices. Fry until golden brown. Remove to a paper towel-lined plate to drain and salt lightly.","Yield: about 24 chips"],"exactIngredients":["8 (4-ounce) rainbow trout fillets","16 (size U-15) prawns, peeled and de-veined","1 tablespoon kosher salt","1 tablespoon granulated garlic","1 tablespoon lemon pepper","4 tablespoons olive oil","1 cup chardonnay wine","6 cups Idaho Mashed Potatoes, recipe follows","16 asparagus spears, cooked and kept warm","1/2 cup cooked spinach, kept warm","Lemon-Shallot Beurre Blanc Sauce, recipe follows","24 Idaho Potato Gaufrette Chips, recipe follows"],"baseIngredients":["fillet","lemon","mashed potatoes","asparagus","spinach","chips"]},{"title":"Mincemeat Stuffed Chiles: Otros Chiles en Frio","totalTime":"1 hr 50 min","prepTime":"50 min","inactiveTime":"30 min","cookTime":"30 min","level":"easy","directions":["Simmer the almonds in 2 cups water for 2 minutes in a 1-quart saucepan. Drain and cool. Remove the peels by gently rubbing the almonds between your fingers. Alternatively, you can substitute 1/4 cup already blanched and peeled whole almonds.","Coarsely chop almonds and raisins in a food processor and set aside. Heat the oil in a 12-inch skillet over a medium flame. Saute the garlic and onions until the onions become translucent. Add the ground pork and beef and continue sauteing until the meat mixture is browned. Add the pureed tomato and cloves and saute about 1 minute. Add the remaining ingredients, including the ground almonds and raisins. Continue cooking until all the moisture has been reduced. Set the mincemeat aside to cool. Fill each chile with 2 tablespoons of mincemeat stuffing. Arrange the chiles on a bed of lettuce either on individual plates or a large platter. Spoon dressing over the chiles, making sure that each one is thoroughly covered. Serve immediately.","1 cup whole almonds","3 cups water","2 tablespoons nonpareil capers","3/4 cup virgin olive oil","1/3 cup white wine or pineapple vinegar","1 teaspoon salt","Simmer the almonds in 3 cups water for 2 minutes in a 2-quart saucepan. Drain and cool. Remove the peels by gently rubbing the almonds between your fingers. Alternatively, you can substitute 1/4 cup already blanched and peeled whole almonds.","Place almonds and capers in a food processor and grind to a fine paste. Slowly add oil and process until mixture attains a pesto-like consistency. Pour into a mixing bowl and briskly stir in the wine or vinegar and salt. Spoon dressing over the chiles, making sure that each one is thoroughly covered."],"exactIngredients":["1/4 cup whole almonds","1/4 cup raisins","2 tablespoons olive oil","2 garlic cloves, finely minced","1 tablespoon minced white onion","1/2 pound ground lean pork tenderloin","1/2 pound ground sirloin","1 cup roasted, peeled, and pureed tomatoes","1/4 teaspoon ground cloves","1 teaspoon salt","1 candied citrus peel, chopped","1/2 teaspoon brown sugar","1/4 teaspoon ground white pepper","12 large poblano chiles, roasted, sweated, and peeled","Almond-Caper Dressing, recipe follows"],"baseIngredients":["raisin","pork","tomato","citrus"]},{"title":"Silver Salmon Martini","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Place sugar in a small saucer. Dip the rim of the glass in water and press rim into the sugar to coat.","Mix all ingredients, except caviar or salmon egg roe, in a shaker. Put the caviar on the bottom of the glass and pour the drink over the caviar."],"exactIngredients":["1 teaspoon sugar","1 -ounce vodka","1 -ounce silver rum (recommended: Bacardi)","1/2 -ounce pineapple juice","1/2 -ounce grape juice","1/2 -ounce pink lemonade","1/2 teaspoon caviar or salmon egg roe"],"baseIngredients":["pineapple","grape","lemonade","caviar"]},{"title":"Silver Salmon Martini","totalTime":"10 min","prepTime":"10 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Place sugar in a small saucer. Dip the rim of the glass in water and press rim into the sugar to coat.","Mix all ingredients, except caviar or salmon egg roe, in a shaker. Put the caviar on the bottom of the glass and pour the drink over the caviar."],"exactIngredients":["1 teaspoon sugar","1 -ounce vodka","1 -ounce silver rum (recommended: Bacardi)","1/2 -ounce pineapple juice","1/2 -ounce grape juice","1/2 -ounce pink lemonade","1/2 teaspoon caviar or salmon egg roe"],"baseIngredients":["pineapple","grape","lemonade","caviar"]},{"title":"Salt-and-Pepper Edamame","totalTime":"25 min","prepTime":"10 min","inactiveTime":-1,"cookTime":"15 min","level":"easy","directions":["Toast salt in a dry, small, heavy skillet over moderate heat, stirring, until the salt turns light tan, about 7 minutes. Transfer salt to a bowl. ","Toast Szechwan peppercorns in skillet over moderate heat, stirring, until fragrant, about 2 minutes. Transfer toasted peppercorns to a sheet of waxed paper to cool. Using paper as a funnel, pour toasted peppercorns into an electric coffee/spice grinder or a mortar. Add pink peppercorns and pulse or pound with a pestle until finely ground. Pour through a coarse sieve into bowl of salt and stir together. ","Cook edamame in salted boiling water until tender, about 4 minutes, and immediately transfer with a slotted spoon to a bowl of ice and cold water to stop cooking. Drain in a colander and pat dry. ","Toss edamame with some peppered salt, to taste, and serve with remainder on the side. ","Cooks' notes: Peppered salt may be made 1 week ahead and kept in an airtight container at cool room temperature. Edamame may be cooked 1 day ahead and chilled, covered. Bring to room temperature before tossing with peppered salt."],"exactIngredients":["1/4 cup coarse sea salt","1 tablespoon Szechwan peppercorns","1 tablespoon pink peppercorns","1 (1-pound) bag frozen edamame (soybeans in the pod)"],"baseIngredients":["soybeans"]},{"title":"Ribollita","totalTime":"2 hr","prepTime":"30 min","inactiveTime":-1,"cookTime":"1 hr 30 min","level":"easy","directions":["Soak the beans in 2 quarts of water overnight, and then boil them until tender, about 45 minutes to 1 hour. Rub 3/4 of the beans through a sieve and put the puree back into the cooking water. Put aside the remaining whole beans. Brown the garlic and the chopped onion in 8 tablespoons of oil, and as soon as they have softened, add 2 tablespoons of tomato puree diluted with a glass of warm water. Add the very finely chopped carrot and the celery, the cabbages, chard, and the potatoes. Season with salt and pepper, cook for a few minutes and then add the pureed beans. Continue cooking for an hour. When the vegetables are well done, add the sliced bread and the whole beans previously put aside. Mix well, pour into a soup tureen and serve with a touch of extra-virgin olive oil and the thinly sliced onion passed around separately."],"exactIngredients":["16 ounces dried white beans","1 garlic clove","2 onions, 1 chopped, 1 thinly sliced","8 tablespoons extra-virgin olive oil, plus extra for serving","2 tablespoons tomato puree","1 glass warm water","1 carrot, finely chopped","1 stalk celery, finely chopped","1/2 Savoy cabbage, washed and cut into strips","1 red cabbage, washed and cut into strips","1 bunch chard, washed and cut into strips","2 potatoes, peeled, thinly sliced","Salt","Pepper","12 ounces stale homemade or stale store bought Italian bread, thinly sliced"],"baseIngredients":["beans","tomato","carrot","celery","chard","potato","bread"]},{"title":"Chocolate Angel Food and Raspberry Parfait","totalTime":"20 min","prepTime":"20 min","inactiveTime":-1,"cookTime":-1,"level":"easy","directions":["Using a hand held mixer, beat together the cream, sugar, cocoa powder and vanilla until stiff peaks form, keep cold. ","Place a few cubes of the angel food cake in the bottom of 4 parfait glasses and drizzle with 1 teaspoon of framboise. Top with a few tablespoons of the chocolate cream, a few tablespoons of raspberries and a grated chocolate. Repeat to make 4 layers ending with chocolate cream. Garnish with a few raspberries and grated chocolate."],"exactIngredients":["1 cup very cold heavy cream","3 tablespoons granulated sugar","3 tablespoons best quality cocoa powder","1 teaspoon vanilla extract","1 store-bought chocolate angel food cake, cut into cubes","1/4 cup framboise (raspberry liqueur)","1 pint fresh raspberries","Grated bittersweet chocolate"],"baseIngredients":["cream","vanilla","cake","raspberry","chocolate"]}]